{"en_translation": "notebook", "word": "ノート", "language_code": "ja", "examples": ["授業の内容をノートにまとめました。", "新しいノートを３冊買いました。", "彼はいつもノートとペンを持ち歩いている。"], "description": "A book with blank or lined pages, used for writing things down, such as lecture notes, meeting minutes, or personal thoughts. It's a common stationery item for students and professionals.", "image_description": "A single, spiral-bound notebook is open on a wooden table. A black pen is resting on the right-hand page, where a few lines of Japanese text are neatly written. The notebook is the main focus, with the background being simple and uncluttered to avoid distractions."}
{"en_translation": "textbook", "word": "教科書", "language_code": "ja", "examples": ["新しい学期の前に、すべての教科書を買わなければなりません。", "歴史の教科書を読んで、昔の出来事について学びました。", "先生は教科書の３５ページを開くように言いました。"], "description": "A standard book used in schools for a particular subject. It contains the information that students need to learn for a specific course or academic subject.", "image_description": "A single, thick textbook is lying open in the center of a clean, wooden desk. The cover, visible on one side, has the Japanese characters 「日本語」 (Japanese language) printed on it. The open pages show Japanese text and a few small, colorful illustrations. The background is simple and out of focus, highlighting the textbook as the main object of study."}
{"en_translation": "pen", "word": "ペン", "language_code": "ja", "examples": ["この書類にサインをするために、ペンが必要です。", "彼は先生から赤のペンを借りました。", "すみません、ペンを貸していただけますか？"], "description": "A common writing tool that uses ink to leave a mark on a surface, typically paper. It consists of a point that dispenses the ink and a body that is held for writing. Pens are used for a wide variety of tasks, such as taking notes, signing documents, and drawing.", "image_description": "A close-up of a hand holding a simple blue ballpoint pen, poised to write on a clean, white sheet of paper. The pen's tip is just touching the paper, having drawn a single, straight line of blue ink. The background is minimal and out of focus, emphasizing the action of writing with the pen."}
{"en_translation": "pencil", "word": "鉛筆", "language_code": "ja", "examples": ["この鉛筆はとても書きやすいです。", "試験のために、新しい鉛筆を二本買いました。", "彼女は鉛筆で美しい絵を描いた。"], "description": "A writing instrument consisting of a thin stick of graphite, enclosed in a wooden case. It is used for writing or drawing, and its marks can be easily erased.", "image_description": "A single, yellow wooden pencil with a pink eraser on the end. The pencil is sharpened to a fine point, showing the dark graphite tip. The object is centered against a plain, neutral background, with no other objects present."}
{"en_translation": "eraser", "word": "消しゴム", "language_code": "ja", "examples": ["鉛筆で書いたので、消しゴムで消せます。", "すみません、消しゴムを貸してもらえませんか？", "新しい消しゴムを買ったばかりなのに、もうどこかへ行ってしまった。"], "description": "A common stationery item, typically a small block of rubber or a similar material, used for removing pencil marks from paper by rubbing them away.", "image_description": "A standard pink rectangular eraser is shown in the middle of a piece of white paper. The eraser is actively rubbing out a hand-drawn pencil line, with small rubber shavings visible next to it. The background is a simple, out-of-focus wooden desk surface."}
{"en_translation": "ruler", "word": "定規", "language_code": "ja", "examples": ["この線をまっすぐ引くために定規を使いましょう。", "机の長さを定規で測ってください。", "筆箱に定規が一本入っています。"], "description": "A tool used for measuring distances or for drawing straight lines. It is a common stationery item found in schools and offices, typically made of plastic or metal with markings for centimeters or inches.", "image_description": "A clear, straight ruler is lying on a plain white desk next to a pencil. The ruler has clear markings for centimeters and millimeters. A straight pencil line has been drawn halfway alongside the ruler's edge, demonstrating its function for drawing straight lines."}
{"en_translation": "class/lesson", "word": "授業", "language_code": "ja", "examples": ["今日の授業は面白かったです。", "明日の数学の授業の準備をします。", "授業に遅れないように、早く家を出ました。"], "description": "A structured period of instruction, typically in a school or university setting, where a teacher imparts knowledge to students. It refers to the actual session of teaching and learning, such as a lecture or a classroom lesson.", "image_description": "A teacher stands in front of a classroom, pointing to a whiteboard filled with notes and diagrams. Several students are sitting at their desks, looking towards the teacher and attentively taking notes in their notebooks. The scene captures a focused learning environment during a formal lesson."}
{"en_translation": "class", "word": "クラス", "language_code": "ja", "examples": ["私のクラスは３０人です。", "次のクラスは数学です。", "彼はクラスで一番背が高い。"], "description": "Refers to a 'class' in an educational context. This can mean a group of students who are taught together (e.g., 'Class 3-A') or a specific course or lesson (e.g., 'a Japanese class').", "image_description": "A bright, modern classroom with a teacher at the front pointing to a whiteboard with Japanese writing on it. Several diverse students are sitting at desks, looking attentively towards the teacher. The scene clearly depicts a focused, educational environment like a language or academic class taking place."}
{"en_translation": "teacher", "word": "先生", "language_code": "ja", "examples": ["先生、質問があります。", "田中先生は親切で、分かりやすく教えてくれます。", "私の日本語の先生は、とても熱心な方です。"], "description": "A respectful term for a teacher or instructor in an educational setting. It can be used as a standalone title when addressing a teacher directly, or attached to their surname. This title conveys respect for their knowledge and position.", "image_description": "A friendly Japanese teacher stands in a classroom in front of a whiteboard. The teacher is pointing to Japanese characters written on the board, actively engaged in the act of teaching. The scene is bright and clearly focused on the teacher as a figure of knowledge and instruction."}
{"en_translation": "student", "word": "学生", "language_code": "ja", "examples": ["あの学生は毎日図書館で勉強しています。", "私の兄は大学生です。", "学生割引はありますか？"], "description": "A person who is enrolled at an educational institution, such as a school, college, or university, to learn. While it can refer to students of all levels, it is most commonly used in the context of higher education, like a university student.", "image_description": "A young adult is sitting at a desk in a modern, bright university library, surrounded by bookshelves. The person is focused on an open textbook and is writing notes in a notebook. Their backpack is on the floor next to the chair."}
{"en_translation": "student", "word": "生徒", "language_code": "ja", "examples": ["このクラスの生徒はみんな熱心です。", "先生は生徒たちに質問をしました。", "多くの生徒がその大学への進学を希望している。"], "description": "Refers to a student, particularly at the junior high school or high school level. While it can sometimes be used for elementary students, it is most commonly associated with secondary education. It is distinct from '学生' (gakusei), which is typically used for university or college students.", "image_description": "Several Japanese high school students in school uniforms are sitting at their desks in a classroom. They are looking towards the front of the room, listening attentively to a lesson. One student has their hand raised, ready to ask a question. The focus is on the students as learners in a school environment."}
{"en_translation": "homework", "word": "宿題", "language_code": "ja", "examples": ["今日の宿題は、漢字の練習です。", "夏休みの宿題が多すぎて、終わりません。", "すみません、宿題を家に忘れました。"], "description": "Academic assignments given by a teacher to be completed outside of class, usually at home. This is a regular part of studying for students.", "image_description": "A student is sitting at a wooden desk in their bedroom, focused on writing in a notebook. The desk has a stack of textbooks, a pencil case, and a lit desk lamp, indicating they are studying in the evening. The scene should convey a sense of diligent study at home."}
{"en_translation": "test", "word": "テスト", "language_code": "ja", "examples": ["明日は数学のテストがあります。", "このテストはとても難しかったです。", "JLPTのテストを受ける予定です。"], "description": "A task or examination designed to assess a person's knowledge, skills, or performance in a particular subject or activity. It is a general term often used in academic settings, like a school quiz or a final exam.", "image_description": "A student is sitting at a wooden school desk, focused intently on a test paper in front of them. They are holding a pencil to their chin, looking thoughtful as they read the questions. The classroom setting is bright, but the focus is on the single student and the challenge of the exam paper."}
{"en_translation": "exam", "word": "試験", "language_code": "ja", "examples": ["明日の試験のために、今夜は徹夜で勉強するつもりだ。", "大学入学試験は、多くの学生にとって人生の大きな挑戦です。", "彼は司法試験に合格するために、何年も努力を続けた。"], "description": "A formal test of a person's knowledge or proficiency in a particular subject or skill, often conducted in an academic or professional setting. It can refer to a written, oral, or practical test.", "image_description": "A single student is sitting at a wooden desk in a well-lit, quiet classroom, focused intently on a test paper in front of them. The student is holding a pen, poised to write. Other students can be seen in the blurred background, all diligently working on their own exams, creating a tense and studious atmosphere."}
{"en_translation": "review", "word": "復習", "language_code": "ja", "examples": ["明日の試験のために、復習をしなければならない。", "授業の復習を毎日します。", "この文法、復習しましたか？"], "description": "The act of going over material that has already been learned in order to reinforce one's memory and understanding. It is a key part of the learning process, especially in academic contexts, to ensure that knowledge is retained.", "image_description": "A student is sitting at a desk, looking at a textbook and a notebook. The notebook is filled with handwritten notes. The student is pointing at a diagram in the textbook with a pencil, and then looking at their own notes, appearing to be confirming their understanding of material they've already studied."}
{"en_translation": "preparation/preview", "word": "予習", "language_code": "ja", "examples": ["明日の授業のために、教科書の次の章を予習しておきましょう。", "予習をしっかりしたので、先生の質問に自信を持って答えることができた。", "新しい単語を予習しておくと、授業がもっと分かりやすくなりますよ。"], "description": "To prepare for a lesson in advance. It refers to the act of studying material that will be covered in an upcoming class, so you are familiar with it before the teacher explains it. This is the opposite of 復習 (fukushuu), which means to review material that has already been taught.", "image_description": "A student is sitting at a desk in their bedroom. The desk is neat, with an open textbook, a notebook, and a pen. The student is looking at the textbook and taking notes, preparing for a future class. A calendar on the wall has a circle around 'tomorrow's lesson'."}
{"en_translation": "question", "word": "質問", "language_code": "ja", "examples": ["何か質問はありますか？", "先生に質問があります。", "この問題について質問してもいいですか？"], "description": "A question or inquiry made to seek information, clarification, or an answer. It can be used in both formal and informal contexts when you want to ask about something.", "image_description": "A person is raising their hand, with a thoughtful and curious expression on their face. Above their head, a large, bright question mark hovers in the air, clearly symbolizing the act of asking a question. The background is simple and slightly out of focus to emphasize the person and the question mark."}
{"en_translation": "answer", "word": "答え", "language_code": "ja", "examples": ["先生の質問の答えが分かりません。", "テストの答えを全部書きました。", "その問題の答えは簡単ではない。"], "description": "The information, solution, or conclusion given in response to a question, problem, or inquiry. It specifically refers to the resolution that is sought.", "image_description": "A student sits at a wooden desk, viewed from a slightly elevated angle. On the desk is a clean white piece of paper with the simple math question '2 + 2 = ?' written in black ink. The student's hand is holding a pencil and has just finished writing a large, clear number '4' next to the equals sign. A subtle, warm glow emanates from the number '4', highlighting it as the correct answer."}
{"en_translation": "blackboard/chalkboard", "word": "黒板", "language_code": "ja", "examples": ["先生が黒板に漢字を書いている。", "すみません、黒板の字が小さくて読めません。", "日直の仕事は、授業の後に黒板をきれいにすることです。"], "description": "A smooth, hard, dark-colored surface, typically found in a classroom, made of slate or a similar material. It is designed to be written or drawn on with sticks of chalk.", "image_description": "A large, dark green chalkboard is mounted on a classroom wall. A teacher is in the middle of writing Japanese characters on it with a piece of white chalk. There is a wooden tray at the bottom of the chalkboard holding an eraser and several pieces of chalk."}
{"en_translation": "desk", "word": "机", "language_code": "ja", "examples": ["私の部屋に新しい机があります。", "彼は仕事の書類を机の上に広げた。", "毎日この机で日本語を勉強します。"], "description": "A piece of furniture with a flat tabletop and one or more legs, used as a workspace for activities such as reading, writing, or using a computer. It is commonly found in offices, schools, and homes.", "image_description": "A simple wooden desk is positioned in the center. On its surface, there's an open laptop, a notebook with a pen resting on it, and a single coffee mug. A simple chair is tucked in front of it. The background is a plain, light-colored wall, ensuring the focus remains on the desk."}
{"en_translation": "chair", "word": "椅子", "language_code": "ja", "examples": ["この椅子はとても快適です。", "部屋に椅子がいくつありますか？", "彼は椅子に座って本を読んでいた。"], "description": "A piece of furniture designed for one person to sit on, consisting of a seat, a back, and typically four legs for support. It is a common item found in homes, offices, and various other settings.", "image_description": "A simple wooden chair stands in the center of a brightly lit, minimalist room. The chair has a straight back, a flat seat, and four sturdy legs. There are no other objects in the room, focusing all attention on the chair itself."}
{"en_translation": "dictionary", "word": "辞書", "language_code": "ja", "examples": ["この言葉の意味が分からないので、辞書で調べましょう。", "新しい日本語の辞書を買いました。", "電子辞書はとても便利です。"], "description": "A book or electronic device that lists words of a language in alphabetical order and gives their meaning, or gives the equivalent words in a different language. It is used to look up word definitions, check spelling, and find synonyms or translations.", "image_description": "A thick, hard-cover Japanese dictionary is open on a clean, light-colored wooden desk. The pages are filled with Japanese characters and their definitions. A pair of reading glasses is resting on top of the open pages, with one of the lenses magnifying a single Japanese word and its entry. The scene is brightly lit and focused solely on the dictionary."}
{"en_translation": "book", "word": "本", "language_code": "ja", "examples": ["この本はとても面白いです。", "図書館で本を借りました。", "机の上に本が三冊あります。"], "description": "A collection of written or printed sheets of paper bound together, typically between two covers. It contains text, images, or a combination of both, intended for reading or reference.", "image_description": "A single, hardcover book is standing upright on a plain, light-colored surface. The book is closed, showing its spine and front cover. The cover is a solid, neutral color with no text or distracting images, to keep the focus purely on the object as a 'book'. The lighting is bright and even, casting a soft, subtle shadow."}
{"en_translation": "grammar", "word": "文法", "language_code": "ja", "examples": ["日本語の文法は、勉強すればするほど面白くなります。", "この文が文法的に正しいかどうか、確認してください。", "先生は新しい文法のポイントを説明しました。"], "description": "The system of rules that governs how words are combined to form meaningful sentences. This includes aspects like word order, verb conjugations, and particle usage, providing the structural foundation of the language.", "image_description": "An intricate blueprint of a sentence is laid out on a drafting table. Various parts of speech like nouns, verbs, and particles are shown as interconnected building blocks, forming a complex structure. A large heading at the top of the blueprint clearly reads \"文法\"."}
{"en_translation": "word/vocabulary", "word": "単語", "language_code": "ja", "examples": ["この単語の意味を教えてください。", "毎日新しい単語を五つ覚えるようにしています。", "この本は難しい単語が多いです。"], "description": "A single unit of language that has a meaning and can be used to form sentences. It refers to an individual word, such as one you would find in a dictionary or a vocabulary list.", "image_description": "A Japanese dictionary is open on a table. A magnifying glass is held over the page, focusing and enlarging a single Japanese word, '単語', making it stand out clearly from the other text on the page. The surrounding text is slightly blurred to emphasize the focus on this one word."}
{"en_translation": "kanji", "word": "漢字", "language_code": "ja", "examples": ["この漢字の書き方を教えてください。", "日本の小学校では、約1000の漢字を学びます。", "「愛」という漢字は「love」という意味です。"], "description": "Kanji are logographic characters originating from China that are used in the modern Japanese writing system, along with hiragana and katakana. They are used to write nouns, stems of adjectives and verbs, and Japanese names.", "image_description": "A large, singular Japanese kanji character, specifically the character for 'learning' (学), is meticulously painted in bold, black ink on a sheet of traditional white washi paper. An ink brush is resting beside the paper, its tip still wet with ink. The background is a simple, neutral, slightly out-of-focus wooden surface."}
{"en_translation": "hiragana", "word": "ひらがな", "language_code": "ja", "examples": ["子どもはひらがなを読んでいます。", "この本はひらがなが多いので、読みやすいです。", "漢字の読み方をひらがなで書きます。"], "description": "ひらがな is one of the three Japanese writing systems, along with katakana and kanji. It is a syllabary, meaning each character represents a syllable (e.g., 'ka', 'ki', 'ku'). Hiragana characters have a distinctively rounded, cursive appearance and are used for native Japanese words, grammatical particles, verb and adjective endings, and for writing out the pronunciation of kanji (known as furigana).", "image_description": "A close-up of a Japanese child's notebook filled with carefully practiced hiragana characters. The characters are large, rounded, and written in pencil on grid paper. In the foreground, a single wooden block with the character 'あ' (a) is resting on the page, creating a clear and simple focus on the writing system itself."}
{"en_translation": "katakana", "word": "カタカナ", "language_code": "ja", "examples": ["あなたの名前をカタカナで書いてください。", "「パン」はポルトガル語から来たカタカナの言葉です。", "メニューはカタカナでいっぱいだった。"], "description": "Katakana is one of the three Japanese scripts, alongside hiragana and kanji. It is characterized by its short, straight strokes and angular corners. Katakana is primarily used to write words of foreign origin (e.g., コンピューター for \"computer\"), foreign names and places, onomatopoeia (sound-imitating words), and for emphasis, much like italics are used in English.", "image_description": "A Japanese textbook page is open. On the page, there are several pictures of foreign items like a bus, a cup of coffee, and a computer. Next to each picture, the corresponding word is written in the angular, distinct script of Katakana (バス, コーヒー, コンピューター)."}
{"en_translation": "meaning", "word": "意味", "language_code": "ja", "examples": ["この言葉の意味が分かりません。", "彼の言葉の本当の意味を考えてみた。", "人生の意味とは何だろうか。"], "description": "Refers to the significance or concept that a word, phrase, or sign is intended to convey. It is the underlying idea or message that is meant to be understood when communicating.", "image_description": "A person is looking at a single Japanese kanji character on a flashcard. An arrow is drawn from the kanji to a simple, clear illustration of a lightbulb that is brightly lit, symbolizing the understanding of the character's meaning. The background is neutral and out of focus."}
{"en_translation": "explanation", "word": "説明", "language_code": "ja", "examples": ["先生の説明は分かりやすかったです。", "これについて説明してください。", "計画について説明します。"], "description": "The act of making something clear or easy to understand by describing it in more detail, providing relevant facts, or revealing underlying reasons or causes.", "image_description": "A teacher pointing at a whiteboard filled with diagrams and notes. They are looking towards a student who is sitting at a desk, listening intently with a thoughtful expression. The scene captures the moment of a clear and detailed explanation being given."}
{"en_translation": "example sentence", "word": "例文", "language_code": "ja", "examples": ["この単語の使い方が分からないので、例文を教えてください。", "教科書の例文を暗記して、単語の正しい使い方を学びます。", "先生は新しい文法を説明するために、いくつかの例文を黒板に書いた。"], "description": "An example sentence used to demonstrate the usage or meaning of a word or grammar point. It serves as a model to show how something is correctly used in context.", "image_description": "A Japanese textbook is open on a wooden desk. A single line of Japanese text is highlighted in bright yellow, clearly marked as an 'example sentence'. A stylized magnifying glass is positioned over the highlighted sentence, emphasizing it and showing its role in clarifying meaning. The surrounding text on the page is slightly out of focus."}
{"en_translation": "reading/pronunciation", "word": "読み方", "language_code": "ja", "examples": ["この漢字の読み方を教えてください。", "お名前の読み方は何ですか？", "この単語は読み方がとても難しいです。"], "description": "Refers to the correct way to pronounce a word or read a character, especially for Japanese Kanji which can have multiple readings. It's the term you use when asking for or explaining the pronunciation of something, from a single character to a person's name.", "image_description": "A person is pointing at a complex Japanese kanji in a book. Above the kanji, small phonetic hiragana characters (known as furigana) are written, visually showing the pronunciation. The focus is tight on the kanji and the furigana, with the background blurred."}
{"en_translation": "practice", "word": "練習", "language_code": "ja", "examples": ["毎日ピアノの練習をしています。", "サッカーの試合の前に、チームは厳しい練習をしました。", "もっと話す練習をしないと、日本語が上手になりませんよ。"], "description": "The act of repeatedly performing an action or skill in order to improve proficiency. This can refer to sports, musical instruments, language learning, or any other activity that requires repeated effort to master.", "image_description": "A young person sits at a piano, focused on practicing a piece of music. Their hands are on the keys, and their gaze is fixed on the sheet music. Beside the piano, a metronome is ticking, and a small stack of music books rests on the floor, suggesting a dedicated and repeated effort to learn and improve."}
{"en_translation": "study", "word": "勉強", "language_code": "ja", "examples": ["図書館で日本語を勉強します。", "毎日３時間ぐらい勉強しなければなりません。", "もっと熱心に勉強するべきだった。"], "description": "The act of learning or studying, typically in an academic context. It refers to the process of acquiring knowledge or skills, such as preparing for an exam, doing homework, or learning a new subject. It can be used as a noun ('study') or as a verb when combined with 'suru' ('to study').", "image_description": "A young person sitting at a wooden desk, completely absorbed in their work. The desk is covered with open textbooks, notebooks filled with handwritten notes, and a laptop displaying educational material. The person is holding a pen and has a focused, determined expression on their face. A desk lamp illuminates the scene, creating a quiet and studious atmosphere."}
{"en_translation": "pronunciation", "word": "発音", "language_code": "ja", "examples": ["彼の英語の発音はとてもきれいです。", "この単語の発音を教えてください。", "正確な発音を練習するために、毎日音読しています。"], "description": "The way in which a word or a language is spoken. It refers to the act of producing the sounds of speech, including articulation, stress, and intonation, to correctly form words.", "image_description": "A person is speaking into a vintage microphone on a stand. Sound waves are visibly emanating from their mouth, and these waves transform into written phonetic symbols as they travel. The person's mouth is open, and their tongue and lips are shaped in a very deliberate and clear way, emphasizing the act of careful articulation."}
{"en_translation": "word", "word": "言葉", "language_code": "ja", "examples": ["この言葉の意味を教えてください。", "彼は私に優しい言葉をかけてくれた。", "言葉の壁を感じることがある。"], "description": "In Japanese, 言葉 (kotoba) refers to a word or a unit of language that carries a specific meaning. It can be spoken or written and is a fundamental component of communication. Beyond just a single word, it can also encompass language, speech, or expressions in a broader sense.", "image_description": "A single Japanese word, 言葉, is written in elegant, black calligraphy on a simple, textured piece of white washi paper. A traditional calligraphy brush is held by a hand, just finishing the final stroke of the last character. The scene is clean, minimalist, and focused solely on the word itself."}
{"en_translation": "to repeat", "word": "繰り返す", "language_code": "ja", "examples": ["すみません、もう一度繰り返してください。", "彼は同じ間違いを繰り返している。", "歴史は繰り返すという。"], "description": "This word means to do or say something over again, multiple times. It emphasizes the iterative nature of an action, often suggesting that it has happened before and is happening again.", "image_description": "A parrot is sitting on a person's shoulder, perfectly mimicking the person. The person has a speech bubble that says 'こんにちは', and the parrot has an identical speech bubble also saying 'こんにちは'. The scene clearly illustrates the concept of repeating what has been said."}
{"en_translation": "difference", "word": "違い", "language_code": "ja", "examples": ["この二つのりんごには、大きさの違いがあります。(Kono futatsu no ringo ni wa, ookisa no chigai ga arimasu.) - There is a difference in size between these two apples.", "文化の違いを乗り越えて、良い関係を築く。(Bunka no chigai o norikoete, yoi kankei o kizuku.) - To overcome cultural differences and build a good relationship.", "意見の違いは問題ありません。(Iken no chigai wa mondai arimasen.) - A difference of opinion is not a problem."], "description": "The quality or state of being dissimilar or unlike. It refers to a point or way in which people or things are not the same.", "image_description": "Two apples are placed side-by-side. One apple is red, and the other apple is green. The background is neutral and simple, focusing the attention on the clear difference in color between the two identical objects."}
{"en_translation": "pencil case", "word": "筆箱", "language_code": "ja", "examples": ["新しい筆箱を買いました。", "彼女は筆箱からカラフルなペンを取り出した。", "筆箱を家に忘れてしまいました。"], "description": "A case or box for storing writing instruments such as pens, pencils, erasers, and other small stationery items. It helps keep them organized and portable, and is commonly used by students and artists.", "image_description": "A brightly colored pencil case sits on a plain wooden desk. The pencil case is slightly open, revealing an assortment of pens, pencils, and a white eraser neatly arranged inside. The background is simple and out of focus, highlighting the pencil case as the main subject."}
{"en_translation": "stapler", "word": "ホチキス", "language_code": "ja", "examples": ["すみません、ホチキスを貸してください。", "この書類をホチキスで留めてください。", "ホチキスの芯がなくなりました。"], "description": "A mechanical device that joins sheets of paper or similar material by driving a thin metal staple through the sheets and folding the ends. It's a common piece of office and school equipment used for binding documents together.", "image_description": "A close-up of a person's hand holding a bright red stapler. The stapler is positioned over a small stack of white papers on a wooden desk, and a metal staple is halfway through the paper, showing the action of fastening them together. The background is simple and out of focus, keeping the attention on the stapler and the papers."}
{"en_translation": "scissors", "word": "はさみ", "language_code": "ja", "examples": ["このはさみはよく切れますね。", "紙を切るためにはさみが必要です。", "彼ははさみで自分の髪を切った。"], "description": "A handheld tool used for cutting, consisting of two blades joined by a pivot. This allows the user to close the blades on an object, thereby cutting it. It is commonly used for cutting thin materials like paper, cardboard, fabric, rope, and hair.", "image_description": "A pair of simple, silver-colored metal scissors is shown in the center of the frame against a plain, neutral background. The scissors are slightly open, so the two individual blades and the finger holes of the handle are clearly visible. The scene is clean and minimalist, with no other objects present."}
{"en_translation": "glue", "word": "のり", "language_code": "ja", "examples": ["封筒のふたをのりで貼ってください。", "子供たちは工作の時間に紙をのりでくっつけていた。", "このポスターを壁に貼るのに、もっと強いのりが必要だ。"], "description": "An adhesive substance used for sticking objects or materials together, especially paper. It is commonly found in schools and offices and can come in various forms, such as a liquid in a bottle or a solid stick.", "image_description": "A close-up shot of a white glue stick with its cap off, held at an angle as it applies a thin, clear, and glossy layer of adhesive onto a piece of bright blue construction paper. A small, transparent glob of glue is visible at the tip of the stick, showing its sticky texture. The background is plain and out of focus."}
{"en_translation": "class", "word": "授業", "language_code": "ja", "examples": ["今日の午後は、数学の授業があります。", "彼の授業はいつも面白くて、たくさんのことを学びます。", "授業中に質問がありますか？"], "description": "A period of instruction in an academic setting, such as a school or university, where a teacher educates students on a specific subject. This term refers to the lesson or class session itself.", "image_description": "A teacher stands at the front of a classroom, writing on a whiteboard with a marker. A small group of high school students sits at their desks, focused on the teacher and the lesson. Sunlight streams through the windows of the classroom."}
{"en_translation": "classroom", "word": "教室", "language_code": "ja", "examples": ["生徒たちは教室で静かに勉強しています。", "次の授業はどの教室ですか？", "放課後、教室の掃除をしましょう。"], "description": "A room in a school or university where a group of students are taught by a teacher. It is typically equipped with desks, chairs, a blackboard or whiteboard, and other educational materials.", "image_description": "A bright, empty classroom in a Japanese school. Rows of wooden desks and chairs face a large green chalkboard at the front of the room. Sunlight streams through the large windows on the side, illuminating the clean, polished floor. The room is peaceful and ready for class to begin."}
{"en_translation": "school", "word": "学校", "language_code": "ja", "examples": ["毎日、バスで学校に通っています。", "明日は学校の文化祭です。", "この学校はとても大きくて新しいです。"], "description": "A place where children and young people go to learn. It covers various levels, from elementary to university, and is a central place for education and social development.", "image_description": "A multi-story, modern school building with large windows. In the foreground, there's a schoolyard with a running track. A few students in uniform are walking towards the entrance. The Japanese flag is visible on a flagpole near the building."}
{"en_translation": "elementary school", "word": "小学校", "language_code": "ja", "examples": ["私の息子は来年、小学校に入学します。", "小学校の運動会はとても賑やかでした。", "彼とは小学校からの友達です。"], "description": "The first stage of compulsory education in Japan, for children typically between the ages of 6 and 12. It follows kindergarten or nursery school and precedes junior high school.", "image_description": "A two-story Japanese elementary school building with a large clock on its facade. In the foreground, a group of young children wearing bright yellow hats and carrying 'randoseru' backpacks are walking towards the school entrance. The scene is bright and cheerful, evoking a sense of learning and childhood."}
{"en_translation": "junior high school", "word": "中学校", "language_code": "ja", "examples": ["弟は来年、中学校に入学します。 (My younger brother will enter junior high school next year.)", "中学校の時の友達は、今でも親友です。 (The friends I made in junior high school are still my best friends.)", "明日、中学校で体育祭があります。 (There's a sports festival at the junior high school tomorrow.)"], "description": "A lower secondary school in the Japanese education system, typically for students aged 12 to 15, covering grades seven through nine. It is the stage of education between elementary school (小学校) and high school (高等学校).", "image_description": "A modern, multi-story Japanese school building with a sign that reads '中学校' at the entrance. In the foreground, a group of students around 14 years old are walking towards the building for the start of the school day. The students are wearing distinct Japanese school uniforms, the boys in black stand-collar jackets and the girls in sailor-style outfits."}
{"en_translation": "high school", "word": "高校", "language_code": "ja", "examples": ["この春から高校に入学します。", "彼は高校時代、野球部のエースでした。", "私の兄は高校の教師です。"], "description": "In Japan, high school is a three-year educational institution that students typically enter after completing middle school, usually from the ages of 15 to 18. It is the final stage of secondary education before university or entering the workforce.", "image_description": "A group of Japanese teenagers in their school uniforms, both boys in black jackets and girls in sailor-style outfits, are walking out of a school gate. The school building behind them is a modern, multi-story structure. The students are chatting and smiling, carrying backpacks and books."}
{"en_translation": "university", "word": "大学", "language_code": "ja", "examples": ["私の兄は東京の大学で勉強しています。", "来年、大学に行きます。", "彼女は大学を卒業して、先生になりました。"], "description": "An institution of higher education where students study for degrees and where academic research is conducted. It is the next step in education after high school, where one can obtain a bachelor's, master's, or doctoral degree.", "image_description": "A large, classic-style university building with a clock tower stands prominently on a green campus lawn. In front of the building, a few diverse students are walking with backpacks and books, heading towards the entrance on a clear, sunny day. The scene captures the essence of higher education and student life."}
{"en_translation": "first-year student", "word": "一年生", "language_code": "ja", "examples": ["私の弟は今年から小学一年生です。", "彼女は大学一年生で、新しい生活にわくわくしています。", "高校一年生の時、初めての文化祭で劇をしました。"], "description": "In Japanese, \"一年生\" (ichinensei) refers to a student in their first year of any level of schooling, including elementary school, middle school, high school, or university. It combines \"一\" (ichi) meaning \"one\", \"年\" (nen) meaning \"year\", and \"生\" (sei) meaning \"student\" or \"life\".", "image_description": "A young, excited Japanese student stands at the entrance of a school. The student is wearing a brand new, slightly oversized uniform and a bright yellow safety cap. On their back is a large, classic red leather backpack known as a 'randoseru', symbolizing their first day of elementary school."}
{"en_translation": "second-year student", "word": "二年生", "language_code": "ja", "examples": ["私の姉は大学二年生です。", "二年生の時、私たちは同じクラスでした。", "来年、彼は二年生になります。"], "description": "A student in their second year of study, such as in high school or university. This term is used to identify a student's grade level.", "image_description": "A Japanese student in a school uniform is standing in a classroom. They are proudly holding up two fingers, symbolizing their second year. A school building is visible through the window in the background."}
{"en_translation": "third-year student", "word": "三年生", "language_code": "ja", "examples": ["彼女は高校の三年生です。", "三年生はもうすぐ卒業ですね。", "大学の三年生になると、就職活動を始める学生が多いです。"], "description": "A term for a student in their third year of a multi-year academic program, such as high school (高校三年生) or university (大学三年生). It is composed of the kanji 三 (three), 年 (year), and 生 (student).", "image_description": "A Japanese student in a school uniform is sitting at a desk in a classroom, looking thoughtfully at a university brochure. This suggests they are in their final years of school and preparing for the future, representing a third-year student."}
{"en_translation": "preparation", "word": "予習", "language_code": "ja", "examples": ["明日の授業の予習をする。", "予習してきたおかげで、先生の質問に答えられた。", "教科書の次の章を予習しておいてください。"], "description": "The act of studying new material before it is taught in a class or lesson. This is done to better understand the upcoming topic and be prepared for the lesson.", "image_description": "A student sits at a desk in their room with an open textbook. On the wall, a calendar clearly shows 'History Class' circled for the next day. The student is looking at the open book, which corresponds to the topic for the upcoming class, clearly studying the material before the lesson."}
{"en_translation": "blackboard", "word": "黒板", "language_code": "ja", "examples": ["先生が黒板に漢字を書いています。", "今日の宿題は黒板を見てください。", "彼は黒板の字をノートに書き写した。"], "description": "A large, dark-colored board, typically found in classrooms, that is written on with sticks of chalk. It can be wiped clean to be used again.", "image_description": "A large, traditional green blackboard is mounted on a classroom wall. On the board, there is some white chalk writing showing a simple Japanese sentence. A wooden ledge at the bottom of the blackboard holds a chalk eraser and a few sticks of white chalk."}
{"en_translation": "whiteboard", "word": "ホワイトボード", "language_code": "ja", "examples": ["先生はホワイトボードに図を書いて説明した。", "会議の内容をホワイトボードにまとめましょう。", "そのホワイトボードはマグネットがくっつきますか。"], "description": "A large, glossy white surface, typically mounted on a wall or stand. It is used for non-permanent writing with special dry-erase markers, making it a common tool in classrooms, offices, and meeting rooms for presentations, teaching, and brainstorming.", "image_description": "A large, plain white rectangular board is the central focus, mounted on a classroom wall. A hand is shown in the middle of writing a mathematical equation (e.g., \"x + y = z\") on the board with a black marker. A few colorful markers and an eraser are neatly placed on the narrow tray attached to the bottom of the board."}
{"en_translation": "reservation", "word": "予約", "language_code": "ja", "examples": ["レストランの予約をしたいのですが。", "ホテルの予約はもう済みましたか。", "明日の午後7時にテーブルを2名で予約しました。"], "description": "The act of booking or reserving something in advance, such as a hotel room, a table at a restaurant, or a ticket for a performance. It refers to the arrangement made to secure a service or spot for a future time.", "image_description": "A person is at a hotel reception desk, pointing to their name in a large, open reservation book. The receptionist is smiling and nodding, confirming the booking. The scene is clean and simple, focusing on the book and the act of confirming the pre-arranged stay."}
{"en_translation": "check-in", "word": "チェックイン", "language_code": "ja", "examples": ["ホテルに到着したら、まずフロントでチェックインを済ませてください。", "午後3時からチェックインが可能です。", "すみません、チェックインをお願いします。"], "description": "The process of registering your arrival, typically at a hotel or an airport. At a hotel, this is when you formally announce your arrival, provide your details, and receive the key to your room.", "image_description": "A traveler with a suitcase is standing at a hotel reception desk. The hotel receptionist is smiling and handing a room key card to the traveler. In the background, there's a wall with key slots and a sign that says 'Reception'."}
{"en_translation": "check-out", "word": "チェックアウト", "language_code": "ja", "examples": ["明日の朝、9時にチェックアウトします。", "ホテルのチェックアウトは何時ですか？", "チェックアウトの前に、部屋の鍵をフロントに返してください。"], "description": "The act of formally leaving a hotel or other accommodation after settling your bill. This process usually involves returning the room key and paying for any additional charges.", "image_description": "A person at a hotel reception desk is handing their room key to the hotel staff. The staff member is smiling and looking at a computer screen displaying a bill. A packed suitcase stands on the floor next to the person, who is ready to depart."}
{"en_translation": "front desk", "word": "フロント", "language_code": "ja", "examples": ["チェックインはフロントでお願いします。", "フロントに電話して、タオルを追加でお願いしました。", "ホテルのフロントは24時間対応です。"], "description": "The counter or desk in a hotel, office, or other organization where visitors check in and can get information. It serves as the main point of contact for guests and clients upon arrival.", "image_description": "A wide, clean counter in a modern hotel lobby. A hotel employee in a sharp uniform is standing behind the counter, smiling at a guest who is checking in. Behind the employee, there is a wall with key slots and a small, elegant bell on the counter."}
{"en_translation": "room", "word": "部屋", "language_code": "ja", "examples": ["私の部屋は二階にあります。", "ホテルの部屋はとても広かったです。", "部屋に電話はありますか？"], "description": "A general term for a room in a building, such as a house, apartment, or hotel. It is a space enclosed by walls, a floor, and a ceiling, used for a specific purpose like sleeping or studying. When staying at an accommodation, this refers to the private room assigned to a guest.", "image_description": "A cozy and tidy hotel guest room. There is a neatly made double bed against one wall with a window next to it, showing a daytime city view. On the other side of the room, there is a simple wooden desk and a chair. The room is well-lit and has a calm, welcoming atmosphere."}
{"en_translation": "Japanese-style room", "word": "和室", "language_code": "ja", "examples": ["私の家には和室があります。", "おばあちゃんは和室で茶を飲んでいます。", "この旅館の和室は広くてきれいです。"], "description": "A traditional Japanese room featuring tatami mat flooring, sliding paper doors (shoji or fusuma), and often a decorative alcove (tokonoma). It is a space designed for activities like tea ceremonies, or for use as a living or sleeping area.", "image_description": "A serene and traditional Japanese-style room. The floor is entirely covered with woven tatami mats. In the center of the room, there is a low wooden table with a couple of floor cushions (zabuton) around it. One wall consists of shoji, which are sliding doors made of a wooden lattice and translucent paper, with a view of a garden visible through the paper."}
{"en_translation": "Western-style room", "word": "洋室", "language_code": "ja", "examples": ["このホテルには洋室と和室の両方があります。", "私のアパートの寝室は洋室です。", "彼は和室を洋室にリフォームしました。"], "description": "A '洋室' is a room in a Japanese house or hotel that is furnished in a Western style, as opposed to a traditional Japanese-style room ('和室'). It typically features wooden or carpeted floors instead of tatami mats, and contains furniture like beds, chairs, and desks rather than futons and low tables.", "image_description": "A simple and modern bedroom with light-colored hardwood floors. The room contains a bed with a frame, a headboard, and a mattress. Next to the bed, there is a wooden desk with a chair. Sunlight is streaming in from a glass window with curtains. The walls are plain and painted a neutral color."}
{"en_translation": "single room", "word": "シングルルーム", "language_code": "ja", "examples": ["ホテルでシングルルームを予約しました。", "出張なので、シングルルームで十分です。", "このシングルルームは少し狭いですが、きれいです。"], "description": "A hotel room with a bed intended for one person. It is the most basic and typically the cheapest type of room available for solo travelers.", "image_description": "A small, neat hotel room containing just one single-sized bed against a wall. Next to the bed, there is a small nightstand with a lamp. The room is compact, clean, and clearly designed for a single occupant, with no extra furniture except for a small desk and a chair in the corner."}
{"en_translation": "twin room", "word": "ツインルーム", "language_code": "ja", "examples": ["友達と旅行に行くので、ツインルームを予約しました。", "このホテルのツインルームは、広くて快適だった。", "シングルルームではなく、ツインルームに泊まりたいです。"], "description": "A hotel room or other accommodation with two separate single beds. It's a common choice for friends, family members, or colleagues who are traveling together and prefer to sleep in their own beds.", "image_description": "A hotel room with two identical single beds. The beds are neatly made and are separated by a small nightstand in the middle. The room is clean and well-lit, with a window showing a pleasant view."}
{"en_translation": "double room", "word": "ダブルルーム", "language_code": "ja", "examples": ["このホテルのダブルルームはとても広々としています。", "ダブルルームを一つ予約したいのですが。", "ご宿泊はダブルルームでよろしかったでしょうか。"], "description": "A hotel room that has a single double bed, intended for two people. This is different from a ツインルーム (twin room), which has two separate single beds.", "image_description": "A clean and simple hotel room with the main focus on a neatly made double bed in the center. The bed has one large mattress and is suitable for two people. There is a nightstand with a lamp on one side of the bed and a window with curtains on the wall behind it."}
{"en_translation": "key", "word": "鍵", "language_code": "ja", "examples": ["家の鍵をどこに置いたか忘れました。", "このドアを開けるには特別な鍵が必要です。", "旅行の前に、必ずドアに鍵をかけてください。"], "description": "A metal instrument used for operating a lock, for example, to lock or unlock a door and get into a room.", "image_description": "A close-up of a single, standard house key made of silver metal. The key is lying on a plain, light-colored wooden surface. The focus is sharp on the key's teeth and bow, with a soft, out-of-focus background. The image is simple and clear, with no other objects to distract from the key itself."}
{"en_translation": "breakfast", "word": "朝食", "language_code": "ja", "examples": ["日本の家庭では、朝食にご飯と味噌汁を食べることが多いです。", "今朝は忙しくて、朝食を抜きにした。", "旅行先のホテルで豪華な朝食ビュッフェを楽しんだ。"], "description": "The first meal of the day, eaten in the morning. It can refer to a wide range of foods, from a simple piece of toast to a full traditional meal.", "image_description": "A traditional Japanese breakfast set is neatly arranged on a wooden tray. The set includes a bowl of steaming white rice, a bowl of miso soup with tofu and green onions, a piece of grilled salmon, and a side of tamagoyaki (rolled omelet). The scene is bright and appetizing, suggesting a fresh and healthy start to the day."}
{"en_translation": "dinner", "word": "夕食", "language_code": "ja", "examples": ["家族と夕食を食べるのが日課です。", "今夜の夕食は外で食べましょうか。", "彼女は夕食の準備をしています。"], "description": "夕食 (yūshoku) refers to the evening meal, or dinner. It is the last of the three main meals of the day, following breakfast (朝食) and lunch (昼食). This meal is often eaten at home with family and is a significant part of daily life in Japan.", "image_description": "A Japanese family is sitting around a wooden dining table, happily sharing a meal. The table is filled with various dishes like grilled fish, miso soup, and rice. The warm light from a hanging lamp illuminates the scene, creating a cozy and inviting atmosphere. Outside the window, the sky is dark, indicating it is evening."}
{"en_translation": "luggage", "word": "荷物", "language_code": "ja", "examples": ["空港で荷物を預けます。", "この荷物はどこに置けばいいですか？", "旅行の準備をしたら、荷物が多くなってしまった。"], "description": "Refers to bags, suitcases, and other belongings that one carries when traveling. It can be a single bag or multiple items, encompassing all the things a person has packed for a trip.", "image_description": "A traveler stands on a train platform with their luggage. They have a large, hard-shell suitcase and a backpack at their feet. The luggage is clearly packed for a trip, and the person is looking down the tracks, waiting for a train. The main focus of the image is the luggage."}
{"en_translation": "lodging", "word": "宿泊", "language_code": "ja", "examples": ["旅行中の宿泊はホテルを予約しました。", "この旅館は宿泊料金が安いです。", "友人Aの家に一晩宿泊させてもらった。"], "description": "The act of staying somewhere for a night or more, typically at a hotel, inn, or other type of accommodation. It refers to the service of providing a place to sleep for travelers or guests.", "image_description": "A serene tatami room in a traditional Japanese inn. A person is sitting on a cushion, drinking tea. In the background, a futon is laid out, ready for a night's sleep, with a window showing a peaceful night sky."}
{"en_translation": "extension", "word": "延長", "language_code": "ja", "examples": ["ホテルのチェックアウト時間を延長したいです。", "会議は30分延長されました。", "ビザの延長を申請する必要があります。"], "description": "The act of making something longer, particularly in duration or length. This often refers to prolonging a set period, such as a deadline, a rental period, a meeting, or the validity of a contract or visa.", "image_description": "A person at a hotel reception desk is speaking to the staff. Behind the desk, a large clock shows the time 11:00, which is crossed out. An arrow points from the crossed-out 11:00 to a new time, 1:00 PM, which is circled. This visually represents the checkout time being extended."}
{"en_translation": "change", "word": "変更", "language_code": "ja", "examples": ["会議の時間の変更を知らせます。", "旅行の計画に少し変更を加えました。", "急な変更で申し訳ありません。"], "description": "A noun referring to an alteration or modification made to something that was previously decided or set. It is often used for changes to plans, schedules, arrangements, or rules.", "image_description": "A person is pointing to a wall calendar. On today's date, a meeting time originally written as '2:00 PM' is crossed out with a red pen. Next to it, '3:00 PM' is written in bold, indicating a change of schedule. The person has a neutral expression, simply acknowledging the modification."}
{"en_translation": "number of people", "word": "人数", "language_code": "ja", "examples": ["レストランの予約をしたいです。人数は3人です。", "このツアーの参加人数を教えてください。", "クラスの人数は20人です。"], "description": "Refers to the number of people in a group, often used when making reservations, planning events, or taking attendance. It's a way of counting or specifying a group's size, like a head count.", "image_description": "A restaurant host stands at a podium looking at a reservation book. The book is open and the column for '人数' (number of people) is visible. The host is holding up four fingers to a small group of four people who are waiting to be seated. The focus is on the act of confirming the number of people in the party."}
{"en_translation": "order", "word": "注文", "language_code": "ja", "examples": ["すみません、注文をお願いします。", "ご注文はお決まりですか？", "昨日、ネットで本を注文した。"], "description": "The act of placing an order for a product or service, such as food at a restaurant or goods online. It can refer to the request itself or the specific items that have been requested.", "image_description": "A person stands at a cafe counter, pointing to an item on the menu they are holding. Across the counter, a smiling barista is poised with a notepad and pen, ready to take the order. A cash register and a few pastries are visible on the counter, but the focus is on the interaction of ordering."}
{"en_translation": "menu", "word": "メニュー", "language_code": "ja", "examples": ["すみません、メニューを見せてください。", "この店のメニューは、おいしそうな料理ばかりだ。", "ドリンクメニューは別のページにあります。"], "description": "レストランやカフェで注文できる食べ物や飲み物の一覧表。日本のレストランでは、写真付きのメニューも一般的です。", "image_description": "レストランのテーブルの上に、日本語で「メニュー」と書かれた冊子が開かれている。ページには、ラーメンや寿司などの料理の写真と名前、価格がリストされている。背景はシンプルで、メニューそのものに焦点が当たっている。"}
{"en_translation": "dish", "word": "料理", "language_code": "ja", "examples": ["このレストランの料理はとても美味しいです。", "趣味は料理をすることです。", "イタリア料理を習いたいです。"], "description": "Refers to a prepared food item, a dish, or cuisine from a specific region. It can also refer to the act of cooking or food preparation in general, encompassing the entire process of making a meal.", "image_description": "A close-up of a beautifully presented, delicious-looking main course on a ceramic plate. The dish is colorful and garnished, sitting on a clean kitchen counter. In the slightly blurred background, a person's hands are seen sprinkling herbs over another dish, hinting at the process of cooking."}
{"en_translation": "set meal", "word": "定食", "language_code": "ja", "examples": ["今日のランチは、唐揚げ定食にしました。", "このレストランの焼き魚定食はとても美味しいです。", "多くの定食屋では、ご飯のおかわりが無料です。"], "description": "A Japanese set meal, where a main dish (like fish or meat) is served with a bowl of rice, miso soup, and one or more side dishes (like pickles or vegetables). All the items are typically presented together on a single tray. It's a common, convenient, and well-balanced meal option, especially for lunch.", "image_description": "A Japanese set meal arranged neatly on a rectangular tray. The tray holds a main dish of grilled fish, a bowl of steaming white rice, a bowl of miso soup, and a small dish of pickled vegetables. The scene is simple and focuses on the complete, balanced meal."}
{"en_translation": "appetizer", "word": "前菜", "language_code": "ja", "examples": ["まずは前菜を注文しましょう。", "このレストランの前菜はとても人気があります。", "今日の前菜は新鮮な魚のカルパッチョです。"], "description": "In Japanese cuisine, 前菜 (zensai) refers to a small, introductory dish served at the beginning of a meal before the main courses. It's designed to whet the appetite and often consists of a beautifully arranged selection of seasonal ingredients.", "image_description": "A close-up of a small, elegant Japanese appetizer platter. On a rectangular ceramic dish, there are three small, artfully arranged items: a single grilled shrimp, a small mound of marinated seaweed, and a slice of rolled omelet. The dish is placed on a dark wooden table, ready to be eaten before a main course."}
{"en_translation": "main dish", "word": "主菜", "language_code": "ja", "examples": ["今日のランチは、主菜が焼き魚で、ごはんと味噌汁が付きます。", "今夜の主菜はステーキです。", "主菜は何にしますか？"], "description": "The main dish or primary course of a meal, typically featuring the most substantial part of the meal, such as meat or fish. It is the central part of the meal that side dishes accompany.", "image_description": "A beautiful, steaming piece of grilled salmon is placed in the center of the table setting on an elegant plate. To the side, there are smaller, less prominent bowls containing rice, miso soup, and pickled vegetables. The lighting is focused on the salmon, making it the undeniable star of the meal."}
{"en_translation": "dessert", "word": "デザート", "language_code": "ja", "examples": ["夕食の後に、何か甘いデザートが食べたいな。", "デザートは何にしますか？", "このレストランのチョコレートケーキは、最高のデザートです。"], "description": "A sweet course or dish, such as cake, ice cream, or fruit, that is served at the end of a meal.", "image_description": "A close-up shot of a single, elegant slice of strawberry shortcake on a white plate. The cake has layers of fluffy sponge, whipped cream, and fresh strawberries. A perfect, glossy red strawberry sits on top next to a swirl of cream, making it look delicious and inviting."}
{"en_translation": "beverage", "word": "飲み物", "language_code": "ja", "examples": ["何か飲み物はいかがですか？", "レストランで飲み物を注文した。", "自動販売機で冷たい飲み物を買った。"], "description": "A general term for any kind of drink or beverage, such as water, juice, tea, or soda. It is used to refer to something that is drunk.", "image_description": "A collection of various drinks is displayed on a simple, plain surface. In the center is a glass of orange juice, to the left is a can of soda, and to the right is a steaming mug of coffee. Behind them, a bottle of water is also visible, showing a wide range of common beverages."}
{"en_translation": "bill", "word": "お会計", "language_code": "ja", "examples": ["すみません、お会計お願いします。", "お会計は別々でできますか？", "お会計はあちらのレジでお願いします。"], "description": "The bill or check, typically at a restaurant or store. It's the total amount of money that you have to pay for the goods or services you have received. This term is used when you are ready to complete your payment.", "image_description": "A close-up of a restaurant bill presented in a small, simple black folder or tray. The bill has Japanese characters and numbers on it. A credit card is placed next to the folder, ready for payment."}
{"en_translation": "this", "word": "これ", "language_code": "ja", "examples": ["これは何ですか？ (Kore wa nan desu ka?)", "これを一つください。 (Kore o hitotsu kudasai.)", "これはとても美味しいです。 (Kore wa totemo oishii desu.)"], "description": "The word 'これ' (kore) is a demonstrative pronoun in Japanese, equivalent to 'this' in English. It is used to refer to an object or item that is physically close to the speaker, often something the speaker is holding or can easily touch. It contrasts with 'それ' (sore), used for items near the listener, and 'あれ' (are), for items distant from both speaker and listener.", "image_description": "A person is holding a Japanese teacup with both hands, presenting it forward slightly. The focus is sharp on the teacup, showing its texture and design clearly. The person's hands are visible, but their face and the background are out of focus, emphasizing that the object is in the speaker's immediate possession."}
{"en_translation": "that", "word": "それ", "language_code": "ja", "examples": ["それは何ですか？", "それ、取ってください。", "A: このペン、書きやすいね。 B: 本当？ それ、どこで買ったの？"], "description": "A demonstrative pronoun used to refer to something that is physically closer to the listener than to the speaker. It corresponds to 'that' for items within the listener's space or immediate vicinity. This contrasts with 'これ' (kore), for items near the speaker, and 'あれ' (are), for items distant from both the speaker and the listener.", "image_description": "A person is sitting at a table holding a blue book. Across the table, another person is pointing towards the book. The scene is viewed from a neutral perspective, clearly showing one person indicating an object that is close to the other person."}
{"en_translation": "that over there", "word": "あれ", "language_code": "ja", "examples": ["あれは何ですか？", "あれを見てください。きれいな鳥がいますね。", "すみません、あれはいくらですか？"], "description": "A demonstrative pronoun used to refer to an object that is physically distant from both the speaker and the listener. It is used when pointing out or talking about something far away from both parties in the conversation.", "image_description": "Two people are standing together on a hill, looking into the distance. One person is pointing towards a distinct mountain on the far horizon. The mountain is clearly very far away from both of them, emphasizing the distance."}
{"en_translation": "spicy", "word": "辛い", "language_code": "ja", "examples": ["このカレーはとても辛いです。", "辛い食べ物は好きですか？", "ラーメンに唐辛子を入れすぎて、辛くなった。"], "description": "Refers to a taste sensation characterized by a sharp, pungent heat. This is the feeling you get from eating foods with chili peppers or other similar spices. It's a burning or stinging sensation in the mouth.", "image_description": "A person is shown with their mouth wide open and fanning their tongue with their hand, trying to cool it down. Their face is red and they have beads of sweat on their forehead. On the table in front of them is a bowl of noodles with several bright red chili peppers visible."}
{"en_translation": "sweet", "word": "甘い", "language_code": "ja", "examples": ["このケーキはとても甘いですね。", "私は甘いものが大好きです。", "このコーヒーは甘いですか？"], "description": "Refers to the taste of sugar, honey, or other things with a sugary flavor. It is the most common word to describe sweetness in food and drinks, like desserts, ripe fruits, or sweetened beverages.", "image_description": "A close-up shot of a wooden honey dipper being lifted from a jar of golden honey. A thick, clear drip of honey is stretching down from the dipper, about to fall. The scene is warm and luscious, emphasizing the rich, sugary texture of the honey."}
{"en_translation": "salty", "word": "塩辛い", "language_code": "ja", "examples": ["このスープは少し塩辛いですね。", "海の水は塩辛くて飲めません。", "彼は塩辛い食べ物が大好きです。"], "description": "Describes a taste that has a high concentration of salt. It is one of the five basic tastes. This word is used to describe food or drink that has the flavor of salt, sometimes to an excessive degree.", "image_description": "A person grimacing with a puckered mouth after eating a potato chip. An open bag of potato chips sits in front of them, with a salt shaker tipped over next to it, spilling salt onto the table. The scene clearly shows a reaction to an overwhelmingly salty taste."}
{"en_translation": "sour", "word": "酸っぱい", "language_code": "ja", "examples": ["このレモンはとても酸っぱいです。", "腐った牛乳は酸っぱい味がする。", "私は酸っぱい食べ物より甘い食べ物の方が好きです。"], "description": "Describes a sharp, tangy, or acidic flavor, often associated with unripe fruit, vinegar, or citrus fruits like lemons. It's one of the five basic tastes.", "image_description": "A person puckering their lips and squinting their eyes with a sour expression on their face as they bite into a juicy, vibrant yellow lemon. A slice of the lemon is in their hand, and another half of a lemon sits on a wooden table next to them. The background is simple and out of focus to emphasize the person's reaction and the lemon."}
{"en_translation": "bitter", "word": "苦い", "language_code": "ja", "examples": ["このコーヒーはとても苦い。", "薬が苦くて飲みにくい。", "ゴーヤは苦いけど、体にいいですよ。"], "description": "Describes one of the five basic tastes, characterized by a sharp, pungent, and often unpleasant flavor. It is the characteristic taste of black coffee without sugar, some medicines, or vegetables likeゴーヤ (bitter melon).", "image_description": "A person is tasting a spoonful of dark, thick herbal medicine from a bowl. Their face is scrunched up in a grimace, with squinted eyes and a puckered mouth, clearly showing a reaction to an intensely bitter taste. The focus is entirely on the person's expressive reaction to the unpleasant flavor."}
{"en_translation": "delicious", "word": "おいしい", "language_code": "ja", "examples": ["このラーメンは本当においしいですね。", "彼女が作ったケーキは、見た目も味もおいしかった。", "おいしいレストランを知っていますか？"], "description": "A common and versatile adjective used to describe food or drink that has a very pleasant taste. It's a general term of approval for anything edible that you find enjoyable, from a simple snack to a gourmet meal.", "image_description": "A person's face showing a blissful, happy expression as they eat a steaming bowl of ramen. Their eyes are slightly closed in enjoyment, and a contented smile is on their face, conveying a feeling of pure delight from the delicious taste. The focus is entirely on the person's reaction to the food."}
{"en_translation": "bad-tasting", "word": "まずい", "language_code": "ja", "examples": ["このスープは薬みたいな味がして、まずい。", "ごめん、料理は苦手で…まずいかもしれないけど、食べてみて。", "うわっ！このコーヒー、砂糖と塩を間違えたでしょう？まずい！"], "description": "An adjective to describe food or drink that has an unpleasant flavor. It is the direct opposite of 'oishii' (delicious) and is used when something tastes bad to the speaker.", "image_description": "A person is at a kitchen table, spitting a mouthful of dark green, lumpy soup back into a bowl. Their face is contorted in disgust, with wide eyes, a wrinkled nose, and their tongue sticking out. A single tear is rolling down their cheek from the shock of the terrible taste."}
{"en_translation": "cold", "word": "冷たい", "language_code": "ja", "examples": ["暑い日には冷たいビールが一番だ。", "このスイカはよく冷えていて、とても美味しい。", "朝は冷たい水で顔を洗うと、目が覚める。"], "description": "An adjective describing something with a low temperature that is perceived through the sense of touch. It's commonly used for food, drinks, and other objects. For example, you would use it to talk about a cold glass of water or an iced coffee. It is different from \"寒い\" (samui), which is used to describe feeling cold in terms of atmospheric temperature or climate.", "image_description": "A tall glass of iced tea, filled with ice cubes and a slice of lemon, with droplets of condensation running down the side. Next to the glass is a bowl of chilled soba noodles on a bamboo mat, with green onions sprinkled on top. The scene is bright and suggests a hot day."}
{"en_translation": "warm", "word": "温かい", "language_code": "ja", "examples": ["この温かいスープを飲むと、体がぽかぽかしてくる。", "寒い日には温かいお風呂に入るのが一番だ。"], "description": "Refers to a pleasant, comfortable warmth, often used for things you can touch, such as food, drinks, a bath, or clothing. It conveys a sense of coziness and physical comfort from the heat.", "image_description": "A pair of hands cupping a ceramic mug filled with a steaming hot beverage, like tea or coffee. The steam is gently rising from the mug. The scene should evoke a feeling of comfort, coziness, and the pleasant sensation of warmth being transferred to the hands on a cool day."}
{"en_translation": "hot", "word": "熱い", "language_code": "ja", "examples": ["このスープは熱いから、気をつけてください。", "熱いお風呂に入るのが好きです。", "真夏のアスファルトはとても熱い。"], "description": "This adjective is used to describe something that has a high temperature and is hot to the touch. It's used for objects like a cup of coffee, a hot bath, or a freshly cooked meal. It is not to be confused with 暑い (atsui), which is used to describe hot weather or ambient temperature.", "image_description": "A person's hand is shown cautiously reaching for a ceramic mug of coffee that has steam visibly rising from it. The person's fingers are just about to touch the mug, and their expression shows they are anticipating the heat. The background is a simple, neutral-colored kitchen counter to keep the focus on the hot mug."}
{"en_translation": "Japanese cuisine", "word": "和食", "language_code": "ja", "examples": ["一番好きな和食は何ですか？ (Ichiban sukina washoku wa nan desu ka?) - What is your favorite Japanese food?", "健康のために、毎日和食を食べるようにしています。 (Kenkou no tame ni, mainichi washoku o taberu you ni shiteimasu.) - For my health, I try to eat Japanese food every day.", "このレストランは、本格的な和食が楽しめます。 (Kono resutoran wa, honkaku-tekina washoku ga tanoshimemasu.) - You can enjoy authentic Japanese cuisine at this restaurant."], "description": "\"和食\" (washoku) refers to traditional Japanese cuisine, which is known for its emphasis on fresh, seasonal ingredients and beautiful presentation. It typically includes a main staple of rice, accompanied by miso soup and various side dishes (okazu) that balance the five flavors: sweet, sour, salty, bitter, and umami. Washoku is not just about the food itself, but also encompasses the culture, customs, and hospitality associated with its preparation and consumption.", "image_description": "A beautifully arranged traditional Japanese meal set. In the center is a bowl of white rice, next to a bowl of miso soup. Surrounding these are three small side dishes: one with grilled salmon, another with simmered vegetables, and a third with pickled daikon radish. The entire meal is served on a black lacquered tray with a pair of chopsticks."}
{"en_translation": "Western cuisine", "word": "洋食", "language_code": "ja", "examples": ["今日の夕食は洋食にしよう。 (Kyō no yūshoku wa yōshoku ni shiyō.) - Let's have Western food for dinner tonight.", "このレストランは、美味しい洋食が食べられることで知られています。 (Kono resutoran wa, oishii yōshoku ga taberareru koto de shirarete imasu.) - This restaurant is known for its delicious Western cuisine.", "子供のころ、デパートのレストランで洋食を食べるのが楽しみでした。 (Kodomo no koro, depāto no resutoran de yōshoku o taberu no ga tanoshimi deshita.) - When I was a child, I looked forward to eating Western food at department store restaurants."], "description": "In Japan, this refers to dishes that originated in Western countries but have been adapted to suit Japanese tastes. It's a broad category that includes popular items like hamburger steak (hanbāgu), spaghetti Napolitan, and omurice (omelet with rice). These dishes are commonly found in family restaurants and specialized yōshoku restaurants across Japan.", "image_description": "A wooden dining table is set with several classic Japanese-style Western dishes. In the center is a sizzling hamburger steak on a cast-iron plate, covered in a rich demi-glace sauce. Next to it is a vibrant plate of spaghetti Napolitan with its signature red ketchup-based sauce, green peppers, and onions. A fluffy, golden-yellow omurice sits beside them, with a swirl of ketchup on top."}
{"en_translation": "Chinese cuisine", "word": "中華料理", "language_code": "ja", "examples": ["今夜は中華料理を食べに行きましょう。", "私の一番好きな中華料理は麻婆豆腐です。", "あそこのレストランは本格的な中華料理で有名です。"], "description": "Refers to food originating from China, often with styles adapted for Japanese palates. It covers a wide range of dishes, from casual noodle and rice dishes to more elaborate multi-course meals. This term is the general name for Chinese-style food in Japan.", "image_description": "A top-down view of a round dining table laden with a variety of vibrant Chinese dishes. In the center is a steaming bowl of mapo tofu, surrounded by plates of glossy sweet and sour pork, perfectly pleated gyoza dumplings, and a mound of golden fried rice. The dishes are colorful and presented in traditional serving ware."}
{"en_translation": "Italian cuisine", "word": "イタリアン", "language_code": "ja", "examples": ["今日のランチはイタリアンにしようか。", "最近、近所に新しいイタリアンのレストランができた。", "彼女はイタリアンが大好きで、特にパスタには目がない。"], "description": "In Japanese, this word refers to the national cuisine of Italy. It is a common and casual way to talk about Italian restaurants or dishes like pasta, pizza, and risotto. It can be used to suggest going out for Italian food or to describe a preference for it.", "image_description": "A classic Italian meal is spread out on a rustic wooden table. The main dish is a beautifully arranged plate of spaghetti with a rich, red tomato sauce and a basil leaf on top. Next to it sits a single, perfect slice of Neapolitan-style pizza with fresh mozzarella and basil."}
{"en_translation": "French cuisine", "word": "フレンチ", "language_code": "ja", "examples": ["特別な日には、フレンチのレストランを予約しよう。", "彼女は家で本格的なフレンチのフルコースを作った。", "最近、会社の近くに新しいフレンチのビストロがオープンした。"], "description": "「フレンチ」はフランス料理を指す言葉です。日本で「フレンチ」と言うと、通常はフランスの言語や国籍ではなく、その洗練された美食や料理スタイルを指します。高級なレストランからカジュアルなビストロまで、様々な形で楽しまれています。", "image_description": "エレガントな白い皿の上に、精巧に盛り付けられたフレンチのメインディッシュ。焼き加減が完璧な鴨肉のローストに、鮮やかなソースが添えられている。横にはワイングラスとパンが置かれ、高級感のある食卓を演出している。"}
{"en_translation": "curry", "word": "カレー", "language_code": "ja", "examples": ["今日の晩ご飯はカレーにしよう。", "母の作るカレーは世界一美味しいです。", "このレストランのカツカレーがおすすめです。"], "description": "Refers to the Japanese style of curry, a popular stew-like dish. It's typically thick, savory, and mildly sweet, served over rice (カレーライス), and often contains chunks of meat and vegetables like potatoes, carrots, and onions.", "image_description": "A close-up shot of a plate of Japanese curry rice. A mound of white rice takes up half the plate, while the other half is covered in a thick, glossy, dark brown curry sauce. Visible within the sauce are chunks of potato, carrot, and beef. A wisp of steam rises from the hot dish, which sits on a plain wooden table."}
{"en_translation": "ramen", "word": "ラーメン", "language_code": "ja", "examples": ["寒い日には温かいラーメンが食べたくなる。", "この店のラーメンは、スープがとても美味しいです。", "友達と一緒に新しいラーメン屋に行きました。"], "description": "A popular Japanese noodle soup dish, consisting of Chinese-style wheat noodles served in a broth. The broth is typically flavored with soy sauce or miso, and common toppings include sliced pork (chāshū), nori (dried seaweed), menma (bamboo shoots), and scallions.", "image_description": "A large, steaming bowl of ramen is shown. The rich broth is filled with wavy noodles, and topped with slices of pork, a soft-boiled egg cut in half with a runny yolk, chopped green onions, and a sheet of nori seaweed. The bowl sits on a simple wooden table."}
{"en_translation": "sushi", "word": "お寿司", "language_code": "ja", "examples": ["週末に家族でお寿司を食べに行きました。", "日本で初めて本格的なお寿司を体験しました。", "彼女は自分で寿司を握ることができます。"], "description": "A Japanese dish consisting of small balls or rolls of vinegared rice served with a garnish of raw fish, vegetables, or egg.", "image_description": "A variety of sushi pieces arranged on a rectangular wooden board. The sushi includes several types of nigiri with toppings like tuna, salmon, and shrimp, as well as a few maki rolls. A small bowl of soy sauce and a pair of chopsticks are placed next to the board."}
{"en_translation": "tempura", "word": "天ぷら", "language_code": "ja", "examples": ["このレストランの天ぷらは、衣がサクサクでとても美味しいです。", "えびの天ぷらを２つ注文しました。"], "description": "A Japanese dish consisting of seafood or vegetables that are lightly battered and deep-fried until crispy. It's often served with a dipping sauce called tentsuyu.", "image_description": "A close-up of a plate of freshly made Japanese tempura. The tempura includes a variety of ingredients like a large prawn, a slice of sweet potato, and a shiitake mushroom, all coated in a light, crispy, golden-brown batter. Steam is gently rising from the food, and a small bowl of dark dipping sauce is placed beside the plate."}
{"en_translation": "sashimi", "word": "刺身", "language_code": "ja", "examples": ["このレストランの刺身は新鮮で美味しいです。", "刺身には醤油とわさびをつけます。", "いろいろな種類の魚の刺身を盛り合わせました。"], "description": "A Japanese dish of fresh, high-quality raw fish or seafood that is thinly sliced and served uncooked, often with condiments like soy sauce and wasabi.", "image_description": "A close-up of a traditional Japanese rectangular ceramic plate holding precisely arranged slices of raw fish. The plate features glistening, vibrant orange salmon sashimi and deep red tuna sashimi. Next to the fish are a small, perfectly formed mound of green wasabi and a small bowl of dark soy sauce."}
{"en_translation": "yakiniku", "word": "焼き肉", "language_code": "ja", "examples": ["週末、友達と焼き肉を食べに行きました。", "焼き肉の食べ放題は、若い人に人気があります。", "焼き肉の匂いが服についてしまった。"], "description": "A Japanese term for 'grilled meat', referring to the popular practice of grilling bite-sized pieces of meat, typically beef, and vegetables on a tabletop grill. It is often a communal and interactive dining experience where diners cook their own food.", "image_description": "A close-up shot of a small, round tabletop grill. Several thin slices of marbled raw beef are cooking on the hot grill, with visible grill marks and some smoke rising. Next to the grill, there are small bowls with dipping sauces, and a pair of chopsticks is picking up a cooked piece of meat."}
{"en_translation": "hot pot", "word": "鍋", "language_code": "ja", "examples": ["寒い冬の夜は、家族みんなで鍋を囲むのが一番です。", "友達と集まって鍋パーティーをしましょう。", "このレストランのキムチ鍋は絶品ですよ。"], "description": "A Japanese dish where a large pot of broth, meat, and vegetables is cooked and shared at the table. It is a popular communal meal, especially during colder months.", "image_description": "A large, steaming ceramic pot sits in the center of a dining table, filled with a bubbling broth and various ingredients like sliced meat, mushrooms, and leafy greens. Around the pot, several small bowls are placed, and hands with chopsticks are reaching in to take food, emphasizing the communal and shared nature of the meal."}
{"en_translation": "rice bowl", "word": "丼", "language_code": "ja", "examples": ["今日の昼ご飯はカツ丼を食べました。", "このレストランの海鮮丼はとても新鮮で美味しいです。", "親子丼は、鶏肉と卵を使った人気の丼物です。"], "description": "A Japanese dish consisting of a bowl of steamed rice with various toppings, such as simmered meat, fish, or vegetables. The word \"丼\" (donburi) itself refers to both the bowl and the dish. Common examples include 親子丼 (oyakodon - chicken and egg), カツ丼 (katsudon - pork cutlet), and 牛丼 (gyudon - beef).", "image_description": "A close-up of a classic Japanese ceramic bowl, known as a donburi. The bowl is filled with fluffy white rice, and topped with a generous serving of katsudon: a deep-fried pork cutlet, simmered in a sweet and savory broth with egg and onions. The focus is sharp on the bowl and its contents, with a plain, neutral background."}
{"en_translation": "udon", "word": "うどん", "language_code": "ja", "examples": ["温かいうどんが食べたいです。", "きつねうどんは美味しいです。", "家でうどんを作りました。"], "description": "A type of thick Japanese noodle made from wheat flour. It is known for its chewy texture and is often served in a hot broth or chilled with a dipping sauce.", "image_description": "A close-up shot of a traditional Japanese ceramic bowl filled with steaming hot udon noodles. The thick, white, and chewy noodles are submerged in a clear, light-brown dashi broth. Finely chopped green onions are sprinkled on top, adding a touch of vibrant color."}
{"en_translation": "soba", "word": "そば", "language_code": "ja", "examples": ["温かいそばが食べたいです。", "この店のそばはとても美味しいです。", "年越しにそばを食べる習慣があります。"], "description": "A type of thin Japanese noodle made from buckwheat flour. It can be served either chilled with a dipping sauce, or in a hot broth as a noodle soup.", "image_description": "A close-up of a bowl of Japanese soba noodles in a dark, savory broth. The thin, brownish-gray noodles are neatly arranged in the bowl, topped with chopped green onions and a slice of kamaboko fish cake. Steam is gently rising from the hot soup."}
{"en_translation": "pasta", "word": "パスタ", "language_code": "ja", "examples": ["このレストランのトマトクリームパスタは絶品です。", "週末に家族のためにパスタを料理する予定です。", "パスタを茹でるお湯には、少し塩を加えましょう。"], "description": "「パスタ」は、小麦粉を練って作られるイタリア料理の麺類を指す言葉です。スパゲッティ、ペンネ、フェットチーネなど、様々な形状のものが含まれます。通常、ソースと絡めて食べられます。", "image_description": "白いお皿の上に、湯気の立つトマトソースのスパゲッティが盛り付けられている。ソースにはひき肉と細かく刻まれたハーブが見え、上には緑のバジルの葉が数枚飾られている。背景はシンプルで、料理に焦点が合っている。"}
{"en_translation": "pizza", "word": "ピザ", "language_code": "ja", "examples": ["週末に友達とピザを食べる予定です。", "ここのピザはチーズがたっぷりで美味しいよ。", "デリバリーでピザを注文しようか。"], "description": "A popular Italian dish consisting of a round, flat base of leavened wheat-based dough topped with tomatoes, cheese, and often various other ingredients, which is then baked at a high temperature, traditionally in a wood-fired oven.", "image_description": "A freshly baked Neapolitan-style pizza sits on a rustic wooden table. The pizza has a golden-brown, bubbly crust, a vibrant red tomato sauce, and is topped with melted mozzarella cheese and fresh green basil leaves. A single slice is being lifted from the pizza, with cheese stretching from the slice back to the pie."}
{"en_translation": "salad", "word": "サラダ", "language_code": "ja", "examples": ["夕食にサラダを食べます。", "このサラダはとても新鮮です。", "シーザーサラダを注文しました。"], "description": "A dish, typically served cold, made of mixed raw or cooked vegetables. It is often served with a dressing and can be a side dish or a main course.", "image_description": "A close-up of a fresh garden salad in a white bowl. The salad is filled with crisp lettuce, bright red cherry tomatoes, sliced cucumbers, and shredded carrots. A light vinaigrette dressing is drizzled over the top, making the vegetables glisten."}
{"en_translation": "soup", "word": "スープ", "language_code": "ja", "examples": ["このレストランのスープはとても美味しいです。", "夕食に温かい野菜スープを作りました。", "ランチセットにはスープが付いていますか？"], "description": "「スープ」は、肉や魚、野菜などの具材を水やだしで煮込んで作る、温かい液状の料理です。世界中の多くの文化で、食事の最初に出されたり、それ自体が食事として食べられたりします。パンやご飯と一緒に食べることが多いです。", "image_description": "木製のテーブルの上に、湯気の立つ一杯のスープが置かれています。スープは鮮やかなオレンジ色で、中央には緑色のハーブが少し飾られています。ボウルのすぐそばにはスプーンが一本置かれており、背景はシンプルで焦点がスープに集中しています。"}
{"en_translation": "steak", "word": "ステーキ", "language_code": "ja", "examples": ["このレストランのステーキはとても美味しいです。", "誕生日なので、今夜はステーキを食べに行きましょう。", "ステーキの焼き加減はミディアムレアでお願いします。"], "description": "A thick slice of high-quality beef, typically grilled or fried. It is a popular Western-style dish often served in restaurants or cooked at home for a special meal.", "image_description": "A thick, juicy grilled steak is the centerpiece on a white plate. It has distinct, dark crisscross grill marks. A small pat of herb butter is melting on top, and a single sprig of rosemary garnishes the side. The background is simple and slightly blurred to keep the focus on the steak."}
{"en_translation": "hamburg steak", "word": "ハンバーグ", "language_code": "ja", "examples": ["今日の夕食は、母が作ったハンバーグです。", "このレストランのチーズハンバーグは絶品です。", "デミグラスソースのかかったジューシーなハンバーグが食べたい。"], "description": "A popular Japanese dish made from a grilled patty of ground meat, typically beef, pork, or a blend of both. It's often mixed with minced onions, egg, and breadcrumbs, and seasoned with spices. Unlike a hamburger, it's served without a bun, usually with rice and vegetables, and topped with a savory sauce like demi-glace.", "image_description": "A thick, juicy hamburg steak sits on a white plate, glistening with a rich, dark demi-glace sauce. Next to the patty is a neat mound of white rice and a side of colorful steamed vegetables, including bright green broccoli and orange carrots. The entire dish is presented as a complete, appetizing meal."}
{"en_translation": "fish", "word": "魚", "language_code": "ja", "examples": ["今日の夕食は魚です。", "このレストランの魚料理はとても美味しい。", "スーパーで新鮮な魚を買いました。"], "description": "The word for 'fish', specifically when referring to it as food or an ingredient in a dish. It is used when talking about buying, cooking, or eating fish.", "image_description": "A close-up of a grilled fish fillet on a clean, white plate. The fish is golden-brown with clear grill marks. A single slice of lemon and a small sprig of dill are placed on top as garnish. The background is simple and blurred, focusing all attention on the cooked fish as a meal."}
{"en_translation": "meat", "word": "肉", "language_code": "ja", "examples": ["このレストランの肉はとても美味しいです。", "彼女は健康のために赤身の肉をよく食べます。", "バーベキューでたくさんの肉を焼きました。"], "description": "The flesh of an animal, typically a mammal or bird, that is eaten as food. This term can refer to beef, pork, chicken, lamb, and other types of animal flesh prepared for consumption.", "image_description": "A close-up shot of several types of fresh, raw meat arranged on a butcher's block. There is a thick, marbled beef steak, a lean pork chop, and a plump chicken breast. The different colors and textures of the meats are clearly visible."}
{"en_translation": "vegetables", "word": "野菜", "language_code": "ja", "examples": ["健康のために、毎日たくさんの野菜を食べます。", "スーパーで新鮮な野菜を買いました。", "このスープには色々な種類の野菜が入っています。"], "description": "A general term for edible plants, or parts of plants, that are cultivated and consumed by humans as food. This typically includes the leaves, stems, roots, tubers, and sometimes flowers of a plant, and they are a staple part of cuisines worldwide, often eaten cooked or raw.", "image_description": "A close-up, top-down view of a variety of fresh, vibrant vegetables arranged on a rustic wooden cutting board. There's a bright orange carrot, a deep green head of broccoli, a shiny red bell pepper, a purple eggplant, and a leafy head of lettuce. The vegetables are whole and uncooked, showcasing their natural colors and textures."}
{"en_translation": "rice", "word": "ご飯", "language_code": "ja", "examples": ["毎朝、ご飯と味噌汁を食べます。 (Mainichi, gohan to misoshiru o tabemasu.) - Every morning, I eat rice and miso soup.", "もう昼ご飯の時間ですよ。 (Mou hirugohan no jikan desu yo.) - It's already time for lunch.", "「ご飯、大盛りにしますか？」 (Gohan, oomori ni shimasu ka?) - \"Would you like a large serving of rice?\""], "description": "The word ご飯 (gohan) refers to cooked rice, a staple in Japanese cuisine. It can mean a simple bowl of steamed rice, or it can be used more broadly to refer to a meal in general, such as breakfast (朝ご飯 - asagohan), lunch (昼ご飯 - hirugohan), or dinner (晩ご飯 - bangohan).", "image_description": "A steaming, fluffy bowl of white rice is placed in the center of a wooden table. The focus is entirely on the perfect bowl of cooked rice, with a soft, warm light highlighting the texture of the individual grains. The background is simple and out of focus, ensuring the bowl of rice is the only subject."}
{"en_translation": "bread", "word": "パン", "language_code": "ja", "examples": ["朝ごはんは、いつもパンを食べます。", "このパン屋のパンは、とても美味しいです。", "サンドイッチを作るために、パンを数枚切った。"], "description": "A food staple made from baking a dough of flour and water. While it can refer to bread in general, in Japan it often evokes images of soft, fluffy white bread known as shokupan, as well as a variety of sweet and savory buns.", "image_description": "A close-up of several types of popular Japanese bread arranged on a simple wooden platter. In the center is a thick, fluffy slice of white shokupan. Next to it are a sweet melon-pan with its distinct cookie-like crust and a glossy anpan filled with red bean paste. The background is plain and out of focus, drawing all attention to the delicious assortment of bread."}
{"en_translation": "water", "word": "水", "language_code": "ja", "examples": ["水を一杯ください。", "のどが渇いたから水を飲む。", "この水は飲めますか？"], "description": "The clear, potable liquid essential for hydration. This refers to water that is safe to drink, often served in a glass or bottle to quench thirst.", "image_description": "A clear glass of fresh, still water sits on a plain wooden table. A few drops of condensation are visible on the outside of the glass. The background is simple and out of focus, highlighting the glass of water as the main subject."}
{"en_translation": "tea", "word": "お茶", "language_code": "ja", "examples": ["食事の後に、温かいお茶を一杯いかがですか。", "このお茶は静岡県産で、とても香りが良いです。", "お客様が来たので、お茶の準備をしましょう。"], "description": "\"お茶\" refers to tea, but in Japan, it most commonly means Japanese green tea. It's a staple beverage served hot or cold, with meals, during breaks, or when welcoming guests. While it can refer to other types of tea like black tea (紅茶) or barley tea (麦茶), without any other context, \"お茶\" implies green tea.", "image_description": "A traditional Japanese ceramic teapot (a kyusu) is alongside a matching small teacup filled with vibrant green tea, with a small amount of steam rising from it. The set rests on a dark wooden tray, which is placed on a tatami mat. The scene is simple and clean, focusing entirely on the tea set."}
{"en_translation": "coffee", "word": "コーヒー", "language_code": "ja", "examples": ["毎朝、熱いコーヒーを一杯飲みます。", "友達とカフェに行って、コーヒーを飲みながら話しました。", "仕事の合間に、よくコーヒーを飲んでリフレッシュします。"], "description": "A brewed drink prepared from roasted coffee beans. It is one of the most popular drinks in the world and can be served hot or cold.", "image_description": "A white ceramic cup filled with dark brown coffee, with a small amount of steam rising from the surface. The cup is sitting on a matching saucer on a simple wooden table. The background is blurred to keep the focus on the cup of coffee."}
{"en_translation": "beer", "word": "ビール", "language_code": "ja", "examples": ["仕事の後に冷たいビールを一杯飲むのが最高だ。", "すみません、生ビールを二つください。", "このレストランはいろいろな国のビールを置いています。"], "description": "A popular alcoholic beverage made from malted cereal grains, such as barley, and flavored with hops. It is one of the most widely consumed alcoholic drinks in the world.", "image_description": "A tall, clear glass is filled with a golden, bubbly beer, topped with a thick, white head of foam. Condensation droplets are visible on the outside of the glass, suggesting it is cold and refreshing. The background is simple and out of focus."}
{"en_translation": "wine", "word": "ワイン", "language_code": "ja", "examples": ["このレストランはワインの種類が豊富です。", "食事と一緒に赤ワインを一杯注文した。", "チーズとワインは相性がいい。"], "description": "An alcoholic beverage made from fermented grapes. It is a popular drink that comes in several varieties, most commonly red and white, and is often enjoyed with meals.", "image_description": "A bottle of red wine with a simple label stands next to a clear wine glass filled with red wine. A small bunch of purple grapes sits beside them on a plain wooden surface. The background is neutral and out of focus."}
{"en_translation": "juice", "word": "ジュース", "language_code": "ja", "examples": ["朝ごはんにオレンジジュースを飲みます。", "このジュースは果汁100％で、とても美味しいです。", "すみません、リンゴジュースを一つください。"], "description": "A non-alcoholic beverage made from the liquid extract of fruits. While it primarily refers to fruit juice, in a broader sense, it can also encompass other sweet, non-carbonated soft drinks.", "image_description": "A clear glass is filled with bright orange juice, with droplets of condensation on its surface. Beside the glass, a whole orange and a sliced half-orange are placed on a clean, white surface, emphasizing the fresh fruit origin of the beverage."}
{"en_translation": "recommendation", "word": "おすすめ", "language_code": "ja", "examples": ["今日のおすすめは何ですか？", "これは店長のおすすめです。", "この本、本当におすすめだよ。"], "description": "A suggested item or course of action that is endorsed as the best choice. It's often used in restaurants, shops, or when giving advice to highlight a particularly good option.", "image_description": "A friendly chef in a Japanese restaurant is enthusiastically presenting a special dish, pointing at it with a proud smile. A small sign next to the dish has the word 'おすすめ' written on it. The dish is in sharp focus, while other items on the counter are slightly blurred, emphasizing it as the recommended choice."}
{"en_translation": "popular", "word": "人気", "language_code": "ja", "examples": ["この歌手は若者の間でとても人気があります。", "最近、このスタイルの服が人気です。", "彼の新しい映画は大変な人気を呼んでいる。"], "description": "The quality of being liked, enjoyed, or supported by a large number of people. It refers to the state of being in favor or having a positive public reception, often applied to individuals, products, or trends.", "image_description": "A singer stands on a brightly lit stage, smiling and waving to a massive, cheering crowd. The audience members are holding up colorful glow sticks and signs with the singer's name on them, their faces full of excitement and adoration. The atmosphere is energetic and celebratory."}
{"en_translation": "specialty", "word": "名物", "language_code": "ja", "examples": ["この町の名物は何ですか？", "大阪のたこ焼きは名物です。", "旅行先で名物のほうとうを食べた。"], "description": "A well-known product, especially a food, that a particular region or place is famous for. It's often a signature dish or item that tourists seek out.", "image_description": "A steaming, beautifully arranged bowl of a region's famous ramen is presented on a traditional wooden counter. A small, elegant sign next to the bowl has the Japanese characters for '名物' (meibutsu) clearly written on it. The background is a simple, out-of-focus traditional Japanese restaurant setting, ensuring the focus remains on the specialty dish."}
{"en_translation": "season", "word": "季節", "language_code": "ja", "examples": ["日本には四季、つまり四つの季節があります。", "一番好きな季節は秋です。", "季節の変わり目は風邪をひきやすい。"], "description": "Refers to the different divisions of the year, each characterized by particular weather patterns and daylight hours. In many parts of the world, including Japan, there are four distinct seasons: spring, summer, autumn, and winter.", "image_description": "A single large tree is depicted, but it is divided into four distinct vertical sections. The leftmost section shows the tree with pink cherry blossoms for spring. The next section shows the same tree with lush green leaves and bright sun for summer. The third section displays the tree with orange and red leaves for autumn. The final rightmost section shows the tree bare-branched and covered in snow for winter."}
{"en_translation": "fresh", "word": "新鮮", "language_code": "ja", "examples": ["この寿司はとても新鮮な魚を使っています。", "スーパーで新鮮な野菜を買いました。", "そのパン屋のパンは、毎朝焼きたてで新鮮だ。"], "description": "Refers to the quality of being newly harvested, caught, or prepared. It is commonly used for food items like vegetables, fish, and meat to emphasize that they are not old, stale, or preserved, but at their best quality.", "image_description": "A vibrant outdoor farmer's market stand overflowing with a variety of colorful vegetables. Crisp lettuce, shiny red tomatoes still on the vine, and bright orange carrots have droplets of water on them, looking as if they were just picked. In the background, a farmer is smiling and arranging the produce."}
{"en_translation": "spiciness level", "word": "辛さ", "language_code": "ja", "examples": ["このカレーの辛さは調節できますか？", "ラーメンを注文する時、辛さを選びます。", "私にはこの辛さがちょうどいいです。"], "description": "The noun '辛さ' refers to the degree or level of spiciness or heat in food. It's used to quantify how hot a dish is, often on a scale from mild to very spicy. You can use it to ask about, describe, or request a certain level of spiciness when ordering food.", "image_description": "A menu at a Japanese curry restaurant. The menu shows a picture of the curry, and next to it, there is a spiciness level chart. The chart has five chili pepper icons in a row, from one mild-looking chili to five fiery-red, steaming chilis, allowing a customer to choose their desired '辛さ' or spiciness level."}
{"en_translation": "mild", "word": "甘口", "language_code": "ja", "examples": ["辛いのが苦手なので、カレーはいつも甘口を選びます。", "このキムチは甘口で、子供でも食べやすいですよ。", "カレーの辛さは甘口と辛口、どちらがいいですか？"], "description": "Refers to a mild flavor in food, particularly when spiciness is a factor. It indicates a low level of heat or spice, making it suitable for those who prefer food that is not hot. This is commonly used on the packaging of products like Japanese curry to indicate the mildest spice level.", "image_description": "A package of Japanese curry roux is on a kitchen counter next to a bowl of steaming, light-brown curry. The packaging prominently features the large Japanese characters for \"甘口\" (amakuchi). On the package, there is an illustration of a smiling child happily eating the curry, reinforcing the idea of a mild, non-spicy flavor."}
{"en_translation": "medium spicy", "word": "中辛", "language_code": "ja", "examples": ["このカレーは中辛です。 (Kono karē wa chūkara desu.) - This curry is medium spicy.", "私はいつも中辛を選びます。(Watashi wa itsumo chūkara o erabimasu.) - I always choose medium spicy.", "すみません、カレーは中辛でお願いします。(Sumimasen, karē wa chūkara de onegaishimasu.) - Excuse me, I'll have the curry medium spicy, please."], "description": "Refers to a moderate level of spiciness in food, particularly common in Japanese curry. It sits between 'amakuchi' (甘口), which is mild or sweet, and 'karakuchi' (辛口), which is hot. 'Chūkara' is the standard or regular level of spiciness that suits most people.", "image_description": "A menu at a Japanese curry restaurant is shown up close. Three spice levels are listed vertically: the top one is 甘口 (mild) with a sweet, smiling emoji; the middle one is 中辛 (medium spicy) with a neutral, content emoji; and the bottom one is 辛口 (hot) with a sweating, red-faced emoji. A person's finger is pointing directly at the 中辛 option, indicating their selection of the medium spice level."}
{"en_translation": "spicy", "word": "辛口", "language_code": "ja", "examples": ["このカレーは辛口ですが、とても美味しいです。", "もっと辛口のソースはありますか？", "私はどちらかと言うと辛口が好きです。"], "description": "Refers to a spicy or hot flavor in food and drink. It indicates a high level of spice, the opposite of '甘口' (amakuchi), which means mild or sweet. It's commonly used when ordering food like curry or describing drinks like sake.", "image_description": "A person is eating a bowl of steaming, red-hot chili. Their eyes are wide and they have a bead of sweat on their forehead. They are fanning their mouth with one hand, showing a strong reaction to the intense spiciness of the food. Several red chili peppers are visible on the side of the bowl."}
{"en_translation": "very spicy", "word": "激辛", "language_code": "ja", "examples": ["このラーメンは激辛で、汗がたくさん出ます。", "激辛のカレーに挑戦したが、辛すぎて食べられなかった。", "彼女は辛いものが大好きで、いつも激辛の料理を注文します。"], "description": "Refers to a level of spiciness that is extremely high, intense, or violent. It describes food that is not just hot, but punishingly so, often containing a large amount of chili peppers or other potent spices. This term is used for dishes that are significantly hotter than standard 'spicy' (辛口) options.", "image_description": "A person's face is bright red and covered in sweat, with tears in their eyes and steam coming out of their ears. They are eating from a bowl of ramen filled with a fiery, bubbling red soup that has many red chili peppers floating on top. The person is fanning their open mouth, clearly showing the intense pain and heat from the extremely spicy food."}
{"en_translation": "amount", "word": "量", "language_code": "ja", "examples": ["このラーメンは量が多いですか？", "ご飯の量を少なくしてください。"], "description": "Refers to the quantity or amount of something, especially the serving size or portion of food. It's commonly used when asking about or adjusting the amount of a dish in a restaurant.", "image_description": "Two white ceramic bowls of steamed white rice are placed next to each other on a plain wooden table. The bowl on the left is piled high with a very large portion of rice, nearly overflowing. The bowl on the right contains a much smaller, standard portion of rice, about half the amount of the other bowl."}
{"en_translation": "large serving", "word": "大盛り", "language_code": "ja", "examples": ["ラーメンを大盛りでお願いします。", "この店は普通でも量が多いのに、大盛りは食べきれないよ。", "学生は大盛り無料のサービスが大好きだ。"], "description": "An extra-large portion of food, especially for dishes like ramen, rice bowls, or curry. In restaurants, you can often request 'oomori' for a bigger meal, sometimes for a small additional charge.", "image_description": "A huge, overflowing bowl of Japanese ramen is on a restaurant counter. The bowl is noticeably larger than a regular-sized bowl placed next to it for comparison. The noodles, broth, and toppings are piled high, almost spilling over the edge, clearly illustrating an extra-large serving."}
{"en_translation": "small serving", "word": "小盛り", "language_code": "ja", "examples": ["ラーメンを小盛りでお願いします。", "お子様には小盛りがちょうどいい量です。", "この店はご飯の量を大盛り、普通、小盛りから選べます。"], "description": "A term used in Japanese restaurants to refer to a smaller-than-standard serving of a dish, particularly for rice bowls or noodle dishes. It's the opposite of a large serving (大盛り). Customers can request a 'komori' if they have a smaller appetite or want to eat less, and it's often slightly cheaper than the regular size.", "image_description": "Two white ceramic bowls of Japanese curry rice are placed side-by-side on a dark wooden table. The bowl on the left is a regular, full portion with a large mound of white rice and a generous amount of dark brown curry. The bowl on the right is noticeably smaller, holding about half the amount of rice and curry, clearly illustrating a 'small serving'."}
{"en_translation": "regular serving", "word": "普通盛り", "language_code": "ja", "examples": ["ラーメンは普通盛りにします。", "この店のカレーは普通盛りでも結構ボリュームがある。"], "description": "Refers to the standard or regular portion size of a meal, especially for dishes like rice bowls or noodles. It's the default size, positioned between a small serving (小盛り) and a large serving (大盛り).", "image_description": "Three Japanese ramen bowls are lined up on a wooden counter. The one in the middle is a standard, full bowl and has a sign that says '普通盛り'. To the left is a noticeably smaller bowl (小盛り), and to the right is a much larger, overflowing bowl (大盛り), clearly showing the 'regular serving' as the standard option between small and large."}
{"en_translation": "allergy", "word": "アレルギー", "language_code": "ja", "examples": ["エビのアレルギーがあります。", "子供の卵アレルギーがよくなりました。", "そばアレルギーなので、外食の時は気をつけないといけません。"], "description": "A condition in which your body has a strong, negative reaction to a particular substance, often a type of food. This can manifest as symptoms like a rash, itching, swelling, or difficulty breathing after eating the specific food.", "image_description": "A person with red hives on their face and arms, looking uncomfortable and scratching their arm. In front of them on a table is a plate of shrimp, which they are looking at with a worried expression. The scene shows a clear negative reaction to a specific food."}
{"en_translation": "vegetarian", "word": "ベジタリアン", "language_code": "ja", "examples": ["私はベジタリアンなので、肉は食べません。", "このレストランにはベジタリアン向けのメニューがありますか？", "彼女は最近ベジタリアンになりました。"], "description": "A person who does not eat meat, and sometimes other animal products, especially for moral, religious, or health reasons.", "image_description": "A cheerful person is sitting at a wooden table, happily eating a large, colorful salad from a white bowl. The table is covered with fresh vegetables like carrots, bell peppers, and leafy greens. In front of the person, there is a clear \"no\" sign over a piece of steak and a chicken leg, symbolizing their dietary choice."}
{"en_translation": "seat", "word": "席", "language_code": "ja", "examples": ["すみません、ここは私の席です。", "彼は前の席に座った。", "会議の途中で席を立たないでください。"], "description": "A designated place or spot for a person to sit, such as in a classroom, theater, or at a dining table. It can refer to a specific chair or a general location where one is meant to be seated.", "image_description": "A single, empty wooden chair pulled up to a desk in a classroom. The chair and desk are in sharp focus, while the rest of the classroom and other seats are softly blurred in the background. The scene is quiet and highlights the concept of a designated place to sit."}
{"en_translation": "window-side", "word": "窓際", "language_code": "ja", "examples": ["窓際の席をお願いします。", "私の机は窓際にあるので、とても明るいです。", "窓際に植物を置きました。"], "description": "The area or space directly next to a window. It often refers to a seat, desk, or table with a view outside.", "image_description": "The interior of a quiet cafe. A single empty wooden table and chair are positioned right next to a large, clean window. Sunlight is streaming through the window, illuminating the table and the floor area immediately surrounding it. Outside the window, a blurry street scene is visible."}
{"en_translation": "non-smoking", "word": "禁煙", "language_code": "ja", "examples": ["この建物は全面禁煙です。", "禁煙席をお願いします。"], "description": "The act of refraining from smoking or the prohibition of smoking in a certain area. This word is commonly seen on signs in public places like restaurants, train stations, and parks to indicate that smoking is not allowed.", "image_description": "A standard international 'no smoking' sign, which shows a lit cigarette inside a red circle with a red diagonal line through it. The sign is mounted on a wall in a clean, modern indoor public space like an airport or a cafe. The background is slightly blurred to emphasize the sign."}
{"en_translation": "private room", "word": "個室", "language_code": "ja", "examples": ["このレストランは個室があるので、子供連れでも安心です。", "忘年会は、居酒屋の個室を予約しました。"], "description": "A room in a public establishment, like a restaurant or karaoke bar, that is separate from the main area and for the private use of a customer or group.", "image_description": "A small, traditional Japanese-style dining room with a single table and seating for four. The room is enclosed by sliding paper screen doors (shoji), separating it from a larger, bustling restaurant visible in the background. The focus is on the intimate, separated nature of the space."}
{"en_translation": "table", "word": "テーブル", "language_code": "ja", "examples": ["夕食の準備ができたので、お皿をテーブルに並べてください。", "このレストランは、窓際のテーブルが人気です。", "家族みんなでテーブルを囲んで食事をします。"], "description": "A piece of furniture with a flat top and one or more legs, providing a level surface for eating a meal. It is a loanword from the English word 'table'.", "image_description": "A simple wooden dining table is shown. On the table, there are two place settings, each with a plate, a fork, and a knife. The background is neutral and out of focus, highlighting only the table and its function for dining."}
{"en_translation": "counter", "word": "カウンター", "language_code": "ja", "examples": ["カウンター席に座って、ラーメンを注文した。", "このカフェはカウンターがあるので、一人でも入りやすい。", "バーのカウンターで友達と話した。"], "description": "A long, high-top table in a restaurant, bar, or cafe, where customers sit on stools to eat or drink. This is a common seating arrangement in establishments like ramen shops or sushi restaurants, allowing for direct service from the staff on the other side.", "image_description": "A person is sitting on a high stool at a polished wooden counter in a cozy, warmly lit cafe. In front of them is a cup of coffee. The focus is on the long counter and the style of seating, with the background slightly blurred."}
{"en_translation": "waiting time", "word": "待ち時間", "language_code": "ja", "examples": ["このレストランは人気なので、いつも待ち時間が長いです。", "テーマパークの新しいアトラクションは、待ち時間が3時間だった。", "銀行の待ち時間をアプリで確認できます。"], "description": "The amount of time one has to wait for something to begin or to become available, such as for a table at a restaurant, for a train or bus, or before an appointment.", "image_description": "A digital sign at the entrance of a crowded restaurant. The sign clearly shows the Japanese text '待ち時間' and underneath it '45分'. A small, diverse group of people are standing near the sign, looking bored and occasionally checking their phones or watches."}
{"en_translation": "fully booked", "word": "満席", "language_code": "ja", "examples": ["すみません、今夜は満席です。", "人気の映画なので、週末は満席になることが多いです。", "私が予約しようとした飛行機は満席だった。"], "description": "This word means that a place like a restaurant, theater, or flight has no available seats. It's used to say that something is 'fully booked' or 'full'.", "image_description": "A couple stands at the entrance of a busy Japanese restaurant. A restaurant employee is bowing apologetically, pointing to a sign on the door. The sign clearly displays the Japanese kanji '満席'. Through the window, every table inside the restaurant is visibly occupied by customers eating and talking."}
{"en_translation": "available seat", "word": "空席", "language_code": "ja", "examples": ["すみません、空席はありますか？ (Excuse me, are there any available seats?)", "レストランの前に「空席あり」の看板が出ていた。 (There was a sign saying 'Seats Available' in front of the restaurant.)", "人気の映画だったので、空席が一つもなかった。 (It was a popular movie, so there wasn't a single available seat.)"], "description": "Refers to a seat, spot, or table in a place like a restaurant, theater, or on transportation that is unoccupied and available for someone to use. It's commonly used to ask about or indicate availability.", "image_description": "A small, square wooden table for two is shown inside a cozy cafe. On the center of the table, there is a small, upright sign with the Japanese word '空席' written on it, clearly indicating that the table is available. The background shows the blurred interior of the cafe, with no people sitting at this specific table, emphasizing its availability."}
{"en_translation": "cancellation", "word": "キャンセル", "language_code": "ja", "examples": ["レストランの予約をキャンセルすることにした。", "ご注文のキャンセルは、発送前までにお願いします。", "悪天候のため、フライトがキャンセルされた。"], "description": "The act of calling off a previously made arrangement, such as a reservation, appointment, or order. It signifies the decision to nullify a booking or a plan that was previously confirmed.", "image_description": "A close-up on a smartphone screen showing a flight booking confirmation. A finger is prominently displayed, pressing a bright red button with the text 'Cancel Booking'. The background is out of focus, drawing all attention to the act of cancellation on the screen."}
{"en_translation": "takeout", "word": "テイクアウト", "language_code": "ja", "examples": ["このレストランはテイクアウトができますか？ (Kono resutoran wa teikuauto ga dekimasu ka?)", "今夜はテイクアウトのピザにしよう。(Konya wa teikuauto no piza ni shiyou.)", "仕事が忙しいので、昼ごはんはテイクアウトにした。(Shigoto ga isogashii node, hirugohan wa teikuauto ni shita.)"], "description": "Refers to food that is purchased from a restaurant and then taken away to be eaten at a different location, like home or a park. It's the same as \"to-go\" or \"takeout\" in English.", "image_description": "A person is at a restaurant counter, accepting a paper bag of food containers from a staff member. The bag is neatly packed, and the person is dressed to go outside, clearly indicating they are taking the food to eat elsewhere. The background shows a cozy restaurant setting."}
{"en_translation": "takeout", "word": "持ち帰り", "language_code": "ja", "examples": ["持ち帰りでお願いします。(Mochikaeri de onegaishimasu.) - I'd like this to go, please.", "このレストランは持ち帰りもできますか？ (Kono resutoran wa mochikaeri mo dekimasu ka?) - Does this restaurant also do takeout?", "今日の夜ご飯は、お寿司の持ち帰りにしよう。(Kyou no yoru gohan wa, o-sushi no mochikaeri ni shiyou.) - Let's get takeout sushi for dinner tonight."], "description": "The Japanese term for ordering food at a restaurant or shop to be eaten elsewhere. It's the equivalent of \"takeout\" or \"to go\" in English, and is the opposite of eating inside the establishment.", "image_description": "A person is at a restaurant counter, accepting a paper bag filled with food containers from an employee. The bag is clearly packed for travel. In the background, other patrons are seated and eating, highlighting the distinction between dining in and taking out."}
{"en_translation": "delivery", "word": "配達", "language_code": "ja", "examples": ["今日の昼ご飯はピザを配達してもらおう。", "すみません、この荷物の配達をお願いします。", "配達の人がもうすぐ着くはずです。"], "description": "The action of bringing goods, letters, or parcels to a specific person or place. This term is commonly used for services that deliver items, such as mail, packages, or food, directly to a customer's home or office.", "image_description": "A smiling delivery person wearing a cap and a company uniform is handing a paper bag with food containers to a person standing at the entrance of their home. The delivery person is holding a smartphone or a small terminal for payment. The background shows a typical residential doorway."}
{"en_translation": "air conditioner", "word": "エアコン", "language_code": "ja", "examples": ["暑いからエアコンをつけてください。", "エアコンが効きすぎて、部屋が寒いです。", "このアパートはエアコンがついていますか？"], "description": "「エアコン」は「air conditioner」の短縮形です。主に室内の温度を調節するための機械で、特に暑い季節に部屋を涼しくするために使われます。多くのモデルには、冬に部屋を暖めるための暖房機能も備わっています。", "image_description": "部屋の壁に取り付けられた、白くてモダンなエアコンの室内機。ユニットの下部から、涼しさを感じさせるような青みがかった半透明の風が吹き出している様子が描かれている。部屋の他の部分は最小限に抑えられ、焦点はエアコン本体に当てられている。"}
{"en_translation": "WiFi", "word": "WiFi", "language_code": "ja", "examples": ["このカフェはWiFiが無料です。", "すみません、WiFiのパスワードを教えていただけますか？", "旅行中はポケットWiFiをレンタルしました。"], "description": "スマートフォン、コンピューター、その他のデバイスを無線でインターネットに接続する技術。これにより、ケーブルなしでネットワーク通信が可能になります。", "image_description": "A person is sitting at a coffee shop table, using their laptop. A glowing WiFi symbol is visible in the air between the laptop and a wireless router on the counter in the background, with faint signal waves connecting them. The person looks pleased to be connected to the internet."}
{"en_translation": "password", "word": "パスワード", "language_code": "ja", "examples": ["このWi-Fiのパスワードを教えていただけますか？", "コンピュータにログインするためにパスワードを入力してください。", "パスワードを忘れてしまい、アカウントにアクセスできません。"], "description": "A secret string of letters, numbers, or symbols that you must type to access a computer system, a network like Wi-Fi, or an online account.", "image_description": "A person is holding a smartphone, and on the screen, there is a Wi-Fi network list with one network selected. A dialog box is open, prompting for a password with a blinking cursor in the input field. A prominent key or lock icon is visible next to the input field, symbolizing access and security."}
{"en_translation": "towel", "word": "タオル", "language_code": "ja", "examples": ["シャワーの後、タオルで体を拭きました。", "濡れたタオルは洗濯機に入れてください。", "すみません、タオルを一枚貸していただけますか？"], "description": "A piece of absorbent cloth or paper used for drying oneself or wiping things dry.", "image_description": "A soft, fluffy towel hangs on a simple wall hook. The towel is a calming blue color. A single drop of water is visible on the towel, emphasizing its absorbent quality. The background is neutral and out of focus, drawing all attention to the towel."}
{"en_translation": "yukata", "word": "浴衣", "language_code": "ja", "examples": ["旅館に着いたら、まず浴衣に着替えた。", "夏祭りには浴衣を着て行きたいな。", "温泉のあと、浴衣を着て散歩した。"], "description": "A yukata is a casual, lightweight cotton kimono worn during the summer in Japan. It is often provided to guests at traditional Japanese inns (ryokan) to be worn after bathing or for relaxing. People also commonly wear yukata to summer festivals and fireworks displays.", "image_description": "A Japanese woman is wearing a simple blue and white patterned yukata while standing on the wooden veranda of a traditional ryokan. She is looking out at a tranquil Japanese garden with green maple trees and stone lanterns. The overall atmosphere is peaceful and summery."}
{"en_translation": "hot spring", "word": "温泉", "language_code": "ja", "examples": ["日本の温泉は、世界的に有名です。", "週末は、箱根の温泉にゆっくり浸かりに行きたいです。", "この旅館の露天風呂は、自然に囲まれていて最高でした。"], "description": "A natural geothermal spring of hot water, used for bathing and relaxation. In Japan, onsen are often found at traditional inns (ryokan) or public bathhouses, and can be either outdoors (露天風呂, rotenburo) or indoors. They are a popular destination for health, tourism, and unwinding.", "image_description": "An outdoor Japanese hot spring (rotenburo) made of natural stones, filled with steaming, slightly cloudy water. The bath is surrounded by snow-dusted rocks and a simple bamboo fence. In the background, a serene forest with pine trees under a calm sky can be seen, creating a peaceful and relaxing atmosphere."}
{"en_translation": "large public bath", "word": "大浴場", "language_code": "ja", "examples": ["この旅館の最上階に、景色がいい大浴場があります。", "一日の終わりに大浴場でリラックスするのが好きです。", "大浴場を利用する前に、かけ湯で体を洗い流してください。"], "description": "A large, communal bath found in Japanese inns (ryokan), hotels, or hot spring (onsen) resorts. These baths are typically separated by gender and are a shared space for guests to relax and bathe. It's a key part of the Japanese bathing culture, distinct from a private bathroom in a guest room.", "image_description": "An interior view of a traditional Japanese public bath. The main feature is a large, rectangular hot spring pool made of natural stone, filled with steaming water. Several people are seen relaxing in the bath. The background shows a large window with a view of a tranquil bamboo garden."}
{"en_translation": "ryokan", "word": "旅館", "language_code": "ja", "examples": ["温泉が好きなので、旅行の時はいつも旅館に泊まります。", "週末は箱根の旅館でゆっくり過ごした。", "この旅館は食事が美味しいと評判です。"], "description": "A type of traditional Japanese inn that originated in the Edo period. Ryokans typically feature tatami-matted rooms, communal baths (often utilizing onsen hot springs), and provide guests with yukata (casual kimonos). Staying at a ryokan offers a unique opportunity to experience Japanese culture and hospitality, including elaborate multi-course meals like kaiseki.", "image_description": "A serene, traditional Japanese room with tatami mat flooring and shoji paper screen doors. In the center of the room sits a low wooden table with two floor cushions. The shoji doors are slightly open, revealing a view of a tranquil Japanese garden with bamboo and a stone lantern."}
{"en_translation": "taxi", "word": "タクシー", "language_code": "ja", "examples": ["空港までタクシーで行きましょう。", "すみません、タクシーを一台お願いします。", "この住所までタクシーでいくらぐらいかかりますか？"], "description": "A car that can be hired, along with a driver, to transport passengers to a destination of their choice. The fare is typically calculated based on distance and time using a meter. In Japan, taxis are a common and convenient mode of transportation, known for their clean condition and professional drivers.", "image_description": "A distinctively Japanese taxi, a black sedan, is parked by the curb of a modern city street at night. The \"TAXI\" (空車) sign on the roof is illuminated in red, and the automatic rear passenger door is open, ready to welcome a passenger. The vehicle is clean and polished, reflecting the high standard of service."}
{"en_translation": "station", "word": "駅", "language_code": "ja", "examples": ["駅で会いましょう。", "次の駅で降ります。", "この電車は東京駅に行きますか？"], "description": "A place where trains, buses, or other public transport vehicles stop on a route to let passengers get on and off.", "image_description": "A Japanese train is arriving at a station platform. A sign on a pillar clearly shows the station name, including the character '駅'. Several people are standing on the platform, waiting to board the train."}
{"en_translation": "map", "word": "地図", "language_code": "ja", "examples": ["旅行の前に、地図で場所を確認します。", "このアプリの地図はとても分かりやすいです。", "道に迷ったので、地図で現在地を調べました。"], "description": "A diagrammatic representation of an area of land or sea showing physical features, cities, roads, etc. It is a tool used for navigation to find a way from one place to another.", "image_description": "A large, colorful paper map is spread open on a simple wooden table. The map details a city with streets, parks, and buildings. A red line is drawn on the map tracing a path from a house icon to a landmark icon. There are no other objects on the table, focusing entirely on the map as a tool for direction."}
{"en_translation": "tourist information center", "word": "観光案内所", "language_code": "ja", "examples": ["すみません、観光案内所はどこですか？", "駅前の観光案内所で地図をもらいました。", "観光案内所で地元のおすすめレストランを教えてもらった。"], "description": "A facility where tourists can get information such as maps, pamphlets, and recommendations for sightseeing spots, lodging, and transportation in the area.", "image_description": "A friendly staff member at a counter with a large 'i' (information) sign is handing a map to a tourist who looks happy and appreciative. The background is filled with racks of colorful brochures and posters of local attractions. The overall atmosphere is bright and helpful."}
{"en_translation": "nearby", "word": "近く", "language_code": "ja", "examples": ["駅の近くに住んでいます (I live near the station).", "この近くにコンビニはありますか (Is there a convenience store nearby?)"], "description": "Refers to a location that is physically close or in the immediate vicinity of a reference point. It indicates a short distance to a place, suggesting it is easy to reach on foot or by a short trip.", "image_description": "A person is standing on a street corner, looking towards a train station that is just down the block, clearly within a short walking distance. A large, clear sign with a train symbol is visible on the station building, emphasizing its proximity. The scene shows a sunny day on a typical Japanese street with a few other pedestrians and buildings in the background."}
{"en_translation": "address", "word": "住所", "language_code": "ja", "examples": ["この書類にあなたの名前と住所を書いてください。", "引っ越したので、住所が変わりました。", "彼の住所を知っていますか？"], "description": "Refers to the specific location details of a residence or building, including the street name, number, city, and postal code. This information is used for mail delivery and identifying a particular place.", "image_description": "A close-up of a letter envelope with a Japanese address neatly written on it. The address includes a postal code (e.g., 〒100-0001), a prefecture, city, and specific building numbers, clearly indicating the destination for mail. The background is a plain wooden table."}
{"en_translation": "problem", "word": "問題", "language_code": "ja", "examples": ["この問題は難しすぎます。", "何か問題でもありましたか？", "私たちはその問題について話し合う必要があります。"], "description": "Refers to a matter or situation that is unwelcome or harmful and requires a solution. It can be a challenge, a question to be solved, or a source of trouble or difficulty.", "image_description": "A person stands before a large chalkboard covered in complex mathematical equations, looking puzzled and scratching their head. The overwhelming visual of the complicated formulas represents a difficult problem or challenge that needs to be solved."}
{"en_translation": "breakdown", "word": "故障", "language_code": "ja", "examples": ["旅行中に車が故障してしまった。", "エアコンが故障しているので、修理を呼ばなければならない。", "駅の券売機が故障で使えなかった。"], "description": "This term refers to a malfunction, failure, or breakdown of a machine or device. It's used when a piece of equipment or a mechanical system stops working correctly due to a fault.", "image_description": "A car is stopped on the side of a road with its hood open, and light smoke is coming from the engine. The driver is standing next to the car, looking concerned while on the phone. An orange warning triangle is placed on the road behind the car."}
{"en_translation": "noisy", "word": "うるさい", "language_code": "ja", "examples": ["隣の部屋がうるさくて、全然眠れない。", "工事の音がうるさくて、仕事に集中できない。"], "description": "Refers to an excessive and unpleasant level of sound that is loud, annoying, and disruptive. It carries a negative nuance, indicating that the noise is bothersome to the speaker. It can describe a place, a sound, or even a person who is being too loud or nagging.", "image_description": "A person is sitting at their desk inside a house, grimacing and tightly covering their ears with their hands in frustration. Through the window behind them, a construction site is visible with a worker operating a loud jackhammer. The scene clearly depicts someone being disturbed by an overwhelming and unpleasant noise from outside."}
{"en_translation": "quiet", "word": "静か", "language_code": "ja", "examples": ["この図書館はとても静かです。", "田舎の夜は静かで、星がきれいだった。", "彼女は静かな声で話しました。"], "description": "Describes a state of quietness, serenity, or tranquility. It refers to an environment or atmosphere that is free from noise and disturbance, creating a sense of peace and calm. It can also describe a person's calm and gentle demeanor.", "image_description": "A serene Japanese zen garden in the early morning. The white gravel is perfectly raked in swirling patterns around a few moss-covered rocks. A single maple tree with red leaves stands to the side, and a gentle mist hangs in the air, creating a peaceful and silent atmosphere."}
{"en_translation": "clean", "word": "清潔", "language_code": "ja", "examples": ["このレストランのキッチンは、いつも清潔に保たれている。", "彼は毎日シャワーを浴びて、体を清潔にしている。", "清潔なタオルを使ってください。"], "description": "Refers to a state of being clean, hygienic, and free from dirt, dust, or germs. It emphasizes not just tidiness and order, but also a sanitary or hygienic condition. This word is often used to describe places, objects, or a person's habits and appearance.", "image_description": "A brightly lit, modern bathroom. The white porcelain sink and toilet are sparkling clean. A neatly folded stack of fresh white towels sits on a shelf. The floor is immaculately clean, and the air looks fresh and sanitary."}
{"en_translation": "comfortable", "word": "快適", "language_code": "ja", "examples": ["このホテルの部屋は広くてとても快適です。", "新しいアパートは駅に近くて快適な生活が送れそうだ。", "エアコンのおかげで、夏も快適に過ごせます。"], "description": "Refers to a state of being pleasant, convenient, and free from stress or discomfort. It describes an environment or situation that provides a sense of physical or psychological ease and well-being.", "image_description": "A person is relaxing in a bright, airy, and modern living room. They are sitting on a plush, comfortable sofa with their feet up, reading a book. Sunlight streams through a large window, and a gentle breeze rustles the curtains. The entire scene conveys a sense of perfect ease, pleasantness, and effortless living."}
{"en_translation": "kind", "word": "親切", "language_code": "ja", "examples": ["田中さんはとても親切な人です。", "道を教えてくれて、ご親切にありがとうございます。", "旅行中にたくさんの親切な人々に会いました。"], "description": "Refers to the quality of being kind, gentle, and considerate to others. It describes someone who acts with thoughtfulness and aims to be helpful, often shown through their actions and behavior.", "image_description": "An elderly woman with a cane is struggling to carry a heavy bag of groceries. A young person has stopped to help her, holding the bag with a warm and friendly smile. The sun is shining, and the overall atmosphere is one of warmth and helpfulness."}
{"en_translation": "plan", "word": "予定", "language_code": "ja", "examples": ["今日の午後の予定は何ですか？", "来週、友達と会う予定です。", "会議の予定が変更になりました。"], "description": "A predetermined plan, schedule, or arrangement for a future event or action. It refers to something that has been decided and is expected to happen, like an appointment in a calendar or an item on a schedule.", "image_description": "A wall calendar is shown with a specific date circled in red. Inside the circle, an icon of an airplane and the word '旅行' (travel) are written. A hand is pointing towards the circled date, indicating a planned trip. The focus is on the calendar as a visual representation of a set plan."}
{"en_translation": "confirmation", "word": "確認", "language_code": "ja", "examples": ["フライトの時間をもう一度確認してください。", "データの最終確認をお願いします。", "ホテルの予約を確認する。"], "description": "The act of checking or verifying something to make sure it's correct or certain. It's the process of double-checking information or a situation to remove any doubt.", "image_description": "A person at a desk is carefully comparing a printed document with information on a computer screen. Their finger is pointing to a specific line on the document, and their expression is focused, indicating a process of verification. The screen shows a booking confirmation form with dates and names highlighted."}
{"en_translation": "guidance", "word": "案内", "language_code": "ja", "examples": ["駅員が親切にホームまでの道を案内してくれた。", "明日、私が新しいキャンパスを案内します。", "彼の案内のおかげで、迷わずに博物館に着きました。"], "description": "The act of leading or guiding someone, typically by showing them the way to a destination or providing them with information about a place. It can refer to both the physical act of showing someone around and the verbal act of giving directions or explanations.", "image_description": "A friendly-looking guide in a uniform is standing at an information desk in a bright, modern train station. They are smiling and pointing to a large wall map with one hand, while a tourist with a backpack looks on attentively. The scene clearly depicts someone receiving helpful directions."}
{"en_translation": "classmate", "word": "クラスメート", "language_code": "ja", "examples": ["クラスメートと一緒に宿題をしました。", "彼は私のクラスメートです。", "クラスメート全員でプロジェクトを成功させた。"], "description": "A fellow student who is in the same class at school. This term is used to refer to people you share lessons with and study alongside.", "image_description": "Two young students, a boy and a girl, are sitting at a single school desk in a classroom, studying together from the same textbook. They are both looking at the book and smiling, clearly helping each other understand the material. The background is a simple, generic classroom setting, keeping the focus on the two classmates."}
{"en_translation": "stationery", "word": "文房具", "language_code": "ja", "examples": ["新しい学期が始まるので、文房具をそろえる必要があります。", "彼女は可愛い文房具を集めるのが趣味です。", "この店の文房具コーナーは品揃えが豊富だ。"], "description": "The Japanese word \"文房具\" (bunbougu) refers to a general category of items known as stationery. This includes a wide variety of tools used for writing, drawing, and other office or school-related tasks. Common examples include pens, pencils, notebooks, erasers, rulers, paper clips, and staplers.", "image_description": "A variety of stationery items are neatly arranged on a wooden desk. There is a notebook, a fountain pen, several colored pencils, a ruler, an eraser, and some paper clips. The arrangement is clean and organized, showcasing the different tools used for writing and office work."}
{"en_translation": "how to use", "word": "使い方", "language_code": "ja", "examples": ["このカメラの使い方が分かりません。", "パソコンの基本的な使い方を学びましょう。", "その言葉の使い方が間違っていますよ。"], "description": "Refers to the way or method in which something is used. It's a noun that means \"how to use\" or \"way of using\", often found in instructions or when asking for guidance on operating something.", "image_description": "A person is sitting at a desk with a brand new, complex-looking gadget in front of them, like a drone or a high-tech camera. They are carefully reading the instruction manual which is open to a page with clear diagrams and numbered steps. The person has a slightly confused but focused expression, tracing the steps in the manual with their finger to understand the gadget's operation."}
{"en_translation": "how to read", "word": "読み方", "language_code": "ja", "examples": ["この漢字の読み方を教えてください。", "彼の名前の読み方は難しいですね。", "文脈によって言葉の読み方が変わることがあります。"], "description": "Refers to the way a word, character, or name is read or pronounced. It is often used when asking for or explaining the pronunciation of something written.", "image_description": "A person is pointing at a complex Japanese kanji character in a book. Above the character, phonetic symbols (furigana) are written, clearly indicating the pronunciation. The person has a look of dawning comprehension, as if they have just figured out how to read the word."}
{"en_translation": "class, lesson", "word": "授業", "language_code": "ja", "examples": ["明日の授業の準備をしましょう。", "今日の歴史の授業はとても面白かったです。", "田中先生の授業はいつも分かりやすいです。"], "description": "\"授業\" (jugyō) refers to a formal period of instruction, like a class or lesson, typically in an academic setting such as a school or university. It's the designated time when a teacher imparts knowledge to students on a specific subject.", "image_description": "A teacher stands in front of a classroom, pointing at a whiteboard with diagrams and notes. Several students are sitting at their desks, looking attentively at the teacher, with notebooks and pens in hand. The setting is clearly a formal educational environment."}
{"en_translation": "blackboard, chalkboard", "word": "黒板", "language_code": "ja", "examples": ["先生が黒板に漢字を書きました。", "生徒は黒板で問題を解きました。", "授業の後、黒板をきれいにしましょう。"], "description": "A reusable writing surface, typically black or dark green, used in classrooms for writing or drawing on with chalk. It is often mounted on a wall or on an easel.", "image_description": "A large, dark green chalkboard is mounted on a classroom wall. White chalk writing and mathematical formulas are visible across its surface. A wooden ledge at the bottom of the chalkboard holds several sticks of white and colored chalk and a dusty eraser."}
{"en_translation": "paper", "word": "紙", "language_code": "ja", "examples": ["この紙にあなたの名前を書いてください。", "すみません、紙を一枚もらえますか？", "子供の時、よく紙で飛行機を作りました。"], "description": "A thin, flat material made from processed fibers, used for writing, printing, drawing, or wrapping things. It is the most common material for books, notebooks, and letters.", "image_description": "A single, crisp, white sheet of A4 paper is lying flat on a plain wooden desk. A simple black pen is placed next to it, as if ready to be used for writing. The lighting is bright and clear, highlighting the texture of the paper."}
{"en_translation": "page", "word": "ページ", "language_code": "ja", "examples": ["この本の35ページを見てください。", "次のページに重要な情報が書いてあります。", "知らない単語があったので、彼はページの余白にメモを書いた。"], "description": "Refers to one side of a sheet of paper in a book, magazine, newspaper, or notebook. It's the surface that contains text or images and is typically marked with a number.", "image_description": "A close-up view of an open book. One hand is in the process of turning a single page. The page being turned is in sharp focus, showing printed Japanese text and a page number in the corner. The surrounding pages and the background are softly blurred to emphasize the concept of a single 'page'."}
{"en_translation": "word, vocabulary", "word": "単語", "language_code": "ja", "examples": ["新しい単語をノートに書き留めた。", "この単語の意味を辞書で調べてください。", "彼は難しい単語をたくさん知っている。"], "description": "A single unit of language that has a specific meaning and can stand alone or be combined with other units to form a sentence. In the context of language learning, it refers to an item of vocabulary to be learned.", "image_description": "A Japanese flashcard is shown in the center. On the flashcard, the Japanese word '単語' is written in large, clear characters. Below the Japanese word, its English translation 'word' is written in smaller letters. A simple, minimalist icon of a speech bubble containing the letter 'A' is next to the words, symbolizing a single unit of language. The background is a clean, uncluttered, light color."}
{"en_translation": "answer, response", "word": "答え", "language_code": "ja", "examples": ["先生の質問の答えが分かりません。", "彼は私のメールにまだ答えをくれていない。", "問題の答えを見つけるのに時間がかかった。"], "description": "The information or statement given in reply to a question, problem, or inquiry. It refers to the resolution or solution that is sought. This can be a simple spoken response in a conversation, a written answer on a test, or the solution to a puzzle or complex problem.", "image_description": "A student sits at a desk, confidently raising their hand. On the chalkboard in front of them is a question. The teacher is looking at the student, ready to hear the response. The focus is on the action of providing an answer to a query."}
{"en_translation": "how to read, reading", "word": "読み方", "language_code": "ja", "examples": ["この漢字の読み方を教えてください。", "その名前は読み方が難しいですね。", "文脈によって漢字の読み方が変わります。"], "description": "Refers to the specific way a word or character is read or pronounced. In Japanese, Kanji characters can often have multiple pronunciations, so this word is used to ask for or state the correct reading in a particular context.", "image_description": "A person's finger is pointing to a complex Japanese Kanji character in a book. Above the character, smaller phonetic symbols (furigana) are written, indicating how to pronounce it. The background is a simple, clean study desk."}
{"en_translation": "how to use, usage", "word": "使い方", "language_code": "ja", "examples": ["この洗濯機の使い方がよく分かりません。", "新しいアプリの使い方を教えてください。", "お金の使い方は難しいです。"], "description": "Refers to the method or the specific steps for operating or utilizing something. It can be used for physical objects like machines and tools, as well as more abstract concepts like words or money.", "image_description": "A person is standing in front of a new, modern coffee machine with a confused expression. They are holding a large, open instruction manual that has clear diagrams and numbered steps. The person is pointing at a specific diagram in the manual with one hand and then pointing to a matching button on the coffee machine with the other, trying to figure out the process."}
{"en_translation": "way of saying, expression", "word": "言い方", "language_code": "ja", "examples": ["彼の言い方が悪かったので、誤解されてしまった。", "もっと丁寧な言い方をしてください。", "彼女の言い方はいつも優しくて、心が和む。"], "description": "Refers to the specific manner or style of expressing something through words. It encompasses not just the vocabulary and grammar used, but also the tone, politeness level, and overall nuance of how something is said. A different 'iikata' can completely change the feeling or impact of a message, even if the core content is the same.", "image_description": "A person with a gentle expression says something to another person who is listening intently. The speech bubble coming from the speaker is soft, rounded, and filled with pleasant, pastel-colored flowers, symbolizing a kind and thoughtful way of speaking. The listener is smiling warmly, clearly receiving the message in a positive way."}
{"en_translation": "example", "word": "例", "language_code": "ja", "examples": ["例えば、この文のように使います。", "分かりやすい例を一つ挙げてください。", "歴史上の例を参考にする。"], "description": "A specific case or instance used to clarify a general rule, demonstrate a concept, or serve as a model. It helps make abstract ideas more concrete and understandable by providing a tangible illustration.", "image_description": "A teacher is standing in front of a whiteboard, pointing to a single, highlighted sentence. The sentence is clearly labeled \"Example Sentence.\" The rest of the whiteboard is filled with grammatical rules and explanations, but the teacher's focus on the one sentence makes it clear that it is an illustration of those rules."}
{"en_translation": "assignment, task", "word": "課題", "language_code": "ja", "examples": ["夏休みの課題が多くて、まだ全部終わっていません。", "このプロジェクトの最大の課題は、予算が少ないことです。", "先生から新しい課題が出されました。"], "description": "A task, project, or homework assigned by a person in authority, such as a teacher or a manager. It can also refer to a challenge or problem that needs to be solved.", "image_description": "A student is sitting at a wooden desk, looking thoughtfully at a single piece of paper in front of them. The paper has the word '課題' written clearly at the top. The desk is otherwise empty except for a single pen, emphasizing the focus on the assigned task."}
{"en_translation": "bus", "word": "バス", "language_code": "ja", "examples": ["毎日バスで学校に通っています。", "次のバスは何時に来ますか？", "このバスは渋谷駅に行きますか？"], "description": "A large motor vehicle designed to carry many passengers along a fixed route. It's a common form of public transportation used for commuting within cities or for longer-distance travel between them.", "image_description": "A large, modern city bus is parked at a bus stop on a clean city street. Several people are waiting in a line to board the bus. The bus has large windows and its destination is displayed on a digital sign on the front."}
{"en_translation": "ferry", "word": "フェリー", "language_code": "ja", "examples": ["この島へはフェリーで行くのが一番便利です。", "毎日たくさんのフェリーが港を出入りしています。", "昨日はフェリーに乗って、海の景色を楽しみました。"], "description": "A ship that transports passengers, and often vehicles, on a regular route between two or more points. It's a common form of public transportation for crossing bodies of water like channels, bays, or rivers.", "image_description": "A large white and blue ferry is docked at a port. The ferry has multiple decks for passengers to stand on, and a ramp is lowered to the dock. A few cars are driving up the ramp to board the vessel. The scene is set against a clear sky and calm blue water."}
{"en_translation": "subway", "word": "地下鉄", "language_code": "ja", "examples": ["毎日地下鉄で通勤しています。", "この駅は地下鉄の乗り換えが便利です。", "ここから一番近い地下鉄の駅はどこですか？"], "description": "A public transportation system consisting of electric trains that run in tunnels below the ground. It is a common and efficient way to travel in large cities.", "image_description": "A modern subway train is pulling into a well-lit underground station platform. Passengers are waiting on the platform, and the dark, arched tunnel is visible ahead of the train. The station has signs on the walls, typical of a metro system."}
{"en_translation": "train", "word": "電車", "language_code": "ja", "examples": ["毎日、電車で会社に行きます。", "次の電車は何時に来ますか？", "週末は電車に乗って、京都へ旅行に行きました。"], "description": "The general Japanese word for an electric train. It is used to refer to most types of trains that run on electricity, including commuter trains, subway trains, and long-distance trains like the Shinkansen (bullet train). This is the most common word you will use when talking about taking a train in Japan.", "image_description": "A sleek, modern Japanese commuter train is pulling into a station platform. The train has a pantograph on its roof connecting to an overhead electrical line. Several people are waiting on the clean and orderly platform to board the train."}
{"en_translation": "bullet train", "word": "新幹線", "language_code": "ja", "examples": ["明日、新幹線で大阪に行きます。", "新幹線の窓から富士山が見えました。", "東京から京都まで新幹線でどのくらいかかりますか？"], "description": "The Shinkansen, also known as the bullet train, is Japan's high-speed railway network, famous for its speed, punctuality, and safety. It connects major cities across the country.", "image_description": "A sleek, white and blue Japanese bullet train (Shinkansen) with a long, aerodynamic nose cone at a modern station platform. Mount Fuji is visible in the background under a clear blue sky, firmly placing the scene in Japan. The train is the central focus, appearing fast and futuristic even while stationary."}
{"en_translation": "IC card", "word": "ICカード", "language_code": "ja", "examples": ["駅の改札でICカードをタッチする。", "コンビニの支払いはICカードでできます。", "ICカードの残額が少なくなったのでチャージした。"], "description": "A rechargeable, contactless smart card, primarily used in Japan for paying fares on public transportation like trains and buses. It can also be used for small payments at convenience stores, vending machines, and some shops.", "image_description": "A close-up of a person's hand holding a Japanese IC card, tapping it on the illuminated reader of a train station ticket gate. The gate's screen shows the fare being deducted. The background is a clean, modern train station platform."}
{"en_translation": "bus stop", "word": "バス停", "language_code": "ja", "examples": ["最寄りのバス停はどこですか？", "バス停で5分待ちました。", "雨が降っていたので、バス停の屋根の下で待った。"], "description": "A designated roadside location, often marked by a sign and sometimes including a shelter, where buses halt to allow passengers to board and alight.", "image_description": "A Japanese bus stop sign stands on a sidewalk next to a road. A simple bench is beside the sign, and a person is sitting on it, looking down the street. The scene is a clear, everyday urban or suburban setting, focusing on the functional nature of a bus stop."}
{"en_translation": "ticket", "word": "切符", "language_code": "ja", "examples": ["駅で切符を買います。", "すみません、切符を拝見します。", "彼は切符をなくしてしまいました。"], "description": "A small piece of paper or card that serves as proof of payment for transportation, such as a train, bus, or subway. It grants the holder the right to travel a specific route or for a certain period.", "image_description": "A close-up of a person's hand holding a small, rectangular Japanese train ticket. The ticket has Japanese characters and numbers printed on it. In the background, the ticket gates of a train station are visible but slightly out of focus."}
{"en_translation": "platform", "word": "ホーム", "language_code": "ja", "examples": ["次の電車は5番ホームから出発します。", "駅のホームで友達を待っています。", "黄色い線の内側で、ホームでお待ちください。"], "description": "The designated raised area alongside the train tracks at a station, where passengers wait to board or get off a train.", "image_description": "A train platform at a Japanese station. A sleek 'Shinkansen' bullet train is pulling up alongside the platform. Several people are standing in an orderly line behind a yellow safety line painted on the platform floor, waiting to board the train."}
{"en_translation": "ticket gate", "word": "改札", "language_code": "ja", "examples": ["駅の改札で待ち合わせましょう。", "ICカードを改札機にタッチして入場します。", "切符をなくして改札を出られなくなりました。"], "description": "The ticket barrier or gate in a train station where you show, insert, or scan your ticket or transit card to pass through. This is the entry and exit point for the platform area.", "image_description": "A row of automated ticket gates in a modern Japanese train station. A person is tapping their IC card on the sensor of one gate, and the small barrier doors are open, allowing them to pass through. The digital display on the gate is lit up. The focus is on the action of passing through the gate."}
{"en_translation": "one-way", "word": "片道", "language_code": "ja", "examples": ["東京駅まで片道切符を一枚ください。", "この料金は片道ですか、それとも往復ですか。", "家から学校までは片道で約30分かかります。"], "description": "Refers to a journey or ticket that is for travel in one direction only, from a starting point to a destination, without a return trip. This is the opposite of a round trip (往復). It is commonly used when purchasing tickets for transportation like trains, buses, or airplanes.", "image_description": "A person's hand holding a train ticket. The ticket clearly shows a single, bold arrow pointing from a departure city (e.g., Tokyo) to an arrival city (e.g., Osaka). In the background, a platform sign for a train also points in a single direction, reinforcing the concept of a journey without a return leg."}
{"en_translation": "transfer", "word": "乗り換え", "language_code": "ja", "examples": ["新宿駅で山手線に乗り換えました。", "次の駅で乗り換えが必要です。", "乗り換えの時間が十分にあるか心配です。"], "description": "The act of changing from one mode of public transportation to another, such as from one train line to another, or from a train to a bus, as part of a single journey.", "image_description": "A person is walking on a busy train station platform, following a large overhead sign. The sign has an arrow and the Japanese text \"乗り換え\" pointing towards a different platform for another train line. One train is visible on the current track, and a different train can be seen in the distance on the other track."}
{"en_translation": "round trip", "word": "往復", "language_code": "ja", "examples": ["東京駅まで往復の切符を一枚ください。", "家から会社まで往復で二時間かかります。"], "description": "The action of going to a destination and then returning to the starting point. It refers to a complete journey that includes both the outbound and return legs. This term is commonly used when purchasing tickets for transportation, such as trains, buses, or airplanes, to indicate that the fare covers travel in both directions.", "image_description": "A Japanese train ticket is shown. The ticket clearly indicates two destinations, for example, 'Tokyo' and 'Osaka', with a prominent double-headed arrow between them, symbolizing a journey there and back. The characters '往復' are clearly visible on the ticket."}
{"en_translation": "fare", "word": "運賃", "language_code": "ja", "examples": ["渋谷駅までの電車の運賃はいくらですか？", "バスを降りる時に運賃を払います。", "来月から運賃が値上がりするそうです。"], "description": "The fee paid for a journey on public transport, such as a bus, train, or taxi. It is the price of a single ticket for a specific route.", "image_description": "A close-up of a person's hand inserting Japanese yen coins into the payment slot of a bus fare box. The fare box is next to the driver, and a small digital screen shows the amount being paid. The focus is tight on the hand, the coins, and the machine to clearly illustrate the act of paying for transport."}
{"en_translation": "timetable", "word": "時刻表", "language_code": "ja", "examples": ["駅で新しい時刻表をもらいました。", "旅行の前に、インターネットで時刻表を調べておこう。", "このバスは時刻表通りに運行していますか？"], "description": "A chart that lists the scheduled departure and arrival times for public transportation like trains, buses, or airplanes. It helps people plan their journeys by showing when and where services will be available.", "image_description": "A large, clear timetable for a Japanese train line is displayed on a wall at a train station platform. The timetable is a grid with station names, times, and train types. The word '時刻表' is clearly visible at the top."}
{"en_translation": "destination", "word": "行き先", "language_code": "ja", "examples": ["旅行の行き先はもう決めましたか？", "バスの行き先を確認してから乗ってください。"], "description": "The place, location, or point to which someone or something is going or being sent. It's the final stop or end point of a journey or trip.", "image_description": "A signpost at a fork in the road with arrows pointing in different directions. One arrow points towards a bustling city skyline, another towards a serene mountain range, and a third towards a sunny beach. A person is looking at the signpost, contemplating which path to take, representing the choice of a destination."}
{"en_translation": "limited express", "word": "特急", "language_code": "ja", "examples": ["京都へは特急で行くのが一番早いです。", "この特急は次の停車駅まで止まりません。", "旅行のために特急券を予約しました。"], "description": "A type of express train in Japan that is faster than a standard express train (急行) because it stops only at major stations. A supplementary ticket, called a 'tokkyū-ken' (特急券), is usually required in addition to the base fare ticket.", "image_description": "A sleek, modern Japanese train is shown speeding along a track, with a slight motion blur to emphasize its high speed. The train is passing by a small, local train station without stopping, highlighting its 'limited stop' nature. The focus is entirely on the train and the track to represent the concept of a fast, direct journey."}
{"en_translation": "express", "word": "急行", "language_code": "ja", "examples": ["急行に乗れば、次の駅は渋谷です。", "この電車は急行ですか、それとも各駅停車ですか？", "すみません、この駅に急行は止まりますか？"], "description": "A type of train service that is faster than a local train because it skips some stations. It only stops at major stations, making it a convenient way to travel longer distances more quickly.", "image_description": "A Japanese train with the characters '急行' clearly visible on its front and side is speeding through a train station without stopping. On the platform, people are waiting and watching the train pass by. The scene clearly shows the train skipping the station, illustrating its express nature."}
{"en_translation": "local train", "word": "各駅停車", "language_code": "ja", "examples": ["急いでいるので各駅停車ではなく急行に乗った。", "この電車は各駅停車なので、全ての駅に止まります。"], "description": "A train service that stops at every station along its route, as opposed to an express or rapid train that skips some stations. It is usually the slowest way to travel on that line.", "image_description": "A Japanese train is at a station platform. A large, clear route map is visible on the platform, showing a train line with many stops. Every single stop on the map is illuminated or highlighted, indicating that the train will visit all of them. The train itself has the characters '各駅停車' clearly written on its front or side display."}
{"en_translation": "delay", "word": "遅延", "language_code": "ja", "examples": ["人身事故のため、電車に遅延が発生しています。", "すみません、電車が遅延したので、遅延証明書をもらえますか？", "大雪の影響で、多くの路線で遅延や運休が出ています。"], "description": "A situation where a scheduled event, particularly transportation like trains or buses, is not on time and is running late. It's the term you'll often see on display boards at train stations or hear in announcements to indicate that the service is behind schedule.", "image_description": "An electronic departures board at a Japanese train station platform. Several train times are listed, but next to one of them, the word '遅延' is displayed in bright red characters. A few anxious-looking commuters are standing on the platform, checking their watches or phones, with the stationary train visible in the background."}
{"en_translation": "first train", "word": "始発", "language_code": "ja", "examples": ["明日の朝、始発で大阪に向かいます。", "寝坊してしまい、始発に乗り遅れた。", "この路線の始発は何時ですか？"], "description": "The first train service of the day from a particular station or on a particular line. It refers to the earliest train available for passengers in the morning, often departing before sunrise.", "image_description": "An empty train platform at dawn, with the sun just beginning to rise. A single, modern train is arriving. A digital sign on the platform is clearly visible, displaying the characters 「始発」 and an early morning time like 5:00."}
{"en_translation": "next station", "word": "次の駅", "language_code": "ja", "examples": ["「次の駅で降ります。」", "「すみません、次の駅は新宿ですか？」", "「まもなく次の駅、渋谷に到着します。」"], "description": "In the context of transportation like trains or buses, '次の駅' (tsugi no eki) refers to the very next stop on the route. It's a common phrase used in announcements to inform passengers about the upcoming station where the vehicle will halt.", "image_description": "A view from inside a train, looking through the window at a station platform that is just coming into sight. An electronic sign inside the train car, above the door, displays the text '次の駅: 東京' (Next Station: Tokyo), clearly indicating the upcoming stop. The platform is slightly blurred to suggest the train is still in motion, about to arrive."}
{"en_translation": "last train", "word": "最終電車", "language_code": "ja", "examples": ["最終電車に乗り遅れないように、駅まで走った。", "飲み会が盛り上がって、危うく最終電車を逃すところだった。", "すみません、渋谷方面の最終電車は何時ですか？"], "description": "The final train service of the day. This is the last opportunity to take a train to a particular destination before the service stops for the night. Missing this train often means one has to find an alternative, and likely more expensive, mode of transportation like a taxi.", "image_description": "A nearly empty train platform late at night, illuminated by artificial lights. A single person is running towards a train that is about to depart, with its doors visibly closing. A digital sign on the platform clearly indicates it is the final train of the day, showing a late time like 23:50. The scene captures a sense of urgency and finality."}
{"en_translation": "rapid", "word": "快速", "language_code": "ja", "examples": ["この快速電車は次の駅には止まりません。", "急いでいるので、普通ではなく快速に乗ろう。", "東京駅に行くには、中央線の快速が便利です。"], "description": "Refers to a 'rapid' train service. This type of train is faster than a local train (普通) as it skips some of the smaller stations, but it makes more stops and is generally not as fast as a limited express (特急) or bullet train (新幹線). It's a common and convenient option for commuting longer distances in metropolitan areas.", "image_description": "A sleek, modern Japanese commuter train is at a station platform. The electronic destination board on the side of the train and on the platform clearly displays the Japanese characters '快速' in bright red. The train appears to be moving, with a slight blur in the background, suggesting it's passing through the station without stopping."}
{"en_translation": "to ride", "word": "乗る", "language_code": "ja", "examples": ["毎日、電車に乗って学校に行きます。", "このバスに乗れば、市役所の前まで行けますよ。", "昨日、初めて新幹線に乗りました。"], "description": "The verb 乗る (noru) means 'to ride' or 'to get on' a form of transportation. It is used for a wide variety of vehicles, including trains, buses, cars, and bicycles. This verb specifically refers to the action of boarding or being a passenger in a vehicle.", "image_description": "A young woman with a backpack is stepping up from a train platform onto a commuter train. The train doors are open, and other passengers can be seen inside. The scene captures the moment of boarding the vehicle."}
{"en_translation": "crowded", "word": "混雑", "language_code": "ja", "examples": ["電車の中は大変混雑していた。", "スーパーは夕方になると混雑する。", "事故で道路が混雑している。"], "description": "A state where a place is filled with a large number of people, making it difficult to move around. It refers to the condition of being packed or congested with people, such as in a busy station, a popular event, or a shopping street.", "image_description": "A crowded subway car in Japan. People are standing very close to each other, packed tightly from door to door. Some are holding onto straps, others are looking at their phones, and it's clear there is no room to move."}
{"en_translation": "to be in time", "word": "間に合う", "language_code": "ja", "examples": ["走れば、まだ電車に間に合うかもしれない。", "頑張って、レポートの締め切りに間に合わせた。", "会議に間に合うように、早めに家を出た。"], "description": "Refers to succeeding in arriving somewhere or finishing something just before a deadline or scheduled time. It carries the nuance of narrowly avoiding being late.", "image_description": "A person is breathlessly jumping onto a train just as the doors are beginning to slide shut. Through the train window, other passengers can be seen already settled in their seats. On the platform, a digital clock displays the departure time, indicating that the person made it with no time to spare."}
{"en_translation": "boarding area", "word": "乗り場", "language_code": "ja", "examples": ["バスの乗り場はどこですか？", "3番乗り場でお待ちください。", "タクシー乗り場には長い列ができていた。"], "description": "A designated location, such as a stop, stand, or platform, where passengers wait to board a form of public transportation like a bus, train, taxi, or ferry.", "image_description": "A clearly marked bus stop sign on a city street. The sign has a simple graphic of a bus and Japanese text that says 「バスのりば」. A few people are standing in a neat line next to the sign, waiting for the bus which is just pulling up to the curb."}
{"en_translation": "to get off", "word": "降りる", "language_code": "ja", "examples": ["次のバス停で降ります。", "電車を降りるときは、足元にご注意ください。", "目的地に着いたので、タクシーを降りました。"], "description": "To get off or alight from a form of transportation, such as a bus, train, or car. It refers to the action of exiting a vehicle.", "image_description": "A person is captured mid-action, stepping down from the door of a public bus onto the sidewalk. The bus doors are open, and the person has one foot on the bus step and the other about to touch the pavement. The scene is a clear, day-time shot focusing on the action of disembarking the vehicle."}
{"en_translation": "seat", "word": "座席", "language_code": "ja", "examples": ["新幹線の座席を予約しました。", "飛行機の座席はお決まりですか？", "私の座席はどこですか？"], "description": "A designated place for sitting, such as a seat on a train, bus, plane, or in a theater or stadium. It often implies a formally allocated or numbered seat.", "image_description": "The interior of a Japanese bullet train (Shinkansen). The focus is on a row of clean, empty, modern-looking seats, all facing forward. The seats are upholstered in a simple, calm color and have a small fold-down tray on the back. Outside the large window next to the seats, the scenery is slightly blurred to suggest movement."}
{"en_translation": "ticket machine", "word": "券売機", "language_code": "ja", "examples": ["駅の券売機で明日の新幹線の切符を買った。", "映画館の券売機は現金だけじゃなくて、クレジットカードも使える。", "すみません、この券売機の使い方が分かりません。"], "description": "An automated machine, typically found at train stations, bus terminals, or cinemas, where you can purchase tickets without needing to interact with a person.", "image_description": "A person is standing in front of a sleek, modern ticket machine in a bright, clean Japanese train station. The machine's large touchscreen displays various ticket options with Japanese text and icons. The person's hand is extended, about to touch a button on the screen to make a selection."}
{"en_translation": "reserved seat", "word": "指定席", "language_code": "ja", "examples": ["新幹線の指定席を予約しました。", "指定席はありますか？", "この席は指定席ですから、自由席の車両へ移動してください。"], "description": "A seat on transportation like a train or bus, or in a venue like a movie theater, that is assigned to a specific person who has booked it in advance. This guarantees the ticket holder a specific spot, unlike non-reserved seating where seating is first-come, first-served.", "image_description": "A close-up of a single, empty seat on a modern Japanese bullet train (Shinkansen). The seat has a clean, gray fabric cover. Attached to the back of the seat in front is a tray table in the upright position, and above it, a small digital screen clearly displaying a seat number and the Japanese characters for 'Reserved' (予約席). The window next to the seat shows a blurred view of a train platform."}
{"en_translation": "ticket window", "word": "窓口", "language_code": "ja", "examples": ["みどりの窓口で新幹線の切符を買う。", "コンサートのチケットは、どの窓口で買えますか？", "銀行の窓口は3時に閉まります。"], "description": "A service counter or window where staff attend to customers. While it often refers to a place for buying tickets (like at a train station or theater), it can also be used for other services like bank transactions or information desks.", "image_description": "A person is at a train station, leaning slightly towards a glass window counter. Inside the counter, a uniformed station employee is smiling and handing a train ticket to the person. The scene is brightly lit, and the focus is on the interaction at the ticket window."}
{"en_translation": "non-reserved seat", "word": "自由席", "language_code": "ja", "examples": ["この新幹線には自由席が3両あります。", "週末だったので、自由席はとても混んでいた。", "自由席の切符を買えば、好きな席に座れますよ。"], "description": "In Japan, this term refers to seating on public transportation, particularly on long-distance trains like the Shinkansen (bullet train), that does not require a specific seat reservation. Passengers with a non-reserved ticket can sit in any available seat in the designated non-reserved cars on a first-come, first-served basis.", "image_description": "The interior of a Japanese Shinkansen (bullet train) car. There are rows of seats, some empty and some occupied by passengers. A digital sign above the door at the end of the car clearly displays the Japanese characters \"自由席\". A couple with luggage is walking down the aisle, looking for two empty seats together."}
{"en_translation": "exit", "word": "出口", "language_code": "ja", "examples": ["駅の出口はあそこです。", "デパートの出口が分からなくて、迷ってしまいました。", "この建物の出口は一つだけですか。"], "description": "A place for leaving a building, station, or enclosed area, such as a doorway or gate that leads outside.", "image_description": "A person is walking towards a brightly lit sign with the Japanese characters for 'exit' (出口) and an arrow pointing the way. The sign is hanging from the ceiling of a modern, clean train station. Through the indicated doorway, you can see the bright daylight of the city street outside, creating a clear contrast between inside and outside."}
{"en_translation": "south exit", "word": "南口", "language_code": "ja", "examples": ["駅の南口で待ち合わせましょう。", "南口を出て、右に曲がってください。", "このバスは駅の南口に停まりますか。"], "description": "In Japan, train stations and large buildings often have multiple exits, each named after a direction. 南口 refers to the exit on the south side of the building, a crucial piece of information for navigating and meeting people. It's a compound of 南 (minami - south) and 口 (guchi - exit).", "image_description": "A wide shot of a modern Japanese train station exit. Above the automatic ticket gates, a large, clear sign is prominently displayed, reading \"南口\" in large black kanji, with \"South Exit\" written in smaller English text underneath. Through the glass doors of the exit, a sunny city street with trees and buildings is visible, suggesting the warmth of the south."}
{"en_translation": "route map", "word": "路線図", "language_code": "ja", "examples": ["駅の壁にある大きな路線図で、目的地までの行き方を確認した。", "このアプリは市内のバスの路線図が見られてとても便利だ。", "旅行先の路線図は複雑で、理解するのに少し時間がかかった。"], "description": "A diagram that visually represents the routes and stations of a public transport system, such as a train, subway, or bus network. It's used by passengers to understand the system's layout and plan their travel from one point to another.", "image_description": "A close-up of a brightly lit public transit map on a wall. The map shows a complex web of colorful, intersecting lines (red, blue, green) representing different routes. Each line has small circles along it, with Japanese characters next to them indicating station names. The map is the central focus, filling the entire frame."}
{"en_translation": "north exit", "word": "北口", "language_code": "ja", "examples": ["新宿駅の北口で会いましょう。 (Let's meet at the north exit of Shinjuku Station.)", "駅の北口を出て、左側に図書館があります。 (Exit the station through the north exit, and the library will be on your left.)"], "description": "The exit on the north side of a public building, most commonly a train or subway station. It is a compound of '北' (kita), meaning north, and '口' (guchi), meaning mouth or opening. Many larger stations have exits corresponding to the cardinal directions.", "image_description": "A view of a modern Japanese train station exit from the outside. Above the sliding glass doors, a sign clearly displays the kanji '北口'. Next to the kanji, a large, clear compass symbol points north. People are shown walking out of the station exit into a sunlit city street."}
{"en_translation": "entrance", "word": "入口", "language_code": "ja", "examples": ["駅の入口はどこですか？", "デパートの入口で、友達を待っています。", "美術館の入口でチケットを見せてください。"], "description": "The place where you enter a building or area, such as a station, store, or park. It marks the point of entry.", "image_description": "The entrance to a modern Japanese train station. A large, clear sign above the automatic sliding glass doors prominently displays the characters '入口'. Several people are walking through the doors into the station, clearly showing it as the way in. The focus is on the sign and the action of entering the building."}
{"en_translation": "east exit", "word": "東口", "language_code": "ja", "examples": ["東口で会いましょう。", "東口を出て、右に曲がってください。", "すみません、東口はどこですか？"], "description": "In Japan, train and subway stations often have multiple exits. '東口' (higashi-guchi) is a compound of '東' (higashi), meaning east, and '口' (guchi), meaning mouth or exit. It specifically refers to the exit located on the eastern side of the station, helping people navigate large, complex station buildings.", "image_description": "A sign hanging above a modern train station exit. The sign has large, clear Japanese characters '東口' written on it, with the smaller English text 'East Exit' written directly below. An arrow points towards the glass doors of the exit. The sun is rising in the background, casting a warm light and indicating the direction east."}
{"en_translation": "west exit", "word": "西口", "language_code": "ja", "examples": ["西口で会いましょう。", "西口に行くバスはどれですか。", "本屋は新宿駅の西口の近くにあります。"], "description": "The exit on the west side of a building, typically a train or subway station. It is a compound of '西' (nishi), meaning west, and '口' (guchi), meaning mouth or opening.", "image_description": "A view from outside a modern Japanese train station exit. A large, clear sign hangs above the exit, showing the Japanese characters '西口' with 'West Exit' written underneath. Several people are walking out from under the sign. The sun is setting in the background, casting a warm, golden light, indicating the western direction."}
{"en_translation": "reception", "word": "受付", "language_code": "ja", "examples": ["ホテルの受付で鍵を受け取りました。", "会社の受付で入館証をもらってください。", "ご不明な点がございましたら、受付までお問い合わせください。"], "description": "In a building such as a hotel, office, or hospital, the '受付' is the front desk or counter where visitors and guests first go to check in, make appointments, or ask for information. It's the main point of contact upon arrival.", "image_description": "A clean and modern front desk in a lobby with a sign that says '受付'. A person is standing behind the counter, smiling and welcoming a visitor. The focus is on the desk itself as the designated place for reception."}
{"en_translation": "one night", "word": "一泊", "language_code": "ja", "examples": ["温泉旅館に一泊したいです。", "ホテルは一泊いくらですか？", "週末、京都に一泊しました。"], "description": "A counter for the number of nights when staying at an accommodation like a hotel or inn. It specifically refers to a stay of one night.", "image_description": "A person with a single travel backpack is at a hotel reception desk, receiving a room key from the hotel staff. Behind the counter, a calendar is visible with today's date and the next day circled, with an arrow connecting them to signify a one-night stay. The scene suggests a short, overnight trip."}
{"en_translation": "hot water", "word": "お湯", "language_code": "ja", "examples": ["熱いお湯で緑茶を淹れる。", "お風呂のお湯加減はどうですか？", "カップラーメンを食べるために、お湯を沸かした。"], "description": "Water that has been heated, typically for drinking, cooking, or bathing. It is distinct from '水' (mizu), which means cold or room-temperature water. 'お湯' is the common term for hot water in everyday situations, such as making tea or filling a bathtub.", "image_description": "A traditional Japanese ceramic teapot is pouring steaming hot water into a small, matching teacup. Wisps of steam are clearly visible rising from both the spout of the teapot and the surface of the water in the cup. The background is simple and neutral, keeping the focus entirely on the act of pouring and the hot water itself."}
{"en_translation": "guest room", "word": "客室", "language_code": "ja", "examples": ["このホテルの客室は全てオーシャンビューです。", "デラックスの客室を予約しました。", "客室のミニバーはご利用になりますか？"], "description": "A formal term for a guest room, typically in a hotel, inn, or on a passenger ship. It combines the characters for 'guest' (客) and 'room' (室), referring to a room designated for a customer or guest to stay in.", "image_description": "A neatly arranged hotel guest room. A large, comfortable bed with white linens is the central focus. Beside the bed is a small nightstand with a lamp. In the background, a window shows a pleasant view, and a small desk and chair are visible in the corner."}
{"en_translation": "heating", "word": "暖房", "language_code": "ja", "examples": ["寒いので暖房をつけます。", "この部屋の暖房は強すぎます。"], "description": "An indoor heating system used to warm a room or building, such as a heater or an air conditioner with a heating function. It refers to the equipment itself or the action of using it to make a space warmer, especially during cold weather.", "image_description": "An interior shot of a modern living room in winter. On the wall, an air conditioner unit is clearly on, with stylized orange wavy lines indicating hot air blowing out. Snow can be seen falling outside the window, creating a strong contrast with the warm and cozy room. The main focus is on the heating unit as the source of warmth."}
{"en_translation": "shower", "word": "シャワー", "language_code": "ja", "examples": ["毎朝、シャワーを浴びて目を覚まします。", "ジムで汗をかいた後、シャワーを浴びた。", "お風呂が壊れているので、シャワーしか使えません。"], "description": "A fixture that sprays water, under which a person stands to wash their body. It can also refer to the act of washing oneself using such a fixture, often as a quicker alternative to a bath.", "image_description": "A modern shower head mounted on a tiled wall, with streams of water spraying downwards. The focus is on the water coming from the shower head within a simple, clean shower stall. No person is visible, only the shower fixture and the water."}
{"en_translation": "lodging/stay", "word": "宿泊", "language_code": "ja", "examples": ["旅行中、私たちは美しい温泉旅館に宿泊した。", "このホテルは宿泊客に無料の朝食を提供しています。", "出張のため、駅の近くで宿泊施設を探しています。"], "description": "The act of staying somewhere for a night or more, typically as a paying guest at a hotel, inn, or other type of accommodation. It refers specifically to the service and period of lodging, separate from the travel or activities involved.", "image_description": "A traveler with a suitcase is being greeted by a bowing staff member at the entrance of a traditional Japanese inn (ryokan). The background shows a serene, welcoming interior with tatami mat floors and shoji paper screens, indicating a place for an overnight stay. The overall scene conveys a sense of peaceful and comfortable temporary lodging."}
{"en_translation": "air conditioning", "word": "エアコン", "language_code": "ja", "examples": ["暑いのでエアコンをつけました。", "部屋のエアコンが壊れています。", "エアコンの設定温度は26度です。"], "description": "A device used to cool the air in an indoor space, such as a room or a car. It is a common appliance for controlling the temperature and humidity, especially during hot weather.", "image_description": "A sleek, white, modern air conditioning unit is mounted on a plain wall. From its vents, visible waves of cool, blue-tinged air are blowing out, illustrating its function of cooling a room. The unit is the sole focus of the image."}
{"en_translation": "luggage/baggage", "word": "荷物", "language_code": "ja", "examples": ["空港で荷物を預ける。", "旅行の荷物が多すぎて、スーツケースが閉まらない。", "ホテルにチェックインする前に、荷物をフロントに預かってもらった。"], "description": "Refers to bags, suitcases, and other portable belongings that one carries, especially when traveling. It's a general term for the items you take with you on a trip.", "image_description": "A traveler standing next to a pile of luggage. The luggage includes a large hard-shell suitcase, a smaller carry-on suitcase, a backpack, and a duffel bag. They are sitting on the floor of a generic airport or train station terminal."}
{"en_translation": "road/way", "word": "道", "language_code": "ja", "examples": ["この道は公園に続いている。", "駅に行く道を教えてください。", "山の中に細い道があった。"], "description": "A physical path, route, or street that one can walk or drive on. It refers to the tangible way leading from one place to another.", "image_description": "A single, empty paved road stretches forward through a green, grassy field. The road is the central focus, leading the eye toward the horizon. The sky above is clear and blue. The scene is simple and uncluttered, emphasizing the concept of a path or way."}
{"en_translation": "hot spring/onsen", "word": "温泉", "language_code": "ja", "examples": ["日本には有名な温泉がたくさんあります。", "週末、友達と温泉に行きました。", "この温泉は、お肌がすべすべになることで知られています。"], "description": "A Japanese hot spring, a natural geothermal spring with bathing facilities. These are often found in volcanic regions and are popular destinations for relaxation and their believed health benefits. The term can refer to the spring itself or the resort/inn built around it.", "image_description": "An outdoor Japanese hot spring (rotenburo) made of natural stones, filled with steaming, slightly cloudy water. The onsen is surrounded by a serene natural landscape, such as a tranquil forest with moss-covered rocks and Japanese maple trees. In the distance, a snow-capped mountain is visible under a clear sky."}
{"en_translation": "outdoor bath", "word": "露天風呂", "language_code": "ja", "examples": ["この旅館の露天風呂からは、海の景色が楽しめます。", "冬に雪を見ながら入る露天風呂は格別です。", "山奥の秘湯で、素晴らしい露天風呂を見つけました。"], "description": "A Japanese bath, typically a hot spring (onsen), that is located outdoors. Unlike a regular indoor bath, a 露天風呂 is open to the open air, allowing bathers to enjoy the surrounding natural scenery, such as mountains, forests, or the ocean, while they soak.", "image_description": "A traditional Japanese hot spring bath made of natural rocks, filled with steaming water. The bath is situated in a serene outdoor setting, surrounded by a tranquil forest with autumn-colored maple trees. The scene is peaceful, with no people, emphasizing the bath's connection to nature."}
{"en_translation": "receipt", "word": "領収書", "language_code": "ja", "examples": ["会社の経費で支払うので、領収書をください。 (I'm paying with company expenses, so please give me a formal receipt.)", "この領収書があれば、税金の控除が受けられます。 (With this receipt, you can get a tax deduction.)", "宛名は「株式会社スミス」で領収書をお願いします。 (Please make the receipt out to \"Smith Inc.\")"], "description": "A document that serves as a formal proof of payment, typically requested for business expense reimbursement or official records. It's more formal than a standard cash register slip (レシート) and often includes the payer's name and a formal stamp.", "image_description": "A close-up shot of a hand receiving a formal Japanese receipt from a cashier. The receipt is a crisp, white piece of paper with neat Japanese characters for the date, amount, and item descriptions, along with an official red company stamp (hanko). The focus is entirely on the exchange of this official document."}
{"en_translation": "elevator", "word": "エレベーター", "language_code": "ja", "examples": ["エレベーターで10階に上がります。", "すみません、エレベーターはどこですか？", "この建物にはエレベーターが二つあります。"], "description": "A machine that transports people and goods vertically between the different levels or floors of a building.", "image_description": "A modern elevator with metal doors slightly ajar, revealing a brightly lit, empty interior. Next to the doors, a control panel shows glowing buttons for calling the lift. The scene is simple and focuses solely on the elevator itself."}
{"en_translation": "floor", "word": "階", "language_code": "ja", "examples": ["私のオフィスは3階にあります。", "レストランは何階ですか？"], "description": "A counter for floors or stories in a building. It is always used with a number to indicate a specific level, such as '3階' (san-gai) for the third floor.", "image_description": "An inside view of a modern, clean elevator. The focus is on the button panel, which has buttons for each floor (1階, 2階, 3階, 4階, 5階...). The button for '3階' is illuminated, indicating it has been pressed. The elevator doors are closed."}
{"en_translation": "hotel", "word": "ホテル", "language_code": "ja", "examples": ["旅行の前にホテルを予約しました。", "昨日、駅の近くのホテルに泊まりました。", "このホテルはレストランとプールがあります。"], "description": "A Western-style hotel. A commercial establishment that provides lodging, meals, and other services for travelers and tourists. This is the general term for a hotel, as opposed to a traditional Japanese-style inn (旅館).", "image_description": "A large, modern, multi-story hotel building with many windows. There is a clear sign at the entrance that says 'HOTEL'. A doorman in uniform is standing by the main glass doors, and a guest with a suitcase is seen entering. The building looks clean and professional, clearly identifiable as a place of lodging for travelers."}
{"en_translation": "breakdown/malfunction", "word": "故障", "language_code": "ja", "examples": ["エアコンが故障して、部屋がとても暑いです。", "旅行中に車が故障してしまった。", "ATMが故障しているので、お金をおろせません。"], "description": "This word refers to a situation where a machine, device, or system stops working correctly. It is used to describe a mechanical or electronic failure, often suddenly and causing inconvenience.", "image_description": "A car is stopped on the side of a road with its hood open. Smoke is coming out from the engine. The driver is standing next to the car, looking frustrated and talking on the phone."}
{"en_translation": "smoking", "word": "喫煙", "language_code": "ja", "examples": ["ここは喫煙エリアです。", "レストランの中では喫煙しないでください。", "最近、公共の場所での喫煙が厳しくなりました。"], "description": "The act of inhaling and exhaling the smoke of tobacco. This word is commonly used in signs and official notices to indicate areas where smoking is permitted or to discuss rules and regulations related to smoking.", "image_description": "A close-up of a sign for a designated smoking area in Japan. The sign is modern and clear, featuring a pictogram of a lit cigarette. Below the image, the Japanese word '喫煙' is written in large, bold characters. The scene depicts a designated outdoor space, like next to an office building or at a train station, with a specific standing ashtray visible nearby."}
{"en_translation": "to break", "word": "壊れる", "language_code": "ja", "examples": ["パソコンが壊れたから、新しいのを買わなければならない。", "このおもちゃはすぐに壊れてしまった。", "ドアの取っ手が壊れているので、開けられません。"], "description": "This word means that an object or a machine becomes damaged and stops functioning correctly. It is an intransitive verb, so it describes the state of something breaking on its own, rather than someone actively breaking it. It's commonly used for electronics, furniture, and other man-made objects.", "image_description": "A person is looking with frustration at a laptop that has a cracked screen and is emitting a little smoke from the keyboard. Next to the laptop, a smartphone lies with its screen completely shattered in a spiderweb pattern. The scene clearly depicts electronic devices that are damaged and non-functional."}
{"en_translation": "minshuku", "word": "民宿", "language_code": "ja", "examples": ["田舎に旅行するなら、民宿に泊まるのがおすすめです。", "この民宿の夕食は、地元の食材を使った家庭料理でとても美味しいです。", "夏の旅行のために、海の近くの民宿を予約しました。"], "description": "A type of Japanese-style bed and breakfast or guesthouse. Minshuku are often family-operated, offering a more intimate and traditional experience than a hotel. Guests typically stay in tatami-matted rooms, sleep on futons, and may share meals with the host family, providing a glimpse into ordinary Japanese life.", "image_description": "A traditional Japanese guesthouse with a wooden exterior. An elderly couple, the owners, are bowing politely to welcome a traveler at the entrance. The house has paper screen doors and a tiled roof, conveying a warm, family-run atmosphere. Inside, a simple tatami room with a futon mattress laid out can be seen."}
{"en_translation": "smoking room", "word": "喫煙室", "language_code": "ja", "examples": ["父は空港に着くとすぐに喫煙室を探し始めた。", "このレストランは全席禁煙ですが、地下一階に喫煙室がございます。", "会議の合間に、同僚と喫煙室で少し話した。"], "description": "A designated room or enclosed area within a public space, such as an airport, train station, or office building, where smoking tobacco is permitted. These rooms are specifically created to allow people to smoke without affecting the non-smoking areas of the building.", "image_description": "A modern, clean, glass-walled room inside an airport terminal. Inside the room, a man is sitting on a simple metal bench and smoking a cigarette, with a small cloud of smoke visible. Next to him is a tall, cylindrical, stainless steel ashtray. A sign on the glass door clearly shows a pictogram of a lit cigarette, indicating that smoking is allowed within the enclosed space."}
{"en_translation": "non-smoking room", "word": "禁煙室", "language_code": "ja", "examples": ["禁煙室を予約しましたが、部屋は空いていますか？", "この階はすべて禁煙室となっております。", "チェックインの際に、禁煙室か喫煙室かを選べます。"], "description": "A room, especially in a hotel or other public establishment, where smoking is strictly prohibited. This ensures a clean and smoke-free environment for guests who prefer it.", "image_description": "A hotel room door with a prominent \"no smoking\" sign on it. The sign shows a cigarette inside a red circle with a line through it. The door is slightly open, showing a clean and fresh room inside, with no ashtrays visible."}
{"en_translation": "two nights", "word": "二泊", "language_code": "ja", "examples": ["温泉に二泊したいです。", "京都には二泊三日で旅行しました。"], "description": "A counter used to express a duration of two nights, typically when staying at a hotel, inn, or other lodging. It specifically counts the number of nights spent somewhere.", "image_description": "A calendar is shown with two consecutive days circled. Inside each circle is a simple icon of a moon and stars. Next to the calendar is a packed suitcase and a hotel room key."}
{"en_translation": "extended stay", "word": "延泊", "language_code": "ja", "examples": ["台風で飛行機が飛ばず、もう一泊延泊することにした。", "このホテルがとても気に入ったので、延泊を希望します。", "すみません、チェックアウトの予定でしたが、延泊は可能ですか？"], "description": "The act of prolonging a stay at a hotel or other lodging, adding one or more nights to the original reservation.", "image_description": "A traveler stands at a hotel reception desk, talking to the receptionist. The traveler is smiling and pointing to the next day on a calendar, indicating a desire to stay longer. The receptionist is nodding and typing on a computer, updating the reservation."}
{"en_translation": "air conditioning/cooling", "word": "冷房", "language_code": "ja", "examples": ["暑いので冷房をつけましょうか。", "この部屋は冷房が効きすぎて寒いです。", "夏は冷房がないと生活できません。"], "description": "Refers to a system used to lower the temperature and cool down the air in a room or building, commonly known as air conditioning. It is used during hot weather to make the indoor environment more comfortable.", "image_description": "An indoor air conditioner unit is mounted on a wall, with visible waves of cool air blowing out of it. A person is sitting below, looking up at the unit with a relieved and happy expression, indicating escape from the heat. The overall scene clearly depicts the function of cooling a room."}
{"en_translation": "lodging/accommodation", "word": "宿泊", "language_code": "ja", "examples": ["旅行のために、早めにホテルの宿泊を予約しました。", "この旅館は一泊二食付きで宿泊できます。", "出張の際の宿泊費は会社が負担します。"], "description": "A formal term for the act of staying overnight at a location other than one's own home, such as a hotel, inn, or other paid lodging. It specifically refers to the service of providing a place to sleep for a night.", "image_description": "A traveler with a suitcase stands at the entrance of a traditional Japanese inn (ryokan) at dusk. The inn has a gentle, welcoming glow from paper lanterns by the wooden doorway. The traveler is looking at the entrance, about to check in for an overnight stay."}
{"en_translation": "large communal bath", "word": "大浴場", "language_code": "ja", "examples": ["このホテルの大浴場は最上階にあります。", "旅館に着いたら、まず大浴場で旅の疲れを癒したい。", "大浴場に入る前に、体をきれいに洗ってください。"], "description": "A large, communal bathing area, often found in Japanese inns (ryokan), hotels, or hot spring (onsen) resorts. These facilities have separate sections for men and women and are meant for soaking and relaxing, not for washing with soap inside the main tubs.", "image_description": "A serene and spacious indoor Japanese bathhouse. The large, rectangular bathtub is made of dark slate and filled with steaming, still water. The walls and ceiling are made of light-colored wood, and a large window looks out onto a tranquil bamboo garden, creating a peaceful atmosphere."}
{"en_translation": "dinner/evening meal", "word": "夕食", "language_code": "ja", "examples": ["毎晩、家族みんなで夕食を囲みます。", "今晩の夕食は外で食べませんか。", "ホテルでは豪華な夕食が提供された。"], "description": "The main meal eaten in the evening. It can be used for dinner in general, but sometimes carries a slightly more formal nuance than the more common colloquial term 晩ご飯 (bangohan).", "image_description": "A family is sitting at a dining table, eating a meal together. The window behind them is dark, showing that it is nighttime. On the table are several dishes: a bowl of rice, soup, grilled fish, and vegetables, clearly representing a complete dinner."}
{"en_translation": "change/modification", "word": "変更", "language_code": "ja", "examples": ["急なスケジュール変更で申し訳ありません。", "旅行の計画を変更しました。", "パスワードを変更してください。"], "description": "The act of altering or modifying something that has already been decided or established. This often applies to plans, schedules, rules, documents, or settings, implying a switch from a previous state to a new one.", "image_description": "A person is holding a pen and editing a printed calendar. They are circling a date and drawing an arrow to a new date, clearly showing a change to a pre-existing schedule. The original date is crossed out, emphasizing the alteration."}
{"en_translation": "certainly/understood", "word": "かしこまりました", "language_code": "ja", "examples": ["お客様：「明日の朝7時にモーニングコールをお願いします。」ホテルスタッフ：「かしこまりました。」", "レストランで：「このステーキをミディアムレアでお願いします。」店員：「かしこまりました。」", "上司：「この書類、明日までにコピーしておいてください。」部下：「かしこまりました。」"], "description": "A very polite and formal way of saying \"I understand\" or \"Certainly\". It is primarily used by service staff, such as hotel concierges, high-end restaurant waiters, or shop assistants, when acknowledging a customer's request or order. It conveys a high level of respect and a clear confirmation that the request will be fulfilled exactly as asked.", "image_description": "A hotel concierge in a sharp, professional uniform is standing behind a grand, polished wooden reception desk. They are bowing deeply and respectfully to a guest who is speaking to them. The concierge's expression is one of polite attentiveness, clearly acknowledging the guest's request. The background is a luxurious hotel lobby."}
{"en_translation": "to be broken", "word": "壊れる", "language_code": "ja", "examples": ["パソコンが壊れたので、新しいのを買わなければなりません。", "エアコンが壊れて、部屋がとても暑いです。", "この古い時計はすぐに壊れてしまった。"], "description": "This word describes the state of something being broken, damaged, or out of order, particularly for machines, electronics, or other objects that have ceased to function correctly. It is an intransitive verb, meaning it focuses on the state of the object itself rather than the action of breaking it.", "image_description": "A laptop computer on a desk with a cracked screen. The screen displays a blue error message with a sad face icon, and a little bit of smoke is coming from the keyboard, indicating a serious malfunction."}
{"en_translation": "Wi-Fi", "word": "Wi-Fi", "language_code": "ja", "examples": ["ここのカフェは無料のワイファイがありますか？", "ワイファイの接続が遅くて、ビデオが見られない。", "すみません、ワイファイのパスワードを教えていただけますか？"], "description": "A system for connecting computers, smartphones, and other devices to the internet without using wires. It's a common feature in homes, offices, cafes, and public spaces.", "image_description": "A person is sitting at a coffee shop table with a laptop open. A glowing Wi-Fi symbol hovers in the air above the laptop, with visible, gentle arcs of light connecting the symbol to the laptop and a wireless router sitting on a counter in the background. The scene is focused on the laptop and the symbol of connectivity."}
{"en_translation": "to call", "word": "呼ぶ", "language_code": "ja", "examples": ["道で友達の名前を呼んだ。", "タクシーを呼びましょうか？", "後で電話で呼びます。"], "description": "The verb '呼ぶ' means 'to call' in several senses. It can be used when you call out to someone to get their attention, like shouting their name across a street. It's also used when you summon something or someone, such as calling a taxi or calling a doctor. Additionally, it can refer to calling someone on the telephone.", "image_description": "A person is standing on the curb of a city street, with their arm raised high to hail an approaching taxi. Their mouth is open as if they are shouting to get the driver's attention. The scene clearly depicts the action of summoning or 'calling' a vehicle."}
{"en_translation": "way to get there/directions", "word": "行き方", "language_code": "ja", "examples": ["すみません、駅までの行き方を教えていただけますか？", "一番簡単な行き方は、この道をまっすぐ行くことです。", "そこへの行き方はバスと電車、二つあります。"], "description": "Refers to the method or route for getting to a destination. It can be used to ask for directions, or to explain the way to travel, including which paths to take or what transportation to use.", "image_description": "A person stands at a fork in the road, looking at a large wooden signpost with multiple arrows pointing in different directions. Each arrow has a symbol, like a train, a bus, or a building. The person is studying the signpost, trying to figure out the best way to their destination, which is visible in the distance down one of the paths."}
{"en_translation": "I'm very sorry", "word": "申し訳ございません", "language_code": "ja", "examples": ["お客様にご迷惑をおかけし、大変申し訳ございませんでした。", "会議に遅れてしまい、誠に申し訳ございません。", "こちらのミスで、申し訳ございません。すぐに対応いたします。"], "description": "An extremely polite and formal apology, often used in business or official settings. It conveys a deep sense of regret for a mistake or inconvenience caused, and is more formal than 'sumimasen' or 'gomenasai'. It's appropriate when apologizing to customers, superiors, or in any situation that demands a high level of politeness.", "image_description": "A Japanese office worker in a business suit is performing a deep, 90-degree bow to a client. The office worker has a look of sincere regret on their face, showing they are making a very formal and serious apology. The scene takes place in a professional office environment."}
{"en_translation": "airport", "word": "空港", "language_code": "ja", "examples": ["出発の2時間前には空港に着くようにしてください。", "友達を迎えに空港へ行きます。", "このバスは空港まで行きますか？"], "description": "A place where airplanes regularly take off and land, with buildings for passengers to wait in, and for aircraft to be maintained. It serves as a hub for both domestic and international air travel.", "image_description": "A wide shot of an airport scene. In the foreground, a large passenger airplane is parked on the tarmac next to a modern terminal building with large glass windows. In the background, another plane can be seen taking off from a runway, with the control tower visible in the distance."}
{"en_translation": "to hold/keep", "word": "預かる", "language_code": "ja", "examples": ["旅行に行く友達のスーツケースを預かっています。", "すみません、この子を少しの間、預かっていただけませんか。", "フロントで貴重品を預かることができます。"], "description": "To take responsibility for and look after something or someone for a period of time on behalf of the owner. This implies a sense of trust and safekeeping, where the item or person will be returned later. It's different from simply holding an object for a moment; it's about being entrusted with its care.", "image_description": "A smiling hotel receptionist stands behind a front desk. A guest is handing their large suitcase over the counter to the receptionist. The receptionist is reaching out to take the suitcase, indicating they will keep it safe. There is a key rack on the wall behind the receptionist, reinforcing the idea of a temporary stay and safekeeping."}
{"en_translation": "welcome", "word": "いらっしゃいませ", "language_code": "ja", "examples": ["レストランのドアが開くと、店員が「いらっしゃいませ！」と明るく声をかけた。", "デパートの入り口で、案内係がお客様に「いらっしゃいませ」と丁寧に言った。", "「いらっしゃいませ、何かお探しですか？」と店員に聞かれた。"], "description": "A polite and formal set phrase used by employees in the service industry to welcome customers into an establishment such as a store, restaurant, or hotel. It is not used to welcome someone into your home.", "image_description": "A customer is stepping into a cozy Japanese ramen shop. A shopkeeper in an apron and headband is smiling warmly and bowing slightly from behind the counter, with a welcoming gesture. The shop has wooden decor, and Japanese lanterns are visible."}
{"en_translation": "twin", "word": "ツイン", "language_code": "ja", "examples": ["ホテルでツインを予約しました。", "ツインは空いていますか？", "部屋はツインで、ベッドが二つあります。"], "description": "Refers to a 'twin room,' a hotel room designed for two people, featuring two separate single beds.", "image_description": "A hotel room with two identical single beds, neatly made. The beds are separated by a small nightstand in the middle. The room is simple and clean, with no people, focusing entirely on the two-bed setup."}
{"en_translation": "single", "word": "シングル", "language_code": "ja", "examples": ["シングルを一つ予約したいのですが。", "この部屋はシングルですか、ダブルですか。", "出張中はいつも駅の近くのホテルのシングルに泊まります。"], "description": "Refers to a 'single room' in a hotel or other accommodation, which is designed for one person and typically contains one single bed.", "image_description": "A small, tidy hotel room with one single bed neatly made. Next to the bed is a small nightstand with a lamp. A single suitcase rests on a luggage rack at the foot of the bed."}
{"en_translation": "counter for nights stayed", "word": "泊", "language_code": "ja", "examples": ["温泉旅館に一泊したいです。", "このホテルは何泊のご予約ですか？", "出張で大阪に二泊三日します。"], "description": "The Japanese counter for counting nights of a stay, typically at a hotel, inn, or someone's home. It is appended to a number to indicate the duration of the stay in nights, such as 一泊 (ippaku) for one night, or 三泊 (sanpaku) for three nights.", "image_description": "A calendar is open on a desk next to a hotel room key. On the calendar, two consecutive days are circled, and a small moon icon is drawn on each night, indicating a two-night stay. A hand is pointing to the second circled day."}
{"en_translation": "double", "word": "ダブル", "language_code": "ja", "examples": ["ホテルを予約する時、ダブルの部屋を頼みました。", "このホテルにはダブルの部屋はありますか？", "チェックインの時、ダブルかツインか聞かれました。"], "description": "In the context of accommodation, this refers to a 'double room'—a hotel room with one large bed designed for two people. It can also refer to the double bed itself.", "image_description": "A bright and tidy hotel room with a large, neatly made double bed as the central focus. The bed has two pillows, clearly indicating it is meant for two people. A window next to the bed shows a pleasant city view, and a simple nightstand with a lamp stands beside it. The overall scene is clean and inviting."}
{"en_translation": "itemized bill", "word": "明細書", "language_code": "ja", "examples": ["ホテルのフロントで明細書をもらいました。", "経費精算のために、クレジットカードの明細書を提出してください。", "サービス料金の明細書をお送りいただけますか？"], "description": "A detailed breakdown of transactions, charges, or services rendered, showing each individual item and its cost. It is a formal document, often provided by companies, stores, or service providers, to give a clear and transparent account of the total amount billed.", "image_description": "A close-up view of a long paper document with the title \"明細書\" clearly visible at the top. Below the title, there's a neat list of various expenses, each with a corresponding price, such as hotel room charges, room service, and phone calls. The list of items culminates in a final total at the bottom, which a person is pointing to with their finger."}
{"en_translation": "staff", "word": "スタッフ", "language_code": "ja", "examples": ["ホテルのスタッフが荷物を部屋まで運んでくれました。", "この店のスタッフはみんな親切です。", "イベントのスタッフを募集しています。"], "description": "Refers to the employees or personnel of a business or organization, such as a shop, hotel, or event. It's a general term for the people who work there, often in customer-facing roles.", "image_description": "A group of three hotel employees stands behind a modern reception desk. They are all wearing matching professional uniforms with name tags. One staff member is smiling and talking on the phone, another is typing on a computer, and the third is politely handing a keycard to a guest whose hand is just visible. The focus is clearly on the coordinated team of employees."}
{"en_translation": "lobby", "word": "ロビー", "language_code": "ja", "examples": ["ホテルのロビーで待ち合わせましょう。", "会社のロビーで受付を済ませてください。", "コンサートホールのロビーは、開演前はいつも混雑している。"], "description": "A large, open entrance area in a building such as a hotel, theater, or office, often with seating and a reception desk. It's a common place for people to wait, meet, or check in before proceeding further into the building.", "image_description": "A bright and spacious hotel lobby with a polished floor. In the background, there is a long, modern reception desk. In the center of the room, there are a few comfortable armchairs and a small coffee table where a person is sitting and looking at their phone. The large glass entrance doors are visible on one side."}
{"en_translation": "passport", "word": "パスポート", "language_code": "ja", "examples": ["空港のチェックインカウンターでパスポートを提示してください。", "海外旅行の前に、パスポートの有効期限を確認しました。", "新しいパスポートを申請するために市役所に行きました。"], "description": "An official document issued by a government, certifying the holder's identity and citizenship and entitling them to travel under its protection to and from foreign countries. It is essential for international travel and is typically required at airport check-in and immigration.", "image_description": "A close-up shot of a passport, open to the identification page. The page clearly displays a person's photograph, name, and other biographical details. The passport is the central focus of the image, with a simple and uncluttered background, suggesting the context of travel or official documentation."}
{"en_translation": "to work/move", "word": "動く", "language_code": "ja", "examples": ["この古い時計はまだちゃんと動く。", "パソコンが動かなくなったので、修理に出した。", "このアプリはどのスマートフォンでも動きますか？"], "description": "This verb is used to describe a machine, device, or system that is functioning or operating correctly. It implies that something is not broken and is performing its intended task. It's the equivalent of saying something 'works' or 'is running'.", "image_description": "A classic, slightly old-fashioned clock with visible gears and cogs turning smoothly and correctly. The hands of the clock are pointing to a specific time, indicating it is actively functioning. The overall image should convey a sense of precision and reliable operation."}
{"en_translation": "minibar", "word": "ミニバー", "language_code": "ja", "examples": ["ホテルの部屋に着いたら、まずミニバーに何があるか確認します。", "ミニバーのビールは高いから、近くのコンビニで買おう。", "このホテルのミニバーは、品揃えが豊富で嬉しい。"], "description": "ホテルの部屋に置かれている、飲み物や軽食が入った小型の冷蔵庫。中の飲み物や食べ物は有料の場合が多いです。", "image_description": "ホテルの客室の片隅に、木製キャビネットに収められた小さな冷蔵庫が設置されている。冷蔵庫の扉は少し開いており、中には小さなジュースのボトル、缶ビール、ミネラルウォーターが整然と並んでいる。冷蔵庫の上には、小さなスナック菓子と料金表が置かれている。"}
{"en_translation": "to change", "word": "変える", "language_code": "ja", "examples": ["旅行の計画を変えなければなりません。", "古いコンピューターを新しいのに変えた。", "髪型を変えたら、気分も変わった。"], "description": "This refers to the action of replacing an object or a situation with a different one. It implies a substitution or alteration, like swapping one item for another or changing a plan.", "image_description": "A person is standing in front of two doors. They are turning the handle of the right door, which is blue, while the left door, which is red, remains closed. This represents making a choice to change from one option to another."}
{"en_translation": "to deposit/check", "word": "預ける", "language_code": "ja", "examples": ["銀行にお金を預ける。", "旅行の間、友達に犬を預けた。", "ホテルのフロントに荷物を預かってもらえますか？"], "description": "Refers to the action of temporarily entrusting an item, person, or animal to someone else's care for safekeeping. This can be used in various situations such as depositing money in a bank, checking luggage at a hotel or airport, or leaving a pet with a friend.", "image_description": "A person at a hotel reception desk is handing their suitcase over to the smiling concierge. The concierge is reaching out to take the suitcase. In the background, there's a wall with key slots, indicating it's a hotel lobby."}
{"en_translation": "to stay overnight", "word": "泊まる", "language_code": "ja", "examples": ["京都のホテルに泊まります。", "今夜、あなたの家に泊まってもいいですか？", "旅行する時、よく旅館に泊まります。"], "description": "Refers to the act of lodging or staying overnight at a place that is not one's own home, such as a hotel, inn (ryokan), or a friend's house. It implies a temporary stay for one or more nights, often while traveling or away from home.", "image_description": "A traveler has just arrived in their hotel room for the night. Their suitcase is open on the floor next to a neatly made bed, and they are placing their toiletries on the nightstand. The large window behind them shows a dark night sky with a crescent moon, indicating it's time to settle in and rest."}
{"en_translation": "room number", "word": "号室", "language_code": "ja", "examples": ["私の部屋は305号室です。", "会議は10号室で行われます。", "すみません、201号室はどこですか？"], "description": "The suffix '号室' is a counter used after a number to specify a particular room number in buildings like hotels, apartments, hospitals, or schools. It attaches directly to the numeral, so 'Room 101' becomes '101号室'.", "image_description": "A close-up of a hotel room door. A silver-colored plaque is affixed to the wooden door, and on the plaque, the number '404' is clearly displayed, followed immediately by the Japanese characters '号室'. The background is slightly blurred, focusing attention on the room number plaque."}
{"en_translation": "to fix/repair", "word": "直す", "language_code": "ja", "examples": ["父が自転車のパンクを直してくれた。", "壊れたパソコンを直すのに一週間かかった。", "この文章の間違いを直してください。"], "description": "To restore something that is broken, damaged, or not functioning correctly to its original, proper, or usable state. It implies returning an object or situation to the way it should be.", "image_description": "A person is carefully using a screwdriver to fix the inner workings of a broken camera on a workbench. Various small tools and parts are laid out neatly beside the camera. The person's expression is one of concentration, clearly showing the process of repair."}
{"en_translation": "counter for nights", "word": "泊", "language_code": "ja", "examples": ["京都のホテルに二泊しました。", "何泊のご予定ですか？", "大阪に一泊二日で旅行に行きました。"], "description": "The counter for the number of nights of a stay. It is commonly used when booking accommodation or talking about the duration of a trip. For example, '一泊' (ippaku) means one night, and '二泊' (nihaku) means two nights.", "image_description": "A person at a hotel reception desk is checking out. On the counter, a calendar is visible with two consecutive nights clearly marked with moon icons, indicating a two-night stay. The person is holding their luggage and has a satisfied expression."}
