{"en_translation": "notebook", "word": "ノート", "language_code": "ja", "examples": ["授業の内容をノートにまとめました。", "新しいノートを３冊買いました。", "彼はいつもノートとペンを持ち歩いている。"], "description": "A book with blank or lined pages, used for writing things down, such as lecture notes, meeting minutes, or personal thoughts. It's a common stationery item for students and professionals.", "image_description": "A single, spiral-bound notebook is open on a wooden table. A black pen is resting on the right-hand page, where a few lines of Japanese text are neatly written. The notebook is the main focus, with the background being simple and uncluttered to avoid distractions.", "image_file": "notebook.jpg"}
{"en_translation": "textbook", "word": "教科書", "language_code": "ja", "examples": ["新しい学期の前に、すべての教科書を買わなければなりません。", "歴史の教科書を読んで、昔の出来事について学びました。", "先生は教科書の３５ページを開くように言いました。"], "description": "A standard book used in schools for a particular subject. It contains the information that students need to learn for a specific course or academic subject.", "image_description": "A single, thick textbook is lying open in the center of a clean, wooden desk. The cover, visible on one side, has the Japanese characters 「日本語」 (Japanese language) printed on it. The open pages show Japanese text and a few small, colorful illustrations. The background is simple and out of focus, highlighting the textbook as the main object of study.", "image_file": "textbook.jpg"}
{"en_translation": "pen", "word": "ペン", "language_code": "ja", "examples": ["この書類にサインをするために、ペンが必要です。", "彼は先生から赤のペンを借りました。", "すみません、ペンを貸していただけますか？"], "description": "A common writing tool that uses ink to leave a mark on a surface, typically paper. It consists of a point that dispenses the ink and a body that is held for writing. Pens are used for a wide variety of tasks, such as taking notes, signing documents, and drawing.", "image_description": "A close-up of a hand holding a simple blue ballpoint pen, poised to write on a clean, white sheet of paper. The pen's tip is just touching the paper, having drawn a single, straight line of blue ink. The background is minimal and out of focus, emphasizing the action of writing with the pen.", "image_file": "pen.jpg"}
{"en_translation": "pencil", "word": "鉛筆", "language_code": "ja", "examples": ["この鉛筆はとても書きやすいです。", "試験のために、新しい鉛筆を二本買いました。", "彼女は鉛筆で美しい絵を描いた。"], "description": "A writing instrument consisting of a thin stick of graphite, enclosed in a wooden case. It is used for writing or drawing, and its marks can be easily erased.", "image_description": "A single, yellow wooden pencil with a pink eraser on the end. The pencil is sharpened to a fine point, showing the dark graphite tip. The object is centered against a plain, neutral background, with no other objects present.", "image_file": "pencil.jpg"}
{"en_translation": "eraser", "word": "消しゴム", "language_code": "ja", "examples": ["鉛筆で書いたので、消しゴムで消せます。", "すみません、消しゴムを貸してもらえませんか？", "新しい消しゴムを買ったばかりなのに、もうどこかへ行ってしまった。"], "description": "A common stationery item, typically a small block of rubber or a similar material, used for removing pencil marks from paper by rubbing them away.", "image_description": "A standard pink rectangular eraser is shown in the middle of a piece of white paper. The eraser is actively rubbing out a hand-drawn pencil line, with small rubber shavings visible next to it. The background is a simple, out-of-focus wooden desk surface.", "image_file": "eraser.jpg"}
{"en_translation": "ruler", "word": "定規", "language_code": "ja", "examples": ["この線をまっすぐ引くために定規を使いましょう。", "机の長さを定規で測ってください。", "筆箱に定規が一本入っています。"], "description": "A tool used for measuring distances or for drawing straight lines. It is a common stationery item found in schools and offices, typically made of plastic or metal with markings for centimeters or inches.", "image_description": "A clear, straight ruler is lying on a plain white desk next to a pencil. The ruler has clear markings for centimeters and millimeters. A straight pencil line has been drawn halfway alongside the ruler's edge, demonstrating its function for drawing straight lines.", "image_file": "ruler.jpg"}
{"en_translation": "class/lesson", "word": "授業", "language_code": "ja", "examples": ["今日の授業は面白かったです。", "明日の数学の授業の準備をします。", "授業に遅れないように、早く家を出ました。"], "description": "A structured period of instruction, typically in a school or university setting, where a teacher imparts knowledge to students. It refers to the actual session of teaching and learning, such as a lecture or a classroom lesson.", "image_description": "A teacher stands in front of a classroom, pointing to a whiteboard filled with notes and diagrams. Several students are sitting at their desks, looking towards the teacher and attentively taking notes in their notebooks. The scene captures a focused learning environment during a formal lesson.", "image_file": "class_lesson.jpg"}
{"en_translation": "class", "word": "クラス", "language_code": "ja", "examples": ["私のクラスは３０人です。", "次のクラスは数学です。", "彼はクラスで一番背が高い。"], "description": "Refers to a 'class' in an educational context. This can mean a group of students who are taught together (e.g., 'Class 3-A') or a specific course or lesson (e.g., 'a Japanese class').", "image_description": "A bright, modern classroom with a teacher at the front pointing to a whiteboard with Japanese writing on it. Several diverse students are sitting at desks, looking attentively towards the teacher. The scene clearly depicts a focused, educational environment like a language or academic class taking place.", "image_file": "class.jpg"}
{"en_translation": "teacher", "word": "先生", "language_code": "ja", "examples": ["先生、質問があります。", "田中先生は親切で、分かりやすく教えてくれます。", "私の日本語の先生は、とても熱心な方です。"], "description": "A respectful term for a teacher or instructor in an educational setting. It can be used as a standalone title when addressing a teacher directly, or attached to their surname. This title conveys respect for their knowledge and position.", "image_description": "A friendly Japanese teacher stands in a classroom in front of a whiteboard. The teacher is pointing to Japanese characters written on the board, actively engaged in the act of teaching. The scene is bright and clearly focused on the teacher as a figure of knowledge and instruction.", "image_file": "teacher.jpg"}
{"en_translation": "student", "word": "学生", "language_code": "ja", "examples": ["あの学生は毎日図書館で勉強しています。", "私の兄は大学生です。", "学生割引はありますか？"], "description": "A person who is enrolled at an educational institution, such as a school, college, or university, to learn. While it can refer to students of all levels, it is most commonly used in the context of higher education, like a university student.", "image_description": "A young adult is sitting at a desk in a modern, bright university library, surrounded by bookshelves. The person is focused on an open textbook and is writing notes in a notebook. Their backpack is on the floor next to the chair.", "image_file": "student.jpg"}
{"en_translation": "student", "word": "生徒", "language_code": "ja", "examples": ["このクラスの生徒はみんな熱心です。", "先生は生徒たちに質問をしました。", "多くの生徒がその大学への進学を希望している。"], "description": "Refers to a student, particularly at the junior high school or high school level. While it can sometimes be used for elementary students, it is most commonly associated with secondary education. It is distinct from '学生' (gakusei), which is typically used for university or college students.", "image_description": "Several Japanese high school students in school uniforms are sitting at their desks in a classroom. They are looking towards the front of the room, listening attentively to a lesson. One student has their hand raised, ready to ask a question. The focus is on the students as learners in a school environment.", "image_file": "student.jpg"}
{"en_translation": "homework", "word": "宿題", "language_code": "ja", "examples": ["今日の宿題は、漢字の練習です。", "夏休みの宿題が多すぎて、終わりません。", "すみません、宿題を家に忘れました。"], "description": "Academic assignments given by a teacher to be completed outside of class, usually at home. This is a regular part of studying for students.", "image_description": "A student is sitting at a wooden desk in their bedroom, focused on writing in a notebook. The desk has a stack of textbooks, a pencil case, and a lit desk lamp, indicating they are studying in the evening. The scene should convey a sense of diligent study at home.", "image_file": "homework.jpg"}
{"en_translation": "test", "word": "テスト", "language_code": "ja", "examples": ["明日は数学のテストがあります。", "このテストはとても難しかったです。", "JLPTのテストを受ける予定です。"], "description": "A task or examination designed to assess a person's knowledge, skills, or performance in a particular subject or activity. It is a general term often used in academic settings, like a school quiz or a final exam.", "image_description": "A student is sitting at a wooden school desk, focused intently on a test paper in front of them. They are holding a pencil to their chin, looking thoughtful as they read the questions. The classroom setting is bright, but the focus is on the single student and the challenge of the exam paper.", "image_file": "test.jpg"}
{"en_translation": "exam", "word": "試験", "language_code": "ja", "examples": ["明日の試験のために、今夜は徹夜で勉強するつもりだ。", "大学入学試験は、多くの学生にとって人生の大きな挑戦です。", "彼は司法試験に合格するために、何年も努力を続けた。"], "description": "A formal test of a person's knowledge or proficiency in a particular subject or skill, often conducted in an academic or professional setting. It can refer to a written, oral, or practical test.", "image_description": "A single student is sitting at a wooden desk in a well-lit, quiet classroom, focused intently on a test paper in front of them. The student is holding a pen, poised to write. Other students can be seen in the blurred background, all diligently working on their own exams, creating a tense and studious atmosphere.", "image_file": "exam.jpg"}
{"en_translation": "review", "word": "復習", "language_code": "ja", "examples": ["明日の試験のために、復習をしなければならない。", "授業の復習を毎日します。", "この文法、復習しましたか？"], "description": "The act of going over material that has already been learned in order to reinforce one's memory and understanding. It is a key part of the learning process, especially in academic contexts, to ensure that knowledge is retained.", "image_description": "A student is sitting at a desk, looking at a textbook and a notebook. The notebook is filled with handwritten notes. The student is pointing at a diagram in the textbook with a pencil, and then looking at their own notes, appearing to be confirming their understanding of material they've already studied.", "image_file": "review.jpg"}
{"en_translation": "preparation/preview", "word": "予習", "language_code": "ja", "examples": ["明日の授業のために、教科書の次の章を予習しておきましょう。", "予習をしっかりしたので、先生の質問に自信を持って答えることができた。", "新しい単語を予習しておくと、授業がもっと分かりやすくなりますよ。"], "description": "To prepare for a lesson in advance. It refers to the act of studying material that will be covered in an upcoming class, so you are familiar with it before the teacher explains it. This is the opposite of 復習 (fukushuu), which means to review material that has already been taught.", "image_description": "A student is sitting at a desk in their bedroom. The desk is neat, with an open textbook, a notebook, and a pen. The student is looking at the textbook and taking notes, preparing for a future class. A calendar on the wall has a circle around 'tomorrow's lesson'.", "image_file": "preparation_preview.jpg"}
{"en_translation": "question", "word": "質問", "language_code": "ja", "examples": ["何か質問はありますか？", "先生に質問があります。", "この問題について質問してもいいですか？"], "description": "A question or inquiry made to seek information, clarification, or an answer. It can be used in both formal and informal contexts when you want to ask about something.", "image_description": "A person is raising their hand, with a thoughtful and curious expression on their face. Above their head, a large, bright question mark hovers in the air, clearly symbolizing the act of asking a question. The background is simple and slightly out of focus to emphasize the person and the question mark.", "image_file": "question.jpg"}
{"en_translation": "answer", "word": "答え", "language_code": "ja", "examples": ["先生の質問の答えが分かりません。", "テストの答えを全部書きました。", "その問題の答えは簡単ではない。"], "description": "The information, solution, or conclusion given in response to a question, problem, or inquiry. It specifically refers to the resolution that is sought.", "image_description": "A student sits at a wooden desk, viewed from a slightly elevated angle. On the desk is a clean white piece of paper with the simple math question '2 + 2 = ?' written in black ink. The student's hand is holding a pencil and has just finished writing a large, clear number '4' next to the equals sign. A subtle, warm glow emanates from the number '4', highlighting it as the correct answer.", "image_file": "answer.jpg"}
{"en_translation": "blackboard/chalkboard", "word": "黒板", "language_code": "ja", "examples": ["先生が黒板に漢字を書いている。", "すみません、黒板の字が小さくて読めません。", "日直の仕事は、授業の後に黒板をきれいにすることです。"], "description": "A smooth, hard, dark-colored surface, typically found in a classroom, made of slate or a similar material. It is designed to be written or drawn on with sticks of chalk.", "image_description": "A large, dark green chalkboard is mounted on a classroom wall. A teacher is in the middle of writing Japanese characters on it with a piece of white chalk. There is a wooden tray at the bottom of the chalkboard holding an eraser and several pieces of chalk.", "image_file": "blackboard_chalkboard.jpg"}
{"en_translation": "desk", "word": "机", "language_code": "ja", "examples": ["私の部屋に新しい机があります。", "彼は仕事の書類を机の上に広げた。", "毎日この机で日本語を勉強します。"], "description": "A piece of furniture with a flat tabletop and one or more legs, used as a workspace for activities such as reading, writing, or using a computer. It is commonly found in offices, schools, and homes.", "image_description": "A simple wooden desk is positioned in the center. On its surface, there's an open laptop, a notebook with a pen resting on it, and a single coffee mug. A simple chair is tucked in front of it. The background is a plain, light-colored wall, ensuring the focus remains on the desk.", "image_file": "desk.jpg"}
{"en_translation": "chair", "word": "椅子", "language_code": "ja", "examples": ["この椅子はとても快適です。", "部屋に椅子がいくつありますか？", "彼は椅子に座って本を読んでいた。"], "description": "A piece of furniture designed for one person to sit on, consisting of a seat, a back, and typically four legs for support. It is a common item found in homes, offices, and various other settings.", "image_description": "A simple wooden chair stands in the center of a brightly lit, minimalist room. The chair has a straight back, a flat seat, and four sturdy legs. There are no other objects in the room, focusing all attention on the chair itself.", "image_file": "chair.jpg"}
{"en_translation": "dictionary", "word": "辞書", "language_code": "ja", "examples": ["この言葉の意味が分からないので、辞書で調べましょう。", "新しい日本語の辞書を買いました。", "電子辞書はとても便利です。"], "description": "A book or electronic device that lists words of a language in alphabetical order and gives their meaning, or gives the equivalent words in a different language. It is used to look up word definitions, check spelling, and find synonyms or translations.", "image_description": "A thick, hard-cover Japanese dictionary is open on a clean, light-colored wooden desk. The pages are filled with Japanese characters and their definitions. A pair of reading glasses is resting on top of the open pages, with one of the lenses magnifying a single Japanese word and its entry. The scene is brightly lit and focused solely on the dictionary.", "image_file": "dictionary.jpg"}
{"en_translation": "book", "word": "本", "language_code": "ja", "examples": ["この本はとても面白いです。", "図書館で本を借りました。", "机の上に本が三冊あります。"], "description": "A collection of written or printed sheets of paper bound together, typically between two covers. It contains text, images, or a combination of both, intended for reading or reference.", "image_description": "A single, hardcover book is standing upright on a plain, light-colored surface. The book is closed, showing its spine and front cover. The cover is a solid, neutral color with no text or distracting images, to keep the focus purely on the object as a 'book'. The lighting is bright and even, casting a soft, subtle shadow.", "image_file": "book.jpg"}
{"en_translation": "grammar", "word": "文法", "language_code": "ja", "examples": ["日本語の文法は、勉強すればするほど面白くなります。", "この文が文法的に正しいかどうか、確認してください。", "先生は新しい文法のポイントを説明しました。"], "description": "The system of rules that governs how words are combined to form meaningful sentences. This includes aspects like word order, verb conjugations, and particle usage, providing the structural foundation of the language.", "image_description": "An intricate blueprint of a sentence is laid out on a drafting table. Various parts of speech like nouns, verbs, and particles are shown as interconnected building blocks, forming a complex structure. A large heading at the top of the blueprint clearly reads \"文法\".", "image_file": "grammar.jpg"}
{"en_translation": "word/vocabulary", "word": "単語", "language_code": "ja", "examples": ["この単語の意味を教えてください。", "毎日新しい単語を五つ覚えるようにしています。", "この本は難しい単語が多いです。"], "description": "A single unit of language that has a meaning and can be used to form sentences. It refers to an individual word, such as one you would find in a dictionary or a vocabulary list.", "image_description": "A Japanese dictionary is open on a table. A magnifying glass is held over the page, focusing and enlarging a single Japanese word, '単語', making it stand out clearly from the other text on the page. The surrounding text is slightly blurred to emphasize the focus on this one word.", "image_file": "word_vocabulary.jpg"}
{"en_translation": "kanji", "word": "漢字", "language_code": "ja", "examples": ["この漢字の書き方を教えてください。", "日本の小学校では、約1000の漢字を学びます。", "「愛」という漢字は「love」という意味です。"], "description": "Kanji are logographic characters originating from China that are used in the modern Japanese writing system, along with hiragana and katakana. They are used to write nouns, stems of adjectives and verbs, and Japanese names.", "image_description": "A large, singular Japanese kanji character, specifically the character for 'learning' (学), is meticulously painted in bold, black ink on a sheet of traditional white washi paper. An ink brush is resting beside the paper, its tip still wet with ink. The background is a simple, neutral, slightly out-of-focus wooden surface.", "image_file": "kanji.jpg"}
{"en_translation": "hiragana", "word": "ひらがな", "language_code": "ja", "examples": ["子どもはひらがなを読んでいます。", "この本はひらがなが多いので、読みやすいです。", "漢字の読み方をひらがなで書きます。"], "description": "ひらがな is one of the three Japanese writing systems, along with katakana and kanji. It is a syllabary, meaning each character represents a syllable (e.g., 'ka', 'ki', 'ku'). Hiragana characters have a distinctively rounded, cursive appearance and are used for native Japanese words, grammatical particles, verb and adjective endings, and for writing out the pronunciation of kanji (known as furigana).", "image_description": "A close-up of a Japanese child's notebook filled with carefully practiced hiragana characters. The characters are large, rounded, and written in pencil on grid paper. In the foreground, a single wooden block with the character 'あ' (a) is resting on the page, creating a clear and simple focus on the writing system itself.", "image_file": "hiragana.jpg"}
{"en_translation": "katakana", "word": "カタカナ", "language_code": "ja", "examples": ["あなたの名前をカタカナで書いてください。", "「パン」はポルトガル語から来たカタカナの言葉です。", "メニューはカタカナでいっぱいだった。"], "description": "Katakana is one of the three Japanese scripts, alongside hiragana and kanji. It is characterized by its short, straight strokes and angular corners. Katakana is primarily used to write words of foreign origin (e.g., コンピューター for \"computer\"), foreign names and places, onomatopoeia (sound-imitating words), and for emphasis, much like italics are used in English.", "image_description": "A Japanese textbook page is open. On the page, there are several pictures of foreign items like a bus, a cup of coffee, and a computer. Next to each picture, the corresponding word is written in the angular, distinct script of Katakana (バス, コーヒー, コンピューター).", "image_file": "katakana.jpg"}
{"en_translation": "meaning", "word": "意味", "language_code": "ja", "examples": ["この言葉の意味が分かりません。", "彼の言葉の本当の意味を考えてみた。", "人生の意味とは何だろうか。"], "description": "Refers to the significance or concept that a word, phrase, or sign is intended to convey. It is the underlying idea or message that is meant to be understood when communicating.", "image_description": "A person is looking at a single Japanese kanji character on a flashcard. An arrow is drawn from the kanji to a simple, clear illustration of a lightbulb that is brightly lit, symbolizing the understanding of the character's meaning. The background is neutral and out of focus.", "image_file": "meaning.jpg"}
{"en_translation": "explanation", "word": "説明", "language_code": "ja", "examples": ["先生の説明は分かりやすかったです。", "これについて説明してください。", "計画について説明します。"], "description": "The act of making something clear or easy to understand by describing it in more detail, providing relevant facts, or revealing underlying reasons or causes.", "image_description": "A teacher pointing at a whiteboard filled with diagrams and notes. They are looking towards a student who is sitting at a desk, listening intently with a thoughtful expression. The scene captures the moment of a clear and detailed explanation being given.", "image_file": "explanation.jpg"}
{"en_translation": "example sentence", "word": "例文", "language_code": "ja", "examples": ["この単語の使い方が分からないので、例文を教えてください。", "教科書の例文を暗記して、単語の正しい使い方を学びます。", "先生は新しい文法を説明するために、いくつかの例文を黒板に書いた。"], "description": "An example sentence used to demonstrate the usage or meaning of a word or grammar point. It serves as a model to show how something is correctly used in context.", "image_description": "A Japanese textbook is open on a wooden desk. A single line of Japanese text is highlighted in bright yellow, clearly marked as an 'example sentence'. A stylized magnifying glass is positioned over the highlighted sentence, emphasizing it and showing its role in clarifying meaning. The surrounding text on the page is slightly out of focus.", "image_file": "example_sentence.jpg"}
{"en_translation": "reading/pronunciation", "word": "読み方", "language_code": "ja", "examples": ["この漢字の読み方を教えてください。", "お名前の読み方は何ですか？", "この単語は読み方がとても難しいです。"], "description": "Refers to the correct way to pronounce a word or read a character, especially for Japanese Kanji which can have multiple readings. It's the term you use when asking for or explaining the pronunciation of something, from a single character to a person's name.", "image_description": "A person is pointing at a complex Japanese kanji in a book. Above the kanji, small phonetic hiragana characters (known as furigana) are written, visually showing the pronunciation. The focus is tight on the kanji and the furigana, with the background blurred.", "image_file": "reading_pronunciation.jpg"}
{"en_translation": "practice", "word": "練習", "language_code": "ja", "examples": ["毎日ピアノの練習をしています。", "サッカーの試合の前に、チームは厳しい練習をしました。", "もっと話す練習をしないと、日本語が上手になりませんよ。"], "description": "The act of repeatedly performing an action or skill in order to improve proficiency. This can refer to sports, musical instruments, language learning, or any other activity that requires repeated effort to master.", "image_description": "A young person sits at a piano, focused on practicing a piece of music. Their hands are on the keys, and their gaze is fixed on the sheet music. Beside the piano, a metronome is ticking, and a small stack of music books rests on the floor, suggesting a dedicated and repeated effort to learn and improve.", "image_file": "practice.jpg"}
{"en_translation": "study", "word": "勉強", "language_code": "ja", "examples": ["図書館で日本語を勉強します。", "毎日３時間ぐらい勉強しなければなりません。", "もっと熱心に勉強するべきだった。"], "description": "The act of learning or studying, typically in an academic context. It refers to the process of acquiring knowledge or skills, such as preparing for an exam, doing homework, or learning a new subject. It can be used as a noun ('study') or as a verb when combined with 'suru' ('to study').", "image_description": "A young person sitting at a wooden desk, completely absorbed in their work. The desk is covered with open textbooks, notebooks filled with handwritten notes, and a laptop displaying educational material. The person is holding a pen and has a focused, determined expression on their face. A desk lamp illuminates the scene, creating a quiet and studious atmosphere.", "image_file": "study.jpg"}
